{"id": 30001, "instruction_1": "Janet's ducks lay 16 eggs every day. Calculate how many eggs are laid daily.", "answer_1": "16", "instruction_2": "Subtract the three eggs Janet eats for breakfast from the total number of eggs laid.", "answer_2": "13", "instruction_3": "From the remaining eggs, subtract the four used for baking muffins.", "answer_3": "9", "instruction_4": "Janet sells the remaining eggs at $2 each at the farmers' market. Calculate the total amount of money Janet makes from selling the eggs.", "answer_4": "18"}
{"id": 30002, "instruction_1": "Calculate how many bolts of blue fiber are needed for a robe, knowing that a robe takes 2 bolts of blue fiber.", "answer_1": "2", "instruction_2": "A robe requires half as many bolts of white fiber as blue fiber. Calculate the number of white bolts needed based on the blue fiber requirement.", "answer_2": "1", "instruction_3": "Add the number of bolts of blue fiber and white fiber together to find out the total number of bolts needed for one robe.", "answer_3": "3"}
{"id": 30003, "instruction_1": "Josh buys a house for $80,000. Record this amount.", "answer_1": "80000", "instruction_2": "Josh spends an additional $50,000 on repairs. Add this amount to the purchase cost.", "answer_2": "130000", "instruction_3": "The repairs increase the house's value by 150%. Calculate the new value of the house based on the purchase cost.", "answer_3": "200000", "instruction_4": "Subtract the total investment from the new value of the house to determine Josh’s profit.", "answer_4": "70000"}
{"id": 30004, "instruction_1": "James decides to run 3 sprints 3 times a week. Calculate the total number of sprints James runs in a week.", "answer_1": "9", "instruction_2": "James runs 60 meters each sprint. Identify the distance he runs per sprint.", "answer_2": "60", "instruction_3": "Multiply the total number of sprints by the distance per sprint to find out how many meters James runs in total each week.", "answer_3": "540"}
{"id": 30005, "instruction_1": "Each of Wendi’s 20 chickens requires three cups of mixed feed daily. Multiply the number of chickens by the amount of feed each chicken requires to determine the total feed needed per day.", "answer_1": "60", "instruction_2": "In the morning, Wendi feeds her flock 15 cups of feed. Subtract this from the total daily feed requirement.", "answer_2": "45", "instruction_3": "In the afternoon, Wendi provides her chickens with 25 more cups of feed. Subtract this amount from the feed remaining after the morning feed.", "answer_3": "20", "instruction_4": "Calculate the amount of feed Wendi needs to give her chickens in the final meal of the day based on the remaining feed needed.", "answer_4": "20"}
{"id": 30006, "instruction_1": "Kylar wants to buy 16 glasses. Half of these will be odd-numbered (1st, 3rd, 5th, ...). Each odd-numbered glass costs $5. Calculate the cost for all odd-numbered glasses.", "answer_1": "40", "instruction_2": "Each even-numbered glass (2nd, 4th, 6th, ...) costs 60% of $5. Calculate the cost for all even-numbered glasses.", "answer_2": "24", "instruction_3": "Add the cost of the odd-numbered glasses and the cost of the even-numbered glasses to find the total amount Kylar needs to pay for 16 glasses.", "answer_3": "64"}
{"id": 30007, "instruction_1": "Seattle has 20 sheep. Charleston has 4 times as many sheep as Seattle. Calculate how many sheep Charleston has.", "answer_1": "80", "instruction_2": "Charleston has 80 sheep. Toulouse has twice as many sheep as Charleston. Calculate how many sheep Toulouse has.", "answer_2": "160", "instruction_3": "Add the number of sheep in Seattle, Charleston, and Toulouse to find the total number of sheep across all three cities.", "answer_3": "260"}
{"id": 30008, "instruction_1": "Carla is downloading a 200 GB file at a rate of 2 GB per minute. Calculate the amount of data downloaded in 40% of the time before Windows forces a restart.", "answer_1": "80", "instruction_2": "Windows forces a restart to install updates, which takes 20 minutes. Note the time lost due to this interruption.", "answer_2": "20", "instruction_3": "After the interruption, Carla must restart the download from the beginning. Calculate the total time it takes to download the entire 200 GB file at 2 GB per minute.", "answer_3": "100", "instruction_4": "Add the interruption time to the complete download time to find out the total time Carla spends on downloading the file.", "answer_4": "160"}
{"id": 30009, "instruction_1": "John drives for 3 hours at a speed of 60 mph. Calculate the distance he travels during this period.", "answer_1": "180", "instruction_2": "John drives back towards home but spends the first 2 hours in standstand traffic. Calculate the distance traveled during these 2 hours.", "answer_2": "0", "instruction_3": "After the traffic, John drives at a speed of 30 mph for the next half hour. Calculate the distance he covers in this half hour.", "answer_3": "15", "instruction_4": "John drives the remaining time at a speed of 80 mph. With 1.5 hours left of the 4 hours, calculate how far he drives in this remaining time.", "answer_4": "120", "instruction_5": "Sum the distances John traveled during the return trip and subtract this from the distance he traveled outbound to determine how far he is from home.", "answer_5": "45"}
{"id": 30010, "instruction_1": "Eliza earns $10 per hour for the first 40 hours she works each week. Multiply 40 hours by $10 to find her regular earnings.", "answer_1": "400", "instruction_2": "Eliza's overtime pay is 1.2 times her regular hourly rate. Multiply $10 by 1.2 to find the overtime rate per hour.", "answer_2": "12", "instruction_3": "Eliza worked 45 hours this week, which is 5 hours more than the regular 40 hours. Calculate her earnings for these 5 overtime hours.", "answer_3": "60", "instruction_4": "Add Eliza’s regular earnings and her overtime earnings to find her total earnings for the week.", "answer_4": "460"}
{"id": 30011, "instruction_1": "A new program had 60 downloads in the first month. Record the number of downloads.", "answer_1": "60", "instruction_2": "The number of downloads in the second month was three times as many as the downloads in the first month. Calculate the downloads for the second month.", "answer_2": "180", "instruction_3": "The number of downloads reduced by 30% in the third month from the second month. Calculate the downloads for the third month.", "answer_3": "126", "instruction_4": "Add the downloads from the first, second, and third months to find the total number of downloads the program had over these three months.", "answer_4": "366"}
{"id": 30012, "instruction_1": "Toula bought 3 dozen donuts at $68 per dozen. Multiply the quantity by the price per dozen.", "answer_1": "204", "instruction_2": "Toula purchased 2 dozen mini cupcakes at $80 per dozen. Multiply the quantity by the price per dozen.", "answer_2": "160", "instruction_3": "Toula acquired 6 dozen mini cheesecakes at $55 per dozen. Multiply the quantity by the price per dozen.", "answer_3": "330", "instruction_4": "Add the costs of the donuts, mini cupcakes, and mini cheesecakes to find the total amount Toula spent.", "answer_4": "694"}
{"id": 30013, "instruction_1": "Carlos is planting a lemon tree that costs $90. Record this cost.", "answer_1": "90", "instruction_2": "Each year, the lemon tree grows 7 lemons which Carlos sells for $1.5 each. Calculate the revenue from lemon sales per year.", "answer_2": "10.5", "instruction_3": "It costs $3 a year to water and feed the tree. Record this cost.", "answer_3": "3", "instruction_4": "Subtract the annual maintenance cost from the annual lemon sales revenue to find the net annual profit or loss.", "answer_4": "7.5", "instruction_5": "Calculate how many years it will take for the net annual profit to cover the initial planting cost of the lemon tree.", "answer_5": "12"}
{"id": 30014, "instruction_1": "Assuming Melanie finishes with 5 vacuum cleaners, calculate how many vacuum cleaners she had after selling half of what was left at the orange house. Multiply the remaining vacuum cleaners by 2.", "answer_1": "10", "instruction_2": "Before selling to the orange house, Melanie sold 2 more vacuum cleaners to the red house. Add these 2 vacuum cleaners to the total after selling to the orange house.", "answer_2": "12", "instruction_3": "Before selling to the red house, Melanie had sold a third of her vacuum cleaners at the green house. Multiply the vacuum cleaners before selling to the red house by 3/2 to find out how many she had before any were sold.", "answer_3": "18"}
{"id": 30015, "instruction_1": "In a dance class of 20 students, 20% enroll in contemporary dance. Calculate how many students that is.", "answer_1": "4", "instruction_2": "Subtract the number of students enrolled in contemporary dance from the total class size to find out how many are left.", "answer_2": "16", "instruction_3": "Of the remaining students, 25% enroll in jazz dance. Calculate how many students that is.", "answer_3": "4", "instruction_4": "Subtract the number of students enrolled in jazz dance from the remaining students to find out how many enroll in hip-hop dance.", "answer_4": "12", "instruction_5": "Calculate what percentage of the entire class of 20 students is enrolled in hip-hop dance.", "answer_5": "60"}
{"id": 30016, "instruction_1": "A merchant considers buying jewelry worth $5,000. Predict its value after a 2.5% increase.", "answer_1": "5125", "instruction_2": "The merchant also considers purchasing electronic gadgets worth $8,000. Predict their value after a 1.2% increase.", "answer_2": "8096", "instruction_3": "Subtract the original price of the jewelry from the increased value.", "answer_3": "125", "instruction_4": "Subtract the original price of the electronic gadgets from the increased value.", "answer_4": "96", "instruction_5": "Compare the profits from both options to determine which purchase would yield the highest profit.", "answer_5": "125"}
{"id": 30017, "instruction_1": "Two trains leave San Rafael at the same time and travel westward for 80 miles. Record the distance each train travels westward.", "answer_1": "80", "instruction_2": "The next day, both trains travel northwards, each covering 150 miles. Record the distance each train travels northward.", "answer_2": "150", "instruction_3": "Add the distances traveled westward and northward for each train to find the total distance covered by each train in two days.", "answer_3": "230"}
{"id": 30018, "instruction_1": "Jill gets paid $20 per hour as a teacher. She teaches for 35 hours a week. Multiply her hourly wage by the number of hours she teaches per week to find her weekly teaching income.", "answer_1": "700", "instruction_2": "Jill also earns $30 per hour as a cheerleading coach. She coaches for 15 hours a week. Multiply her hourly wage by the number of hours she coaches per week to determine her weekly coaching income.", "answer_2": "450", "instruction_3": "Add Jill's weekly teaching income and weekly coaching income to find her total weekly income.", "answer_3": "1150", "instruction_4": "Jill works 50 weeks a year. Multiply her total weekly income by the number of weeks she works per year to calculate her annual salary.", "answer_4": "57500"}
{"id": 30019, "instruction_1": "Claire makes a 3 egg omelet every morning for breakfast. Calculate how many eggs she uses daily.", "answer_1": "3", "instruction_2": "Multiply the number of eggs Claire uses daily by 7 to find out how many eggs she consumes in a week.", "answer_2": "21", "instruction_3": "Multiply the weekly egg consumption by 4 to determine how many eggs Claire consumes in 4 weeks.", "answer_3": "84", "instruction_4": "Divide the total number of eggs consumed in 4 weeks by 12 to calculate how many dozens of eggs Claire consumes.", "answer_4": "7"}
{"id": 30020, "instruction_1": "Marissa walked 4 miles in the first hour and 2 miles in the second hour. Calculate the total distance she has walked so far.", "answer_1": "6", "instruction_2": "The trail Marissa is hiking is 12 miles long. Subtract the distance she has already walked from the total trail distance.", "answer_2": "6", "instruction_3": "Marissa wants her average hiking speed to be 4 miles per hour for the entire 12-mile trail. Calculate the total time she should spend hiking to achieve this average speed.", "answer_3": "3", "instruction_4": "Marissa spent 1 hour on the first 4 miles and another hour on the next 2 miles. Add these times to find out how long she has been hiking.", "answer_4": "2", "instruction_5": "Subtract the time Marissa has already spent hiking from the total desired hiking time.", "answer_5": "1", "instruction_6": "Divide the remaining distance by the remaining time to find the speed Marissa needs to walk to finish the hike in her desired total time.", "answer_6": "6"}
{"id": 30021, "instruction_1": "You have 10 liters of orange drink that is two-thirds water. Calculate how much of the orange drink is water.", "answer_1": "6.67", "instruction_2": "You have 15 liters of pineapple drink that is three-fifths water. Calculate how much of the pineapple drink is water.", "answer_2": "9", "instruction_3": "You spill 1 liter from the orange drink. Subtract this from the original 10 liters to find out how much drink remains.", "answer_3": "9", "instruction_4": "After the spillage, recalculate the amount of water remaining in the 9 liters of orange drink, maintaining the original two-thirds water ratio.", "answer_4": "6", "instruction_5": "Add the recalculated water content from the remaining orange drink to the water content of the pineapple drink to find the total amount of water in the mixed 24 liters.", "answer_5": "15"}
{"id": 30022, "instruction_1": "Samantha is currently 31 years old. Raymond was born 6 years before Samantha. Calculate Raymond's current age.", "answer_1": "37", "instruction_2": "Raymond had a son at the age of 23. Calculate how old Raymond was when his son was born.", "answer_2": "23", "instruction_3": "Using Raymond’s current age of 37, determine how many years ago his son was born.", "answer_3": "14"}
{"id": 30023, "instruction_1": "Billy sells DVDs. On Tuesday, his first three customers buy one DVD each. Calculate the total DVDs sold to these three customers.", "answer_1": "3", "instruction_2": "His next two customers buy two DVDs each. Calculate the total DVDs sold to these two customers.", "answer_2": "4", "instruction_3": "His last three customers do not buy any DVDs. Calculate the total DVDs not sold to these three customers.", "answer_3": "0", "instruction_4": "Add together the DVDs sold to the first group of customers and the second group of customers to find out the total number of DVDs Billy sold on Tuesday.", "answer_4": "7"}
{"id": 30024, "instruction_1": "The candle burns from 1:00 PM to 5:00 PM. Calculate the total number of hours the candle burns.", "answer_1": "4", "instruction_2": "A candle melts by 2 centimeters for each hour it burns. How many centimeters will the candle melt in one hour?", "answer_2": "2", "instruction_3": "Multiply the total burning time by the candle's hourly shrinkage to find out how many centimeters shorter the candle will be after burning from 1:00 PM to 5:00 PM.", "answer_3": "8"}
{"id": 30025, "instruction_1": "Kyle bought last year's best-selling book for $19.50 with a 25% discount. Record the discounted price as $19.50.", "answer_1": "19.5", "instruction_2": "The book was purchased with a 25% discount. Record the discount rate as 25%.", "answer_2": "25%", "instruction_3": "Using the discounted price and the discount rate, calculate the original price before the discount was applied. Multiply the discounted price by 100 and then divide by the percentage remaining after the discount (100% - 25% = 75%).", "answer_3": "26"}
{"id": 30026, "instruction_1": "Marie ordered one chicken meal for $12. Calculate the cost of the chicken meal.", "answer_1": "12", "instruction_2": "Marie bought 5 packs of milk, each costing $3. Multiply the number of milk packs by the cost per pack.", "answer_2": "15", "instruction_3": "Marie also bought 4 apples, each costing $1.50. Multiply the number of apples by the cost per apple.", "answer_3": "6", "instruction_4": "Add the costs of the chicken meal, milk packs, and apples to find the total amount spent before buying pizza.", "answer_4": "33", "instruction_5": "Marie paid a total of $50. Subtract the total amount spent on the chicken meal, milk, and apples from $50 to find how much was spent on pizza.", "answer_5": "17", "instruction_6": "Each box of pizza costs $8.50. Divide the amount spent on pizza by the cost per box to determine how many boxes Marie ordered.", "answer_6": "2"}
{"id": 30027, "instruction_1": "Mishka bought 3 pairs of shorts, with each pair costing $16.50. Calculate the total cost for the shorts.", "answer_1": "49.5", "instruction_2": "Mishka also bought 3 pairs of pants, with each pair costing $22.50. Calculate the total cost for the pants.", "answer_2": "67.5", "instruction_3": "Additionally, Mishka bought 3 pairs of shoes, with each pair costing $42. Calculate the total cost for the shoes.", "answer_3": "126", "instruction_4": "Add up the total costs for the shorts, pants, and shoes to find out how much Mishka spent on all the clothing items.", "answer_4": "243"}
{"id": 30028, "instruction_1": "Cynthia eats one serving of ice cream every night. Determine how many servings of ice cream she consumes in 60 days.", "answer_1": "60", "instruction_2": "Each carton contains 15 servings of ice cream. Calculate how many cartons Cynthia needs for 60 days.", "answer_2": "4", "instruction_3": "Each carton of ice cream costs $4.00. Multiply the number of cartons Cynthia needs by the cost per carton to find out how much she will spend in 60 days.", "answer_3": "16"}
{"id": 30029, "instruction_1": "Henry made two stops during his 60-mile bike trip. Calculate the distance Henry traveled to his first stop after covering 20 miles.", "answer_1": "20", "instruction_2": "From the first stop, Henry continued biking until his second stop, which was 15 miles before the end of his 60-mile trip. Calculate the distance from the start to the second stop.", "answer_2": "45", "instruction_3": "Subtract the distance to the first stop from the distance to the second stop to find out how many miles Henry biked between his first and second stops.", "answer_3": "25"}
{"id": 30030, "instruction_1": "One pair of heels costs $33. The other pair costs twice as much. Calculate the cost of the second pair of heels.", "answer_1": "66", "instruction_2": "Add the cost of the first pair of heels ($33) to the cost of the second pair of heels ($66).", "answer_2": "99", "instruction_3": "The total cost of the two pairs of high heels is $99, which is five dollars less than the cost of the boots. Calculate the cost of the boots.", "answer_3": "104"}
{"id": 30031, "instruction_1": "Darrell and Allen's ages are in the ratio of 7:11. Combine these parts to determine the total parts represented in the age ratio.", "answer_1": "18", "instruction_2": "Given that Darrell and Allen's combined ages total 162 years, calculate the value of one part in their age ratio.", "answer_2": "9", "instruction_3": "Multiply the value of one part by the number of parts that represent Allen's age in the ratio to find his current age.", "answer_3": "99", "instruction_4": "Add 10 years to Allen's current age to find his age 10 years from now.", "answer_4": "109"}
{"id": 30032, "instruction_1": "Gunter’s first friend guesses there are 80 jelly beans in the jar. Record this guess.", "answer_1": "80", "instruction_2": "A second friend guesses there are 20 more than half the first guess. Calculate this guess.", "answer_2": "60", "instruction_3": "A third friend guesses 25% more than the first guess. Calculate this guess.", "answer_3": "100", "instruction_4": "Calculate the average of the guesses made by Gunter’s friends.", "answer_4": "80"}
{"id": 30033, "instruction_1": "ohn takes care of 10 dogs. Each dog requires 0.5 hours a day for walking and taking care of their business. Calculate the total hours John spends daily on one dog.", "answer_1": "0.5", "instruction_2": "Multiply the time spent on one dog by the total number of dogs to find out how many hours John spends each day taking care of all his dogs.", "answer_2": "5", "instruction_3": "Multiply the total daily care time by 7 to determine how many hours John spends in a week taking care of all his dogs.", "answer_3": "35"}
{"id": 30034, "instruction_1": "Raymond has 40 jewels. Calculate half of Raymond's total number of jewels.", "answer_1": "20", "instruction_2": "Aaron has 5 more jewels than half of Raymond’s jewels. Add 5 to the number calculated from the previous instruction.", "answer_2": "25", "instruction_3": "Siobhan has 2 fewer jewels than Aaron. Subtract 2 from Aaron's total number of jewels obtained in the previous instruction.", "answer_3": "23"}
{"id": 30035, "instruction_1": "Mike plays ping pong for 40 minutes and scores 4 points in the first 20 minutes. Record the points scored in the first half.", "answer_1": "4", "instruction_2": "In the second 20 minutes, Mike scores 25% more points than in the first 20 minutes. Calculate the points scored in the second half.", "answer_2": "5", "instruction_3": "Add the points scored in the first half to the points scored in the second half to find the total points Mike scored.", "answer_3": "9"}
{"id": 30036, "instruction_1": "Terry eats 2 yogurts a day, and they are currently on sale at 4 yogurts for $5.00. Calculate the cost of 2 yogurts.", "answer_1": "2.5", "instruction_2": "Multiply the daily cost of the yogurts by the number of yogurts Terry eats each day to find out how much he spends on yogurt daily.", "answer_2": "2.5", "instruction_3": "Multiply Terry's daily spending on yogurt by 30 to find out his total expenditure on yogurt over 30 days.", "answer_3": "75"}
{"id": 30037, "instruction_1": "John sells all his 13 Lego sets for $15 each. Calculate the total amount of money he receives from selling the Lego sets.", "answer_1": "195", "instruction_2": "John buys 8 video games, each costing $20. Calculate the total cost of the video games.", "answer_2": "160", "instruction_3": "Subtract the total cost of the video games from the total revenue from selling the Lego sets to find out how much money John has left.", "answer_3": "35"}
{"id": 30038, "instruction_1": "John runs 3 hours on the first day. If he runs 60 miles a week over 3 days, calculate how many miles he runs in those 3 hours on the first day.", "answer_1": "30", "instruction_2": "John runs half as much time on the second and third days as he does on the first day. Calculate the total running time for each of these days.", "answer_2": "1.5", "instruction_3": "Given the total miles John runs per week, and knowing he runs 30 miles on the first day, determine the total miles he runs on the second and third days combined.", "answer_3": "30", "instruction_4": "Divide the total distance run on the second and third days by 2 to find the distance run each day.", "answer_4": "15", "instruction_5": "Using the distance and time for each day, calculate John’s running speed for each day.", "answer_5": "10"}
{"id": 30039, "instruction_1": "Dana can skip at 3 miles per hour, and she can run at twice that speed. Calculate Dana's running speed.", "answer_1": "6", "instruction_2": "Dana can run at a rate of speed four times faster than she can walk. Calculate her walking speed based on her running speed.", "answer_2": "1.5", "instruction_3": "Dana spends one-third of her time running and two-thirds of her time walking during a six-hour period. Calculate the time she spends running.", "answer_3": "2", "instruction_4": "Using Dana’s running speed and her time spent running, calculate how many miles she covers while running.", "answer_4": "12", "instruction_5": "Using Dana’s walking speed and her time spent walking, calculate how many miles she covers while walking.", "answer_5": "6", "instruction_6": "Add the distances Dana traveled while running and walking to find the total distance she traveled in six hours.", "answer_6": "18"}
{"id": 30040, "instruction_1": "Suzy's iPhone is 1 year old. Record this age.", "answer_1": "1", "instruction_2": "Ben's iPhone is two times older than Suzy's iPhone. Calculate Ben's iPhone age.", "answer_2": "2", "instruction_3": "Brandon's iPhone is four times as old as Ben's iPhone. Determine how old Brandon's iPhone is.", "answer_3": "8"}
{"id": 30041, "instruction_1": "Polly can throw the gold javelin a distance of 400 feet when not holding the sapphire gemstone. Note this range.", "answer_1": "400", "instruction_2": "When holding the sapphire gemstone, Polly can throw the javelin three times farther than without it. Calculate the new distance she can throw the javalin.", "answer_2": "1200", "instruction_3": "The great dragon, Perg, can breathe fire to a distance of 1000 feet from its position atop Mount Farbo. Note this distance.", "answer_3": "1000", "instruction_4": "Subtract the dragon's flame range from the maximum distance Polly can throw the javelin while holding the gemstone to find out how far outside of the dragon's flames Polly can stand to still hit the dragon.", "answer_4": "200"}
{"id": 30042, "instruction_1": "Grandma Jones baked 5 apple pies for the fireman's luncheon and cut each pie into 8 pieces. Calculate the total number of pieces available.", "answer_1": "40", "instruction_2": "At the end of the evening, there were 14 pieces of pie remaining on the buffet table. Note this number.", "answer_2": "14", "instruction_3": "Subtract the number of pieces remaining from the total number of pieces to find out how many pieces were taken by the guests.", "answer_3": "26"}
{"id": 30043, "instruction_1": "A bag of chips has 250 calories per serving. Determine how many calories are in one serving of chips.", "answer_1": "250", "instruction_2": "If a 300g bag of chips contains 5 servings, calculate the number of grams per serving.", "answer_2": "60", "instruction_3": "Given a daily calorie target of 2000 and 1800 calories already consumed, calculate how many calories you can still consume today.", "answer_3": "200", "instruction_4": "With 250 calories per serving and each serving weighing 60 grams, determine how many grams of chips correspond to 200 remaining calories.", "answer_4": "48"}
{"id": 30044, "instruction_1": "Charlie needs one pound of beeswax to make 10 tapered candles. Calculate the cost of supplies for making 20 candles, knowing that one pound of beeswax and the wicks cost $10.00.", "answer_1": "20", "instruction_2": "Using the beeswax purchased, calculate the total number of candles Charlie can make with two pounds of beeswax, considering he can make 10 candles per pound.", "answer_2": "20", "instruction_3": "If Charlie sells each candle for $2.00, calculate the total revenue from selling 20 candles.", "answer_3": "40", "instruction_4": "Subtract the total cost of supplies from the total sales revenue to find the net profit from selling 20 candles.", "answer_4": "20"}
{"id": 30045, "instruction_1": "Meredith wrote 5 articles on Monday. Record this number.", "answer_1": "5", "instruction_2": "On Tuesday, Meredith wrote 2/5 times more articles than on Monday. Calculate the number of articles she wrote on Tuesday.", "answer_2": "7", "instruction_3": "On Wednesday, Meredith wrote twice the number of articles she wrote on Tuesday. Find out how many articles she wrote on Wednesday.", "answer_3": "14", "instruction_4": "Sum the articles written from Monday to Wednesday to find the total number of articles Meredith wrote.", "answer_4": "26", "instruction_5": "Meredith spends an average of 4 hours on each article. Multiply the total number of articles by the hours per article to calculate the total time she spent writing.", "answer_5": "104"}
{"id": 30046, "instruction_1": "Candice put 80 post-it notes in her purse before heading out. Record the initial count of post-it notes.", "answer_1": "80", "instruction_2": "At her job, Candice placed one Post-it note on each of 220 coffee cups. Subtract the number of Post-it notes used on the coffee cups from the initial count.", "answer_2": "-140", "instruction_3": "After placing Post-it notes on the coffee cups, Candice had 23 Post-it notes left. Calculate the final count of Post-it notes after distribution.", "answer_3": "23", "instruction_4": "Calculate how many Post-it notes were in the package Candice purchased, based on her initial count, usage, and remaining amount.", "answer_4": "163"}
{"id": 30047, "instruction_1": "John spent $200 on blue ties, with each costing $40. Calculate how many blue ties John bought.", "answer_1": "5", "instruction_2": "John buys twice as many red ties as blue ties. Determine the number of red ties bought.", "answer_2": "10", "instruction_3": "The cost of each red tie is 50% more than each blue tie, which costs $40. Calculate the cost of one red tie.", "answer_3": "60", "instruction_4": "Calculate the total cost John spent on red ties, using the number of red ties and the cost per red tie.", "answer_4": "600", "instruction_5": "Add the total spent on blue ties and the total spent on red ties to find out how much John spent on ties altogether.", "answer_5": "800"}
{"id": 30048, "instruction_1": "Tracy has a wire that is 4 feet long. State the total length of the wire.", "answer_1": "4", "instruction_2": "Convert the total length of the wire from feet to inches.", "answer_2": "48", "instruction_3": "The wire is cut into pieces each 6 inches long. Calculate how many 6-inch pieces can be made from the wire.", "answer_3": "8"}
{"id": 30049, "instruction_1": "Richard's apartment building has 15 floors, each with 8 units. Multiply the number of floors by the number of units per floor to find the total number of units.", "answer_1": "120", "instruction_2": "3/4 of the units in Richard's building are occupied. Calculate 3/4 of the total number of units to find out how many units are occupied.", "answer_2": "90", "instruction_3": "Subtract the number of occupied units from the total number of units to find the number of unoccupied units in the building.", "answer_3": "30"}
{"id": 30050, "instruction_1": "Lloyd’s chickens produce 252 eggs each day. Calculate the total number of eggs produced in a week.", "answer_1": "1764", "instruction_2": "Each dozen consists of 12 eggs. Divide the total weekly egg production by 12 to find out how many dozens Lloyd has.", "answer_2": "147", "instruction_3": "Lloyd sells eggs for $2 per dozen. Multiply the total dozens of eggs by the price per dozen to find out Lloyd's weekly earnings from egg sales.", "answer_3": "294"}
{"id": 30051, "instruction_1": "Tom's ship travels at 10 miles per hour and he is sailing from 1 PM to 4 PM. Calculate how long Tom sails for.", "answer_1": "3", "instruction_2": "Using the speed of 10 miles per hour and the travel time of 3 hours, calculate the total distance Tom's ship covers during the outbound journey.", "answer_2": "30", "instruction_3": "Tom travels back the same 30-mile distance at a rate of 6 miles per hour. Calculate how long it takes Tom to get back.", "answer_3": "5"}
{"id": 30052, "instruction_1": "Uriah decides to remove 30 comic books from his book bag. Each comic book weighs 1/4 pound. Calculate the total weight of the comic books removed.", "answer_1": "7.5", "instruction_2": "Uriah needs to remove a total of 15 pounds from his book bag. Subtract the weight of the comic books removed from the total weight he needs to remove.", "answer_2": "7.5", "instruction_3": "Each of Uriah's toys weighs 1/2 pound. Calculate how many toys he needs to remove to eliminate the remaining weight.", "answer_3": "15"}
{"id": 30053, "instruction_1": "Multiply the number of truck tires repaired on Thursday, which is 6, by the cost per truck tire repair, $60.", "answer_1": "360", "instruction_2": "Multiply the number of car tires repaired on Thursday, which is 4, by the cost per car tire repair, $40.", "answer_2": "160", "instruction_3": "Add the revenue from truck tires and car tires repaired on Thursday.", "answer_3": "520", "instruction_4": "Multiply the number of car tires repaired on Friday, which is 12, by the cost per car tire repair, $40.", "answer_4": "480", "instruction_5": "Compare the total revenue figures for Thursday and Friday and calculate how much more was earned on the higher revenue day.", "answer_5": "40"}
{"id": 30054, "instruction_1": "The Doubtfire sisters have 7 kittens adopted from the shelter. Record this number.", "answer_1": "7", "instruction_2": "Patchy, one of the house cats, has had thrice the number of kittens as the adopted ones. Calculate how many kittens Patchy has.", "answer_2": "21", "instruction_3": "Trixie, the other house cat, has had 12 kittens. Record this number.", "answer_3": "12", "instruction_4": "Add the number of adopted kittens, the kittens from Patchy, and the kittens from Trixie to find out how many kittens the Doubtfire family now has.", "answer_4": "40"}
{"id": 30055, "instruction_1": "Jean has 30 lollipops. Calculate how many lollipops Jean starts with.", "answer_1": "30", "instruction_2": "Jean eats 2 of the lollipops. Subtract the number of lollipops Jean eats from the total.", "answer_2": "28", "instruction_3": "With the remaining lollipops, calculate how many lollipops are left to be packaged.", "answer_3": "28", "instruction_4": "Jean wants to package 2 lollipops in one bag. Divide the remaining lollipops by 2 to find out how many bags Jean can fill.", "answer_4": "14"}
{"id": 30056, "instruction_1": "Peter buys a movie ticket for $7 and popcorn for another $7 each time he goes to the movies. Calculate the total cost for one movie visit.", "answer_1": "14", "instruction_2": "Peter has 42 dollars for the week to spend on going to the movies. Identify the total amount Peter has for movie outings this week.", "answer_2": "42", "instruction_3": "With the total weekly budget and the cost per movie visit, calculate how many times Peter can afford to go to the movies this week.", "answer_3": "3"}
{"id": 30057, "instruction_1": "A wooden bridge has a weight limit of 5000 pounds. Identify this as the maximum weight the bridge can handle.", "answer_1": "5000", "instruction_2": "The weight of the empty delivery truck along with its driver totals 3755 pounds. Record this combined weight.", "answer_2": "3755", "instruction_3": "Subtract the combined weight of the empty truck and driver from the bridge's weight limit to find out how much additional weight can be carried without exceeding the limit.", "answer_3": "15", "instruction_4": "Divide the remaining allowable weight by the weight of one box to determine the maximum number of boxes that can be loaded onto the truck.", "answer_4": "83"}
{"id": 30058, "instruction_1": "A raspberry bush has 6 clusters, with each cluster containing 20 raspberries. Calculate the total number of raspberries in all clusters.", "answer_1": "120", "instruction_2": "There are also 67 individual raspberries scattered across the bush. Add this number to the raspberries counted in the clusters.", "answer_2": "187", "instruction_3": "Sum the raspberries from the clusters and the scattered raspberries to find the total number of raspberries on the bush.", "answer_3": "187"}
{"id": 30059, "instruction_1": "A basket contains 25 oranges, of which 20% are unripe. Calculate how many oranges are unripe.", "answer_1": "5", "instruction_2": "Out of the 25 oranges, 2 are sour. Confirm this number.", "answer_2": "2", "instruction_3": "From the total of 25 oranges, 1 is bad. Confirm this number.", "answer_3": "1", "instruction_4": "Subtract the number of unripe, sour, and bad oranges from the total to find out how many oranges are good.", "answer_4": "17"}
{"id": 30060, "instruction_1": "Janet buys a brooch for her daughter and pays $500 for the materials and $800 for the jeweler's services. Add these amounts to calculate the total cost for materials and construction.", "answer_1": "1300", "instruction_2": "Janet insures the brooch, paying a premium that is 10% of the total cost calculated in the previous step. Calculate the insurance cost.", "answer_2": "130", "instruction_3": "Add the insurance cost to the total cost for materials and construction to find out how much Janet paid in total.", "answer_3": "1430"}
{"id": 30061, "instruction_1": "Marcy is promised an annual pension of $50,000 if she works for 40 years. Calculate her initial promised pension.", "answer_1": "50000", "instruction_2": "Starting after 20 years of service, Marcy's pension entitlement increases by 5% per year. Find the annual increase in the pension after 20 years.", "answer_2": "2500", "instruction_3": "Marcy decides to quit after working for 30 years. Calculate how many years she worked after the 20-year mark.", "answer_3": "10", "instruction_4": "Multiply the number of years worked after 20 years by the annual pension increase to determine the total increase in pension Marcy accrued by the time she quits.", "answer_4": "25000", "instruction_5": "Add the total increase in pension to the initial promised pension to find out Marcy's final annual pension amount when she quits after 30 years.", "answer_5": "75000"}
{"id": 30062, "instruction_1": "Aleena's streaming service costs $140 per month. Calculate the total amount she pays for the first six months.", "answer_1": "840", "instruction_2": "For the second half of the year, the streaming service charges Aleena 10% less. Calculate the new monthly charge.", "answer_2": "126", "instruction_3": "Calculate the total amount Aleena pays for the last six months with the discounted rate.", "answer_3": "756", "instruction_4": "Add the total paid in the first half of the year to the total paid in the second half to find out how much Aleena paid for the streaming service for the entire year.", "answer_4": "1596"}
{"id": 30063, "instruction_1": "Sophia has traveled 100 miles since last filling her tank and needed to put in 4 gallons of gas to fill it up again. Determine how many gallons were left in her tank before she refilled.", "answer_1": "8", "instruction_2": "With the trip covering 100 miles and using up 4 gallons of gas, calculate the number of miles Sophia's car covers per gallon of gas.", "answer_2": "25", "instruction_3": "Given that Sophia's car can travel 25 miles per gallon and her tank holds 12 gallons when full, calculate the total distance she can drive on a full tank.", "answer_3": "300"}
{"id": 30064, "instruction_1": "Jim spends 2 hours watching TV and then reads for 1 hour (half the time spent watching TV). Calculate the total hours spent on watching TV and reading in one day.", "answer_1": "3", "instruction_2": "Jim repeats his daily routine of watching TV and reading for a total of 3 days each week. Calculate the total hours he spends on these activities in one week.", "answer_2": "9", "instruction_3": "Calculate the total hours Jim spends on watching TV and reading over a period of 4 weeks.", "answer_3": "36"}
{"id": 30065, "instruction_1": "Each basketball team has 5 players. Calculate the total number of players for one girls' team and one boys' team combined.", "answer_1": "10", "instruction_2": "Each school has sent a girls' team and a boys' team. Multiply the number of players for both teams (from the previous step) by the number of teams per school.", "answer_2": "20", "instruction_3": "Each school has sent a coach for each team. Calculate the total number of coaches sent by one school.", "answer_3": "2", "instruction_4": "Add the total number of players and coaches sent by one school.", "answer_4": "22", "instruction_5": "There are four schools competing. Multiply the total number of people sent by one school by the number of schools.", "answer_5": "88"}
{"id": 30066, "instruction_1": "A treasure chest contains 175 diamonds. Record the number of diamonds.", "answer_1": "175", "instruction_2": "The chest has 35 fewer rubies than diamonds. Calculate the number of rubies.", "answer_2": "140", "instruction_3": "There are twice as many emeralds as rubies in the chest. Find the number of emeralds.", "answer_3": "280", "instruction_4": "Add the number of diamonds, rubies, and emeralds to find the total number of gems in the treasure chest.", "answer_4": "595"}
{"id": 30067, "instruction_1": "Dr. Wertz's school has twice as many boys as girls. If there are 60 girls, calculate the total number of students.", "answer_1": "180", "instruction_2": "Given that there are twice as many boys as girls, and there are 60 girls, calculate how many boys there are.", "answer_2": "120", "instruction_3": "The school has 5 students for every teacher. With the total number of students calculated, determine how many teachers are there.", "answer_3": "36"}
{"id": 30068, "instruction_1": "Bailey receives a weekly allowance of $5 for 8 weeks. Multiply $5 by 8 to find the total amount of allowance received.", "answer_1": "40", "instruction_2": "At the end of the 8 weeks, Bailey has a total of $100. Record this total amount.", "answer_2": "100", "instruction_3": "Subtract the total amount of allowance received over 8 weeks from the total amount after 8 weeks to find out how much money Bailey started with.", "answer_3": "60"}
{"id": 30069, "instruction_1": "Judy teaches 5 dance classes every day from Monday to Friday. Calculate the total number of classes she teaches during the weekdays.", "answer_1": "25", "instruction_2": "On Saturdays, Judy teaches 8 dance classes. Add this number to her weekday classes to get the total number of classes she teaches in a week.", "answer_2": "33", "instruction_3": "Each of Judy's classes has 15 students. Multiply the total number of weekly classes by the number of students per class.", "answer_3": "495", "instruction_4": "Judy charges $15 per student per class. Multiply the total number of students by the charge per student to find out how much she earns in one week.", "answer_4": "7425"}
{"id": 30070, "instruction_1": "Kelian has a recipe that includes 20 instructions. Record the number of instructions in this first recipe.", "answer_1": "20", "instruction_2": "The second recipe has twice as many instructions as the first one. Calculate the number of instructions for the second recipe.", "answer_2": "40", "instruction_3": "Add the number of instructions from the first recipe to the number of instructions from the second recipe to determine the total instructions Kelian must read to prepare both dishes.", "answer_3": "60"}
{"id": 30071, "instruction_1": "Tommy sells brownies for $3 each. If he sells 43 brownies, how much money does this generate?", "answer_1": "129", "instruction_2": "Tommy sells slices of cheesecake for $4 each. If he sells 23 slices, how much money does this generate?", "answer_2": "92", "instruction_3": "Combine the amounts from brownie and cheesecake sales to calculate the total money Tommy raises for his charity.", "answer_3": "221"}
{"id": 30072, "instruction_1": "Shiela bought five cell phones for $150 each. Multiply the number of cell phones by the cost per unit.", "answer_1": "750", "instruction_2": "A 2% interest is charged for each cell phone. Calculate 2% of the total cost and add it to the total cost.", "answer_2": "765", "instruction_3": "Shiela will pay the total cost in a 3-month installment. Divide the total cost including interest by 3.", "answer_3": "255"}
{"id": 30073, "instruction_1": "The top level of a 4-leveled sandcastle has a square footage of 16. Record this as the square footage for the top level.", "answer_1": "16", "instruction_2": "Each subsequent level of the sandcastle has double the square footage of the level above it. Calculate the square footage of the second level from the top.", "answer_2": "32", "instruction_3": "Continue doubling the square footage for the next lower level. Calculate the square footage for the third level from the top.", "answer_3": "64", "instruction_4": "Calculate the square footage of the bottom level, which is also double the square footage of the level above it.", "answer_4": "128", "instruction_5": "Add the square footage of all four levels and divide by the number of levels to find the average square footage per level.", "answer_5": "60"}
{"id": 30074, "instruction_1": "Cecilia has to feed her new puppy 1 cup of dog food every day for the first 180 days. Calculate the total cups of dog food needed for the first 180 days.", "answer_1": "180", "instruction_2": "After the first 180 days, Cecilia needs to feed her puppy 2 cups of dog food daily. Calculate the total cups of dog food needed for the remaining 185 days of the first year.", "answer_2": "370", "instruction_3": "Add the total cups of food needed for the first 180 days and the remaining 185 days to find out the total cups of dog food Cecilia’s puppy will need for the first year.", "answer_3": "550", "instruction_4": "If one bag of dog food contains 110 cups, calculate how many bags of dog food Cecilia will use in the first year.", "answer_4": "5"}
{"id": 30075, "instruction_1": "Sarah does 4 times as much laundry as David. If Sarah does 400 pounds of laundry, how much laundry does David do?", "answer_1": "100", "instruction_2": "Raymond does half as much laundry as Sarah. Calculate how much laundry Raymond does based on Sarah's total.", "answer_2": "200", "instruction_3": "Calculate the difference in the amount of laundry between Raymond and David.", "answer_3": "100"}
{"id": 30076, "instruction_1": "Vincent can buy flowers in packages of 3 for $2.50. Calculate the price per flower for this package.", "answer_1": "0.83", "instruction_2": "Vincent can also buy flowers in packages of 2 for $1. Calculate the price per flower for this package.", "answer_2": "0.5", "instruction_3": "Calculate how much it would cost Vincent to buy 18 flowers using only the larger package option.", "answer_3": "15", "instruction_4": "Calculate how much it would cost Vincent to buy 18 flowers using only the smaller package option.", "answer_4": "9", "instruction_5": "Compare the costs from the larger and smaller packages to find out how much Vincent saves by choosing the cheaper option.", "answer_5": "6"}
{"id": 30077, "instruction_1": "John takes his newly adopted dog to the groomer. The grooming service is priced at $100. Record this number.", "answer_1": "100", "instruction_2": "The groomer offers John a 30% discount for being a new customer. Calculate the discount amount.", "answer_2": "30", "instruction_3": "Subtract the discount amount from the original grooming cost to find out how much John has to pay.", "answer_3": "70"}
{"id": 30078, "instruction_1": "Two girls each received 1/6 of the 24 liters of water. Calculate how many liters of water both girls received together.", "answer_1": "8", "instruction_2": "A boy then received 6 liters of water. Calculate the total water given to the boy.", "answer_2": "6", "instruction_3": "Subtract the total water received by the two girls and the boy from the original 24 liters to find out how many liters of water are left.", "answer_3": "10"}
{"id": 30079, "instruction_1": "Charlie starts with 10 stickers. Then he buys 21 more stickers from a store and receives 23 stickers for his birthday. Calculate the total number of stickers Charlie has after receiving gifts and making his purchase.", "answer_1": "54", "instruction_2": "Charlie gives 9 stickers to his sister. Subtract the number of stickers given away from his total stickers.", "answer_2": "45", "instruction_3": "Charlie uses 28 stickers to decorate a greeting card. Subtract the number of stickers used for decoration from the remaining stickers.", "answer_3": "17", "instruction_4": "After giving some away and using others for decoration, calculate the number of stickers Charlie has left.", "answer_4": "17"}
{"id": 30080, "instruction_1": "Grace weighs 125 pounds. Alex weighs 2 pounds less than 4 times what Grace weighs. Calculate Alex’s weight.", "answer_1": "498", "instruction_2": "Add Grace's weight to Alex's weight to determine their combined total weight.", "answer_2": "623"}
{"id": 30081, "instruction_1": "Dan plants 3 rose bushes, and each bush has 25 roses. Multiply the number of rose bushes by the number of roses per bush.", "answer_1": "75", "instruction_2": "Each rose has 8 thorns. Multiply the total number of roses by the number of thorns per rose to find the total number of thorns.", "answer_2": "600"}
{"id": 30082, "instruction_1": "Gene has been vacationing since he was 23 years old and he is now 34 years old. Calculate the total number of years he has been vacationing.", "answer_1": "11", "instruction_2": "Gene goes on four vacations each year. Multiply the total number of years he has been vacationing by the number of vacations he takes each year.", "answer_2": "44", "instruction_3": "Gene uses one shirt from each vacation as a quilt block. Calculate the total number of quilt blocks for the quilt he is sewing.", "answer_3": "44"}
{"id": 30083, "instruction_1": "Greg's alarm is set to ring three times a day. The first time it went off today, it rang four times. Count the number of rings.", "answer_1": "4", "instruction_2": "The second time Greg's alarm went off, it rang for three times as long as the first time. Calculate how many times it rang on this occasion.", "answer_2": "12", "instruction_3": "The third time the alarm went off, it rang for half as long as it did the second time. Determine how many times it rang this third time.", "answer_3": "6", "instruction_4": "Add up the total number of times Greg's alarm rang for all three times today.", "answer_4": "22"}
{"id": 30084, "instruction_1": "Sylvie earns a monthly salary of $600. Calculate her annual salary based on this monthly rate.", "answer_1": "7200", "instruction_2": "Sylvie's salary is increased by 10% after completing five years at the company. Calculate her new annual salary after this increment.", "answer_2": "7920", "instruction_3": "Add another 10% increase to Sylvie’s new annual salary for the next year of service.", "answer_3": "8712", "instruction_4": "Add a third consecutive 10% increase to Sylvie’s annual salary for another year of service.", "answer_4": "9583"}
{"id": 30085, "instruction_1": "Christina invited 16 friends to her party, expecting that 1/4 of them will not attend. Calculate the number of friends expected to attend.", "answer_1": "12", "instruction_2": "Given that Christina needs .75 gift bags for each attending guest, calculate the total number of gift bags required for the expected attendees.", "answer_2": "9", "instruction_3": "Each gift bag costs $2. Multiply the total number of gift bags by the price per gift bag to find out how much Christina will spend on gift bags.", "answer_3": "18"}
{"id": 30086, "instruction_1": "Ted the T-Rex knows each adult dinosaur will eat 10 lbs of potato salad. There are 20 adults attending the picnic. Multiply the amount of potato salad one adult eats by the number of adults.", "answer_1": "200", "instruction_2": "A child dinosaur eats half as much as an adult. Calculate how many pounds of potato salad one child eats and multiply by the 5 children attending.", "answer_2": "25", "instruction_3": "Add the total pounds of potato salad needed for adults and children to find out how much Ted needs to bring to the picnic.", "answer_3": "225"}
{"id": 30087, "instruction_1": "Cindy has four pets. Record this number.", "answer_1": "4", "instruction_2": "Marcia has two more pets than Cindy. Add two to Cindy's number of pets to find Marcia's total.", "answer_2": "6", "instruction_3": "Jan has three times as many pets as Marcia. Multiply Marcia's number of pets by three.", "answer_3": "18", "instruction_4": "Add the number of pets owned by Cindy, Marcia, and Jan to find the total number of pets they all have together.", "answer_4": "28"}
{"id": 30088, "instruction_1": "James is 10 years old and 1 year younger than Corey. Calculate Corey's age.", "answer_1": "11", "instruction_2": "Amy is 2 years younger than Corey. Given Corey's age from the previous step, calculate Amy's age.", "answer_2": "9", "instruction_3": "Amy is 5 years older than Jackson. Using Amy's age from the previous step, find out how old Jackson is.", "answer_3": "4"}
{"id": 30089, "instruction_1": "Lee runs the 400-meter hurdles in 38 seconds. Record this time.", "answer_1": "38", "instruction_2": "Originally, Gerald ran the 400-meter hurdles two seconds slower than Lee. Calculate Gerald's original running time.", "answer_2": "40", "instruction_3": "Gerald improved his speed by 10% after changing his diet. Calculate his new running time by reducing his original time by 10%.", "answer_3": "36"}
{"id": 30090, "instruction_1": "Given there are two cats for every dog and there are 60 dogs, calculate the total number of cats.", "answer_1": "120", "instruction_2": "Add the number of dogs and cats together.", "answer_2": "180", "instruction_3": "The number of rabbit pets is twelve less than the combined number of dogs and cats. Calculate the number of rabbits.", "answer_3": "168", "instruction_4": "Add the total number of dogs, cats, and rabbits to find out how many pets are in the neighborhood.", "answer_4": "348"}
{"id": 30091, "instruction_1": "Out of 200 Grade 5 students, 2/5 are boys. Calculate the number of boys.", "answer_1": "80", "instruction_2": "Subtract the number of boys from the total number of students to find out how many are girls.", "answer_2": "120", "instruction_3": "2/3 of the girls are in the girl scout. Calculate how many girls are in the girl scout.", "answer_3": "80", "instruction_4": "Subtract the number of girls in the girl scout from the total number of girls to find out how many are not in the girl scout.", "answer_4": "40"}
{"id": 30092, "instruction_1": "Harry slept 9 hours last night. Calculate the hours Harry slept.", "answer_1": "9", "instruction_2": "Harry’s friend James slept only 2/3 of the amount that Harry slept. Calculate how many hours James slept.", "answer_2": "6", "instruction_3": "Calculate how many more hours Harry slept than James.", "answer_3": "3"}
{"id": 30093, "instruction_1": "Freda’s last batch of tomato sauce made 32 ounces of sauce. Calculate the original volume of canned tomatoes before cooking, knowing they lose half their volume when cooked into sauce.", "answer_1": "64", "instruction_2": "Each can of tomatoes is 16 ounces. Determine how many cans Freda used to get the original volume.", "answer_2": "4", "instruction_3": "Each 16 ounce can of tomatoes contains three tomatoes. Calculate how many tomatoes were in the number of cans used.", "answer_3": "12"}
{"id": 30094, "instruction_1": "There were originally 30 cars on the motorway. Start with this number.", "answer_1": "30", "instruction_2": "5 cars from the line decide to take an exit to avoid the traffic jam. Subtract these cars from the total.", "answer_2": "25", "instruction_3": "In the last 15 minutes of the traffic jam, 20 more cars drive through. Subtract these from the remaining cars after the exit is taken.", "answer_3": "5", "instruction_4": "Calculate how many cars drove through the traffic jam in the first 15 minutes.", "answer_4": "5"}
{"id": 30095, "instruction_1": "Mary received 18 new potted plants yesterday. She already has 2 potted plants on each of the 40 window ledges of her home. Calculate the total number of potted plants Mary has now.", "answer_1": "98", "instruction_2": "Mary has decided to give 1 potted plant from each of the 40 window ledges to friends and family tomorrow. Calculate the total number of potted plants she will give away.", "answer_2": "40", "instruction_3": "Subtract the number of potted plants Mary will give away from her total number of potted plants to find out how many potted plants she will have remaining.", "answer_3": "58"}
{"id": 30096, "instruction_1": "Jerome's first friend pressed the doorbell 20 times before Jerome opened the door. How many times did the first friend press the doorbell?", "answer_1": "20", "instruction_2": "Jerome's second friend pressed the doorbell 1/4 times more than the first friend. Calculate how many times the second friend pressed the doorbell.", "answer_2": "25", "instruction_3": "Jerome's fourth friend pressed the doorbell 60 times. How many times did the fourth friend press the doorbell?", "answer_3": "60", "instruction_4": "The third friend pressed the doorbell 10 times more than the fourth friend. Calculate how many times the third friend pressed the doorbell.", "answer_4": "70", "instruction_5": "Add the number of times all four friends pressed the doorbell. How many doorbell rings did the doorbell make in total?", "answer_5": "175"}
{"id": 30097, "instruction_1": "Solo has to read 4 pages from his Science textbook, 20 pages from his Social Studies textbook, 7 pages from his History textbook, and 8 pages from his Geography textbook. Calculate the total number of pages Solo needs to read.", "answer_1": "39", "instruction_2": "Solo read 15 pages on Monday. Subtract the number of pages read on Monday from the total number of pages he needs to read.", "answer_2": "24", "instruction_3": "Solo has 4 more days to complete all his reading. Calculate how many pages Solo has left to read after Monday.", "answer_3": "24", "instruction_4": "Given that Solo has 4 more days to complete his reading, calculate the average number of pages he needs to read per day.", "answer_4": "6"}
{"id": 30098, "instruction_1": "John drinks a glass of water with breakfast, lunch, dinner, and before bed every weekday. Calculate the total number of glasses of water John drinks each weekday.", "answer_1": "4", "instruction_2": "John follows this routine for five weekdays. Multiply the number of glasses of water he drinks each weekday by the number of weekdays.", "answer_2": "20", "instruction_3": "On weekends, John drinks a glass of water with breakfast, lunch, and before bed, but has a soda with dinner instead. Calculate the total number of glasses of water John drinks each day on weekends.", "answer_3": "3", "instruction_4": "John follows this routine for two weekend days. Multiply the number of glasses of water he drinks each day on weekends by the number of weekend days.", "answer_4": "6", "instruction_5": "Add the total number of glasses of water John drinks on weekdays to the total number of glasses he drinks on weekends to find out how many glasses of water John drinks in a week.", "answer_5": "26"}
{"id": 30099, "instruction_1": "A fog bank rolls in from the ocean and covers 3 miles of the city every 10 minutes. Calculate how many miles the fog covers in 10 minutes.", "answer_1": "3", "instruction_2": "The city is 42 miles across from the oceanfront to the opposite inland edge. Divide the total width of the city by the distance the fog covers in 10 minutes to determine the number of 3-mile segments in the city.", "answer_2": "14", "instruction_3": "Multiply the number of 3-mile segments by the time it takes to cover each segment to find the total time in minutes for the fog bank to cover the entire city.", "answer_3": "140"}
{"id": 30100, "instruction_1": "Poppy is solving a 1000-piece jigsaw puzzle. She places a quarter of the pieces on the board. Calculate the number of pieces Poppy places on the board.", "answer_1": "250", "instruction_2": "After Poppy places her pieces, calculate how many pieces are left to be placed.", "answer_2": "750", "instruction_3": "Poppy's mom then places a third of the remaining pieces on the board. Calculate the number of pieces Poppy's mom places.", "answer_3": "250", "instruction_4": "After Poppy's mom places her pieces, calculate how many jigsaw pieces are left to be placed.", "answer_4": "500"}
{"id": 30101, "instruction_1": "Amir eats 5 cookies. How many cookies does Amir eat?", "answer_1": "5", "instruction_2": "Cody eats three times as many cookies as Amir. If Amir eats 5 cookies, how many cookies does Cody eat?", "answer_2": "15", "instruction_3": "Sum the cookies eaten by Amir and Cody. If Amir eats 5 cookies and Cody eats three times as many cookies as Amir, how many cookies do both of them eat together?", "answer_3": "20"}
{"id": 30102, "instruction_1": "Frankie watches TV after finishing his homework every night. On Monday and Tuesday, he watched a 1-hour episode of his favorite show each night. Calculate the total TV time he watched on Monday and Tuesday combined.", "answer_1": "2", "instruction_2": "On Thursday, Frankie finished his homework early and watched a 1-hour episode and a 30-minute show. On Friday, he watched two 1-hour episodes. Calculate the total TV time he watched on Thursday and Friday combined.", "answer_2": "3.5", "instruction_3": "Frankie watched TV for a total of 7 hours during the week. Subtract the total TV time watched on Monday, Tuesday, Thursday, and Friday from the 7 hours to find out how much TV time he watched on Wednesday.", "answer_3": "1.5", "instruction_4": "On Wednesday, Frankie watched a few episodes of a 30-minute show. Given that he watched 1.5 hours of TV on Wednesday, calculate the number of 30-minute episodes he watched.", "answer_4": "3"}
{"id": 30103, "instruction_1": "Henry wants to make twice as many cookies as he did last year. He realizes he baked 15 more cookies than he meant to. He drops 5 cookies and now has a total of 110 cookies. Calculate the actual number of cookies Henry baked this year before dropping any.", "answer_1": "115", "instruction_2": "Given that Henry baked 15 more cookies than he intended, calculate the number of cookies he meant to bake this year.", "answer_2": "100", "instruction_3": "Henry intended to bake twice as many cookies this year as he did last year. Calculate the number of cookies Henry baked last year.", "answer_3": "50"}
{"id": 30104, "instruction_1": "A local gas station is selling gas for $3.00 a gallon. Calculate the total cost for 10 gallons of gas.", "answer_1": "30", "instruction_2": "An app company is offering $0.20 cashback per gallon if you fill up at this station. Calculate the total cashback for 10 gallons of gas.", "answer_2": "2", "instruction_3": "Subtract the total cashback from the total cost of 10 gallons of gas to find the final cost after cashback rewards.", "answer_3": "28"}
{"id": 30105, "instruction_1": "Beatrice's fruit roll-up was 2 roll-ups wide and 24 roll-ups long. Calculate the total number of roll-ups Beatrice ate.", "answer_1": "48", "instruction_2": "Marcell's fruit roll-up was 3 roll-ups wide and 14 roll-ups long. Calculate the total number of roll-ups Marcell ate.", "answer_2": "42", "instruction_3": "Add the total number of roll-ups eaten by Beatrice and Marcell.", "answer_3": "90", "instruction_4": "Divide the total number of roll-ups eaten by both Beatrice and Marcell by 2 to find the average number of roll-ups eaten.", "answer_4": "45"}
{"id": 30106, "instruction_1": "Julia’s boat was taking on two liters of water for every ten feet she rowed back towards shore. It took her sixteen seconds to row twenty feet. Calculate how many feet she rowed per second.", "answer_1": "1.25", "instruction_2": "Julia rowed at a speed of 1.25 feet per second, and the shore was 64 seconds away. Calculate the total distance to the shore in feet.", "answer_2": "80", "instruction_3": "Julia’s boat took on two liters of water for every ten feet she rowed. Calculate the total liters of water taken on per 10 feet.", "answer_3": "2", "instruction_4": "Given that the total distance to the shore is 80 feet and the boat takes on two liters of water for every ten feet rowed, calculate the total amount of water taken on by the time Julia reached the shore.", "answer_4": "16"}
{"id": 30107, "instruction_1": "A classroom has a whiteboard shared between 4 teachers. Each teacher has 2 lessons per day. Calculate the total number of lessons conducted in the classroom in one day.", "answer_1": "8", "instruction_2": "Each teacher uses the whiteboard in each lesson, and the whiteboard is cleaned 3 times per lesson. Determine the number of times the whiteboard is cleaned in one lesson.", "answer_2": "3", "instruction_3": "Using the result from the previous steps, calculate the total number of times the whiteboard is cleaned in a day by multiplying the number of lessons by the number of cleanings per lesson.", "answer_3": "24"}
{"id": 30108, "instruction_1": "Ryan plants 2 flowers each day in his garden. Calculate the total number of flowers Ryan plants in 15 days.", "answer_1": "30", "instruction_2": "Out of the total flowers planted, 5 did not grow. Subtract the number of flowers that did not grow from the total flowers planted.", "answer_2": "25", "instruction_3": "After accounting for the flowers that did not grow, determine how many flowers Ryan has in his garden.", "answer_3": "25"}
{"id": 30109, "instruction_1": "Jamal's phone can hold 1800 photographs, which is 6 times more than Brittany's phone. Calculate the maximum number of photographs Brittany's phone can hold.", "answer_1": "300", "instruction_2": "The maximum number of photographs Brittany's phone can hold is 50 times more than the number of birds in Jamal's photograph of the ducks at the zoo. Calculate the number of birds in Jamal's photograph.", "answer_2": "6"}
{"id": 30110, "instruction_1": "Katy makes coffee using teaspoons of sugar and cups of water in the ratio of 7:13. Calculate the total number of parts in the ratio (sugar + water).", "answer_1": "20", "instruction_2": "Katy used a total of 120 teaspoons of sugar and cups of water. Divide the total quantity by the total number of parts in the ratio to find the value of one part.", "answer_2": "6", "instruction_3": "Using the value of one part calculated, multiply it by the number of parts representing sugar in the ratio.", "answer_3": "42"}
{"id": 30111, "instruction_1": "John buys 2 pairs of shoes for each of his 3 children. Calculate the total number of pairs of shoes John buys.", "answer_1": "6", "instruction_2": "Each pair of shoes costs $60. Calculate the total cost for one pair of shoes.", "answer_2": "60", "instruction_3": "Multiply the total number of pairs of shoes by the cost per pair to find out how much John paid in total.", "answer_3": "360"}
{"id": 30112, "instruction_1": "A customs officer at the main port of SeaSide clearances counted 2 containers of imported vehicles, each having 5 vehicles inside. Calculate the total number of vehicles initially at the port.", "answer_1": "10", "instruction_2": "The next day, the total number of vehicles at the port became 30. Calculate how many additional vehicles were brought in on the second day.", "answer_2": "20", "instruction_3": "Assuming all the containers contain 5 vehicles, calculate the number of containers that were imported on the second day.", "answer_3": "4"}
{"id": 30113, "instruction_1": "Adrien earned $40,000 four years ago. Calculate his salary at that time.", "answer_1": "40000", "instruction_2": "Adrien's salary increased by 40% over four years. Calculate his new salary after the increase.", "answer_2": "56000", "instruction_3": "Adrien's salary was 30% higher than Lylah's four years ago. If Adrien earned $40,000, calculate Lylah's salary four years ago.", "answer_3": "30769.23", "instruction_4": "Add Adrien's new salary and Lylah's salary four years ago to find the total salary both were receiving four years later.", "answer_4": "86769.23"}
{"id": 30114, "instruction_1": "Miguel uses 2 pads of paper each week for his drawing. Calculate the total number of pads Miguel uses in a week.", "answer_1": "2", "instruction_2": "Each pad of paper has 30 sheets. Determine the total number of sheets in one pad.", "answer_2": "30", "instruction_3": "Multiply the number of pads used per week by the number of sheets per pad to find out how many sheets of paper Miguel uses each week.", "answer_3": "60", "instruction_4": "Assume there are 4 weeks in a month. Multiply the number of sheets used per week by 4 to find out how many sheets of paper Miguel uses every month.", "answer_4": "240"}
{"id": 30115, "instruction_1": "Morisette brought 5 apples and 8 oranges. Calculate the total number of fruits Morisette brought.", "answer_1": "13", "instruction_2": "Kael brought twice the number of apples and half the number of oranges than Morisette. Calculate how many apples Kael brought.", "answer_2": "10", "instruction_3": "Add the number of apples and oranges Kael brought to find the total number of fruits he brought.", "answer_3": "14", "instruction_4": "Add the total number of fruits brought by Morisette and Kael to find how many fruits they have in total.", "answer_4": "27"}
{"id": 30116, "instruction_1": "Sadie slept 8 hours on Monday. Write down the number of hours she slept on Monday.", "answer_1": "8", "instruction_2": "For the next two days (Tuesday and Wednesday), Sadie slept 2 hours less each night because she had to complete some assignments. Calculate the number of hours Sadie slept on Tuesday and Wednesday.", "answer_2": "6", "instruction_3": "For the remaining four days of the week (Thursday to Sunday), Sadie slept 1 hour more each night than she did on Tuesday and Wednesday. Calculate the number of hours Sadie slept each night from Thursday to Sunday.", "answer_3": "7", "instruction_4": "Add up the number of hours Sadie slept each night from Monday to Sunday to find out how many hours she slept in total throughout the week.", "answer_4": "48"}
{"id": 30117, "instruction_1": "Rosie runs at a speed of 10 miles per hour for 3 hours. Calculate the distance she covers in the first 3 hours.", "answer_1": "30", "instruction_2": "Rosie runs for a total of 7 hours. Subtract the 3 hours she runs at 10 miles per hour from the total time to find how many hours she runs at the slower speed.", "answer_2": "4", "instruction_3": "After running for 3 hours at 10 miles per hour, Rosie runs at 5 miles per hour for the remaining time. Calculate the distance she covers in the remaining 4 hours.", "answer_3": "20", "instruction_4": "Add the distance Rosie runs at 10 miles per hour to the distance she runs at 5 miles per hour to find the total distance she runs in 7 hours.", "answer_4": "50"}
{"id": 30118, "instruction_1": "Jennie has a pile of 60 letters needing stamps. Calculate the number of letters Jennie needs to put stamps on, which is one-third of the pile needing stamps.", "answer_1": "20", "instruction_2": "Jennie puts stamps on one-third of the letters needing stamps. Add this number to the existing 30 letters in the pile of already-stamped letters to find the new total number of stamped letters.", "answer_2": "50", "instruction_3": "Given that there are now 30 letters in the pile of already-stamped letters and Jennie added 20 more stamped letters, calculate how many letters were initially in the already-stamped pile before Jennie began.", "answer_3": "10"}
{"id": 30119, "instruction_1": "Julia's husband bought a package of 5 new spoons and gave them to Julia. After using three spoons to sample her stew, she had a total of 12 spoons left. Calculate how many spoons Julia had before her husband gave her the new spoons.", "answer_1": "10", "instruction_2": "Julia used three spoons to sample her stew. Determine how many spoons she had before using these three spoons.", "answer_2": "13", "instruction_3": "Julia's husband bought a package of 5 new spoons. Subtract these 5 spoons from the total number of spoons she had before sampling the stew to find out how many spoons Julia had initially.", "answer_3": "8", "instruction_4": "Julia's total initial spoon count, before her husband gave her the new spoons, came from her own package of spoons. Calculate the number of spoons in the package that Julia bought.", "answer_4": "8"}
{"id": 30120, "instruction_1": "Dylan bought 38 chicken sausages. Note the number of chicken sausages he bought.", "answer_1": "38", "instruction_2": "Dylan bought 6 more fish sausages than chicken sausages. Calculate the number of fish sausages he bought.", "answer_2": "44", "instruction_3": "Add the number of chicken sausages and fish sausages to find the total number of sausages Dylan bought.", "answer_3": "82"}
{"id": 30121, "instruction_1": "Lily made 50 friends at her new school. Write down the number of friends Lily made.", "answer_1": "50", "instruction_2": "Amy made 20 more friends than Lily. Calculate the number of friends Amy made.", "answer_2": "70", "instruction_3": "Add the number of friends Lily made to the number of friends Amy made to find out how many friends they have together.", "answer_3": "120"}
{"id": 30122, "instruction_1": "Each pepper costs $15. Calculate the cost of a watermelon, which is three times the cost of a pepper.", "answer_1": "45", "instruction_2": "An orange costs $5 less than a watermelon. Calculate the cost of an orange.", "answer_2": "40", "instruction_3": "Dillon buys 4 watermelons. Calculate the total cost for 4 watermelons.", "answer_3": "180", "instruction_4": "Dillon buys 20 peppers. Calculate the total cost for 20 peppers.", "answer_4": "300", "instruction_5": "Dillon buys 10 oranges. Calculate the total cost for 10 oranges.", "answer_5": "400", "instruction_6": "Calculate the total amount of money Dillon will spend by adding the total costs of watermelons, peppers, and oranges.", "answer_6": "880"}
{"id": 30123, "instruction_1": "A hospital sees 500 people a day. Each patient is seen for an average of 24 minutes. Calculate the total time (in hours) that doctors spend with patients daily.", "answer_1": "200", "instruction_2": "The hospital charges the patients $200 an hour. Calculate the total amount charged to all patients daily.", "answer_2": "40000", "instruction_3": "The doctors charge $150 an hour to the hospital. Calculate the total amount the hospital pays the doctors daily.", "answer_3": "30000", "instruction_4": "Calculate the profit the hospital makes from the visits by subtracting the total amount paid to doctors from the total amount charged to patients daily.", "answer_4": "10000"}
{"id": 30124, "instruction_1": "Nissa hires 60 seasonal workers to play elves in her department store's Santa village. How many elves did Nissa hire initially?", "answer_1": "60", "instruction_2": "A third of the elves quit after children vomit on them. How many elves quit due to vomiting?", "answer_2": "20", "instruction_3": "Subtract the number of elves who quit after being vomited on from the initial number of elves. How many elves are left?", "answer_3": "40", "instruction_4": "After the vomiting incident, 10 of the remaining elves quit after kids kick their shins. How many elves quit due to kicking?", "answer_4": "10", "instruction_5": "Subtract the number of elves who quit after being kicked from the remaining elves after the vomiting incident. How many elves are left?", "answer_5": "30"}
{"id": 30125, "instruction_1": "Joseph's expenditure in May was $500. Record the expenditure for May.", "answer_1": "500", "instruction_2": "In June, Joseph's expenditure was $60 less than in May. Subtract $60 from Joseph's May expenditure to find his June expenditure.", "answer_2": "440", "instruction_3": "Add Joseph's expenditures for May and June to find his total expenditure for the two months.", "answer_3": "940"}
{"id": 30126, "instruction_1": "Pam rode the roller coaster 2 times. Each ride costs 6 tickets. Calculate how many tickets Pam used for the roller coaster rides.", "answer_1": "12", "instruction_2": "Fred rode the roller coaster 4 times. Each ride costs 6 tickets. Calculate how many tickets Fred used for the roller coaster rides.", "answer_2": "24", "instruction_3": "Pam rode the luge 2 times. Each ride costs 6 tickets. Calculate how many tickets Pam used for the luge rides.", "answer_3": "12", "instruction_4": "Fred rode the luge 2 times. Each ride costs 6 tickets. Calculate how many tickets Fred used for the luge rides.", "answer_4": "12", "instruction_5": "Add up all the tickets Pam and Fred used for both the roller coaster and the luge rides to find the total number of tickets they used that day.", "answer_5": "60"}
{"id": 30127, "instruction_1": "Walt walked 4 miles on Monday. On Tuesday, he walked 6 times as many miles as he walked on Monday. Calculate the number of miles Walt walked on Tuesday.", "answer_1": "24", "instruction_2": "Add the miles Walt walked on Monday to the miles he walked on Tuesday.", "answer_2": "28", "instruction_3": "Walt's total mileage from Monday through Wednesday was 41 miles. Subtract the total miles walked on Monday and Tuesday from the total mileage to find out how many miles Walt walked on Wednesday.", "answer_3": "13"}
{"id": 30128, "instruction_1": "Tom gets 4 car washes a month. Each car wash costs $15. Calculate how much Tom spends on car washes in a month.", "answer_1": "60", "instruction_2": "Using the monthly cost of $60, calculate how much Tom spends on car washes in a year.", "answer_2": "720"}
{"id": 30129, "instruction_1": "Brian originally had 20 video games but lost 5 right before the comparison was made. Calculate how many video games Brian has now.", "answer_1": "15", "instruction_2": "Bobby has 5 fewer than 3 times as many video games as Brian does. Using Brian's current number of video games, calculate how many video games Bobby has.", "answer_2": "40"}
{"id": 30130, "instruction_1": "There are 27 unicorns left in the world. One third of them are in the Scottish Highlands. Calculate the number of unicorns in the Scottish Highlands.", "answer_1": "9", "instruction_2": "Two thirds of the unicorns in the Scottish Highlands are female. Calculate the number of female unicorns in the Scottish Highlands.", "answer_2": "6"}
{"id": 30131, "instruction_1": "Rory orders 2 subs for $7.50 each. Calculate the total cost for the subs.", "answer_1": "15", "instruction_2": "Rory orders 2 bags of chips for $1.50 each. Calculate the total cost for the chips.", "answer_2": "3", "instruction_3": "Rory orders 2 cookies for $1.00 each. Calculate the total cost for the cookies.", "answer_3": "2", "instruction_4": "Add the total cost of the subs, chips, and cookies to find the total food cost.", "answer_4": "20", "instruction_5": "There’s a 20% delivery fee added at checkout. Calculate the delivery fee based on the total food cost.", "answer_5": "4", "instruction_6": "Add the delivery fee and a $5.00 tip to the total food cost to find the total delivery order cost.", "answer_6": "29"}
{"id": 30132, "instruction_1": "Mark took a test yesterday that consisted of 75 questions. He completed the test at a rate of 5 questions per hour. If he had 8 hours to complete the test, calculate the number of questions he completed.", "answer_1": "40", "instruction_2": "From the first test, calculate how many questions Mark left incomplete.", "answer_2": "35", "instruction_3": "Today, Mark took another test of 100 questions at the same rate of 5 questions per hour. If he had 6 hours to complete the test, calculate the number of questions he completed.", "answer_3": "30", "instruction_4": "From the second test, calculate how many questions Mark left incomplete.", "answer_4": "70", "instruction_5": "Add the number of incomplete questions from both tests to find out the total number of questions Mark left incomplete.", "answer_5": "105"}
{"id": 30133, "instruction_1": "There are 12 blue gumballs in the candy machine. Record the number of blue gumballs.", "answer_1": "12", "instruction_2": "Multiply the number of blue gumballs by 4 to find four times the number of blue gumballs.", "answer_2": "48", "instruction_3": "Add 22 to the result from the previous step to find the total number of pink gumballs.", "answer_3": "70", "instruction_4": "Record the total number of pink gumballs in the candy machine.", "answer_4": "70"}
{"id": 30134, "instruction_1": "There are 20 cars available for rent. Determine the total number of cars.", "answer_1": "20", "instruction_2": "Out of the 20 cars, 12 are automatic. Calculate the number of automatic cars.", "answer_2": "12", "instruction_3": "Out of the 20 cars, 4 are manual. Calculate the number of manual cars.", "answer_3": "4", "instruction_4": "Determine the number of semi-automatic cars by subtracting the number of automatic and manual cars from the total number of cars.", "answer_4": "4", "instruction_5": "Of the 20 cars, subtract the 12 automatic cars and the 4 manual cars to find the number of semi-automatic cars.", "answer_5": "4", "instruction_6": "Determine the percentage of cars that are semi-automatic by dividing the number of semi-automatic cars by the total number of cars and multiplying by 100.", "answer_6": "20%"}
{"id": 30135, "instruction_1": "Jordan plays video games for 2 hours every day. Calculate the total number of hours he spends playing video games in one day.", "answer_1": "2", "instruction_2": "Jordan has a part-time job where he earns $10 an hour. Calculate how much he would earn in one day if he spent his video game time working instead.", "answer_2": "20", "instruction_3": "Calculate the total number of hours Jordan plays video games in one week.", "answer_3": "14", "instruction_4": "If Jordan spent all his video game time working instead, calculate his total earnings in one week.", "answer_4": "140"}
{"id": 30136, "instruction_1": "John buys milk for $2 and eggs for $3. Calculate the total cost of food items.", "answer_1": "5", "instruction_2": "John buys light bulbs for $3, cups for $3, and roach traps for $4. Calculate the total cost of nonfood items.", "answer_2": "10", "instruction_3": "There is a 10% tax on all nonfood items. Calculate the total tax on the nonfood items.", "answer_3": "1", "instruction_4": "Add the tax on nonfood items to the total cost of nonfood items.", "answer_4": "11", "instruction_5": "Add the total cost of food items to the total cost of nonfood items including tax.", "answer_5": "16"}
{"id": 30137, "instruction_1": "Kim has 3 current clients and is confident about getting 5 more. Calculate the total number of clients Kim will have.", "answer_1": "8", "instruction_2": "Each client's home requires 2 bottles of bleach. Calculate the total number of bottles of bleach needed for all clients.", "answer_2": "16", "instruction_3": "Each bottle of bleach costs $2. Calculate the total cost for all the bottles of bleach needed.", "answer_3": "32", "instruction_4": "Each client's home requires a pack of cloths. Calculate the total number of packs of cloths needed for all clients.", "answer_4": "8", "instruction_5": "Each pack of cloths costs $5. Calculate the total cost for all the packs of cloths needed.", "answer_5": "40", "instruction_6": "Kim's total income each week is $92. Calculate his weekly profit by subtracting the total expenses (cost of bleach and cloths) from his total income.", "answer_6": "20"}
{"id": 30138, "instruction_1": "John has 10 hectares of a pineapple field. There are 100 pineapples per hectare. Calculate the total number of pineapples in one hectare.", "answer_1": "100", "instruction_2": "Multiply the number of pineapples per hectare by the total number of hectares John has.", "answer_2": "1000", "instruction_3": "John can harvest his pineapples every 3 months. Calculate how many times John can harvest his pineapples in one year.", "answer_3": "4", "instruction_4": "Multiply the total number of pineapples in all hectares by the number of harvests per year.", "answer_4": "4000"}
{"id": 30139, "instruction_1": "Johnny dumped a lego boxed set with 500 pieces on the floor. Calculate the number of pieces in this set.", "answer_1": "500", "instruction_2": "Johnny also dumped another lego set that had 3 times more pieces than the 500-piece set. Calculate the number of pieces in this second set.", "answer_2": "1500", "instruction_3": "Johnny also dumped a third lego set that had 1/4 the number of pieces of the 500-piece set. Calculate the number of pieces in this third set.", "answer_3": "125", "instruction_4": "Add the number of pieces from all three lego sets to find the total number of lego pieces Johnny dumped on the floor.", "answer_4": "2125", "instruction_5": "Johnny picks up all the lego pieces from the floor. Calculate the total number of lego pieces he picks up.", "answer_5": "2125"}
{"id": 30140, "instruction_1": "Debra sees 30 bees leave the hive in the first 6 hours. Record the number of bees that left.", "answer_1": "30", "instruction_2": "In the next 6 hours, Debra sees half as many bees return as those that left in the first 6 hours. Calculate the number of bees returning.", "answer_2": "15", "instruction_3": "In the next 6 hours, Debra sees two times as many bees as those that left in the first 6 hours fly from the hive. Calculate the number of bees leaving.", "answer_3": "60", "instruction_4": "Determine the number of bees that left before the last 6 hours and haven't already returned.", "answer_4": "75", "instruction_5": "All remaining bees that left before the last 6 hours return to the hive in the final 6 hours of the day. Calculate the number of bees returning.", "answer_5": "75"}
{"id": 30141, "instruction_1": "The cost of admission is $12 for adults and $10 for children. Calculate the total cost for 1 adult ticket and 1 child ticket.", "answer_1": "22", "instruction_2": "Brittany's mom received $8 in change after paying for 1 adult ticket and 1 child ticket. Determine the amount of change received.", "answer_2": "8", "instruction_3": "If the total cost for the tickets is $22 and Brittany's mom received $8 in change, calculate the total amount of money she gave to the cashier.", "answer_3": "30"}
{"id": 30142, "instruction_1": "Charlie has three times as many Facebook friends as Dorothy. If Charlie has 12 friends on Facebook, how many friends does Dorothy have? Divide Charlie's friends by 3.", "answer_1": "4", "instruction_2": "James has four times as many friends on Facebook as Dorothy. If Dorothy has 4 friends, how many friends does James have? Multiply Dorothy's friends by 4.", "answer_2": "16"}
{"id": 30143, "instruction_1": "Steve lives 3 miles from the school. Convert this distance to feet (1 mile = 5280 feet).", "answer_1": "15840", "instruction_2": "Steve can bike at 440 feet per minute. Calculate the time it takes for Steve to bike home from school.", "answer_2": "36", "instruction_3": "Tim lives 2 miles from the school. Convert this distance to feet (1 mile = 5280 feet).", "answer_3": "10560", "instruction_4": "Tim can ride his skateboard at 264 feet per minute. Calculate the time it takes for Tim to skateboard home from school.", "answer_4": "40", "instruction_5": "Calculate how long the winner will be waiting at their house before the loser finishes the race.", "answer_5": "4"}
{"id": 30144, "instruction_1": "Five people on bicycles each came by to get both tires inflated. Calculate the total number of bicycle tires inflated.", "answer_1": "10", "instruction_2": "Three people on tricycles each came by to get all their tricycle tires inflated. Calculate the total number of tricycle tires inflated.", "answer_2": "9", "instruction_3": "One person came by on a unicycle to get their tire inflated. Calculate the total number of unicycle tires inflated.", "answer_3": "1", "instruction_4": "Add the total number of tires from bicycles, tricycles, and unicycles to get the total number of tires inflated on the first day.", "answer_4": "20", "instruction_5": "Each tire costs 25 cents to inflate. Calculate the total earnings in cents by multiplying the total number of tires inflated by 25.", "answer_5": "500", "instruction_6": "Convert the total earnings from cents to dollars by dividing by 100.", "answer_6": "5"}
{"id": 30145, "instruction_1": "Carl buys ten packs of cookies. Each pack has six cookies. Calculate the total number of cookies Carl buys.", "answer_1": "60", "instruction_2": "Each cookie costs $0.10. Calculate the cost of one pack of cookies.", "answer_2": "0.6", "instruction_3": "Multiply the total number of cookies by the cost per cookie to find the total amount Carl spends on cookies.", "answer_3": "6", "instruction_4": "Carl pays with a $10 bill. Identify the total amount Carl pays.", "answer_4": "10", "instruction_5": "Subtract the total cost of the cookies from the amount Carl pays to find out how much change Carl receives.", "answer_5": "4"}
{"id": 30146, "instruction_1": "Dave ate fourteen french fries before a hungry seagull stole the pack. Determine the number of french fries Dave ate.", "answer_1": "14", "instruction_2": "The seagull ate half the amount of french fries that Dave ate. Calculate the number of fries the seagull ate.", "answer_2": "7", "instruction_3": "Three pigeons bullied the seagull away and each pigeon ate three fries. Calculate the total number of fries eaten by the pigeons.", "answer_3": "9", "instruction_4": "After Dave, the seagull, and the pigeons ate, there were some fries left. Later, a raccoon stole two-thirds of the remaining fries. Calculate the number of fries left after the raccoon stole some and the ants carried off one fry, leaving five behind.", "answer_4": "15", "instruction_5": "Sum the fries eaten by Dave, the seagull, and the pigeons, then add the fries remaining after the raccoon and ants. Determine the total number of fries before the seagull stole the pack.", "answer_5": "45", "instruction_6": "Add the fries eaten by Dave to the total number of fries remaining after the seagull, pigeons, raccoon, and ants took their share. Determine the initial number of french fries in the pack when Dave bought it.", "answer_6": "59"}
{"id": 30147, "instruction_1": "Kimo has three 1-hour classes each on Mondays, Wednesdays, and Fridays. Calculate the total number of hours he spends in classes on these days each week.", "answer_1": "9", "instruction_2": "Kimo has two 2-hour classes each on Tuesdays and Thursdays. Calculate the total number of hours he spends in classes on these days each week.", "answer_2": "8", "instruction_3": "Add the total number of class hours Kimo spends on Mondays, Wednesdays, and Fridays to the total number of class hours on Tuesdays and Thursdays to find his total weekly class hours.", "answer_3": "17", "instruction_4": "There are 16 weeks in a semester. Multiply Kimo's total weekly class hours by the number of weeks in a semester to find the total number of hours he spends attending classes in one semester.", "answer_4": "272"}
{"id": 30148, "instruction_1": "Bill bakes 300 rolls every day, and each roll is 4 inches long. Calculate the total length of the rolls in inches.", "answer_1": "1200", "instruction_2": "Bill bakes 120 chocolate croissants every day, and each croissant is 6 inches long. Calculate the total length of the chocolate croissants in inches.", "answer_2": "720", "instruction_3": "Bill bakes 60 baguettes every day, and each baguette is 2 feet long. Convert the length of the baguettes to inches (1 foot = 12 inches) and calculate the total length in inches.", "answer_3": "1440", "instruction_4": "Add the total lengths of the rolls, chocolate croissants, and baguettes to find the combined length in inches.", "answer_4": "3360", "instruction_5": "Convert the combined length from inches to feet (1 foot = 12 inches).", "answer_5": "280"}
{"id": 30149, "instruction_1": "The zookeeper needs 200 bananas for the monkeys every month. Calculate the total number of bananas needed for the monkeys in one month.", "answer_1": "200", "instruction_2": "The zookeeper needs 400 bananas for the gorillas every month. Calculate the total number of bananas needed for the gorillas in one month.", "answer_2": "400", "instruction_3": "The zookeeper needs 100 bananas for the baboons every month. Calculate the total number of bananas needed for the baboons in one month.", "answer_3": "100", "instruction_4": "Add the number of bananas needed for the monkeys, gorillas, and baboons to find the total number of bananas needed for all the apes in one month.", "answer_4": "700", "instruction_5": "Multiply the total number of bananas needed in one month by 2 to find the total number of bananas needed for 2 months.", "answer_5": "1400"}
{"id": 30150, "instruction_1": "Blake runs back and forth 15 times on a football field that is 100 yards long. Calculate the total distance Blake runs.", "answer_1": "3000", "instruction_2": "Kelly runs back and forth once on the football field that is 100 yards long. Calculate the total distance for this run.", "answer_2": "200", "instruction_3": "Kelly then runs to the 40-yard line and back, doing this 34 times. Calculate the total distance for one run to the 40-yard line and back.", "answer_3": "80", "instruction_4": "Multiply the distance of one run to the 40-yard line and back by 34 to get the total distance Kelly runs for these 34 runs.", "answer_4": "2720", "instruction_5": "Add Kelly's initial run distance to her total distance for the 34 runs to get her overall distance run.", "answer_5": "2920", "instruction_6": "Calculate how much farther the winner runs than the loser by subtracting the shorter distance from the longer distance.", "answer_6": "80"}
{"id": 30151, "instruction_1": "Raphael bought 4 pens which cost $1.5 each. Calculate the total cost of the pens.", "answer_1": "6", "instruction_2": "Raphael bought 2 notebooks which cost $4 each. Calculate the total cost of the notebooks.", "answer_2": "8", "instruction_3": "Raphael bought a rim of bond paper which cost $20. Determine the total cost of the bond paper.", "answer_3": "20", "instruction_4": "Add the total cost of the pens, notebooks, and bond paper to find out how much Raphael spent in total.", "answer_4": "34"}
{"id": 30152, "instruction_1": "Finn watches 11 tadpoles swimming in the pond. Calculate the total number of tadpoles he initially sees.", "answer_1": "11", "instruction_2": "Suddenly, 6 tadpoles come out of hiding from under a lily pad. Add the number of tadpoles that come out of hiding to the initial number of tadpoles.", "answer_2": "17", "instruction_3": "Next, 2 of the tadpoles hide under a rock. Subtract the number of tadpoles that hide under the rock from the current total.", "answer_3": "15", "instruction_4": "Calculate the number of tadpoles Finn can see in the pond now.", "answer_4": "15"}
{"id": 30153, "instruction_1": "A tank of water has a depth of 17 feet on Monday. On Tuesday, the tank had 7 feet more water. Calculate the water depth on Tuesday.", "answer_1": "24", "instruction_2": "On Wednesday, the depth of the water is two thirds of what it was on Tuesday. Calculate two thirds of the water depth from Tuesday.", "answer_2": "16", "instruction_3": "Given the depth calculated as two thirds of Tuesday's depth, find the water depth of the tank on Wednesday.", "answer_3": "16"}
{"id": 30154, "instruction_1": "Anakin caught 10 starfish, 6 sea horses, and 3 clownfish. Calculate the total number of creatures Anakin caught.", "answer_1": "19", "instruction_2": "Locsin caught 5 fewer starfish than Anakin. Calculate the number of starfish Locsin caught.", "answer_2": "5", "instruction_3": "Locsin caught 3 fewer sea horses than Anakin. Calculate the number of sea horses Locsin caught.", "answer_3": "3", "instruction_4": "Locsin caught 2 more clownfish than Anakin. Calculate the number of clownfish Locsin caught.", "answer_4": "5", "instruction_5": "Calculate the total number of creatures Locsin caught using the numbers of starfish, sea horses, and clownfish.", "answer_5": "13", "instruction_6": "Add Anakin's total catch to Locsin's total catch to determine how many fish they were able to catch together.", "answer_6": "32"}
{"id": 30155, "instruction_1": "A bag of marbles costs $20. Write down the initial cost.", "answer_1": "20", "instruction_2": "The price of the bag increases by 20% of the original price every two months. Calculate the amount of the price increase.", "answer_2": "4", "instruction_3": "Determine the number of two-month periods in 36 months.", "answer_3": "18", "instruction_4": "Multiply the number of increments by the amount of each price increase to find the total increase over 36 months.", "answer_4": "72", "instruction_5": "Add the total increase to the initial cost of the bag of marbles to determine the final cost after 36 months.", "answer_5": "92"}
{"id": 30156, "instruction_1": "One red car costs $4. Calculate the total cost of 5 red cars.", "answer_1": "20", "instruction_2": "Each action figure costs $5. Calculate the total cost of 3 action figures.", "answer_2": "15", "instruction_3": "The doll costs as much as 3 action figures. Calculate the cost of the doll.", "answer_3": "15", "instruction_4": "There are 3 action figures. Calculate the total cost.", "answer_4": "15", "instruction_5": "Calculate the total cost of 5 red cars, 3 action figures, and the doll.", "answer_5": "50"}
{"id": 30157, "instruction_1": "Jackie will lose 3 hours of freelance work if she does her taxes herself. She earns $35 per hour. Calculate the total income Jackie will miss.", "answer_1": "105", "instruction_2": "The accountant charges $90 for doing Jackie’s taxes. State the accountant's fee.", "answer_2": "90", "instruction_3": "Add the missed freelance income to the accountant's fee to find out the total cost Jackie incurs if she does the taxes herself.", "answer_3": "105", "instruction_4": "Calculate how much more Jackie would spend if she did the taxes herself compared to hiring an accountant.", "answer_4": "15", "instruction_5": "Subtract the accountant's fee from the total missed income to determine how much more money Jackie will have if she hires the accountant.", "answer_5": "15"}
{"id": 30158, "instruction_1": "Elvira has a budget of €1500 for her 30th birthday. Calculate her total budget.", "answer_1": "1500", "instruction_2": "Elvira chooses a computer with a screen, keyboard, and mouse for €1090. Calculate the total cost of these items.", "answer_2": "1090", "instruction_3": "Elvira also selects a scanner for €157. Add the cost of the scanner to the previous total.", "answer_3": "1247", "instruction_4": "Elvira decides to get a CD burner worth €74. Add the cost of the CD burner to the current total.", "answer_4": "1321", "instruction_5": "Elvira adds a printer to her purchases, which costs €102. Include this cost in the total.", "answer_5": "1423", "instruction_6": "Subtract the total cost of all items from Elvira's original budget to find out how much money she has left for her clothing.", "answer_6": "77"}
{"id": 30159, "instruction_1": "Sandra needs 3 eggs to make one Spanish flan. Calculate the total number of eggs required to make 15 Spanish flans.", "answer_1": "45", "instruction_2": "Sandra receives 9 eggs each time she babysits her neighbor's daughter. Calculate the number of eggs Sandra receives in one babysitting session.", "answer_2": "9", "instruction_3": "Divide the total number of eggs required to make 15 Spanish flans by the number of eggs received per babysitting session to find out how many times Sandra needs to babysit.", "answer_3": "5"}
{"id": 30160, "instruction_1": "Ethel has $8. State the amount of money Ethel has.", "answer_1": "8", "instruction_2": "Calculate twice the amount of money Ethel has.", "answer_2": "16", "instruction_3": "Jimmy has $2 more than twice the money Ethel has. Add $2 to the result from the previous step.", "answer_3": "18", "instruction_4": "State the total amount of money Jimmy has.", "answer_4": "18"}
{"id": 30161, "instruction_1": "Pancho walks 20 miles each weekday (Monday to Friday). Calculate the total miles walked from Monday to Friday.", "answer_1": "100", "instruction_2": "Pancho walks 10 miles each day on weekends (Saturday and Sunday). Calculate the total miles walked on Saturday and Sunday.", "answer_2": "20", "instruction_3": "Add the total miles walked from Monday to Friday to the total miles walked on Saturday and Sunday to find out how many miles Pancho walks in a week.", "answer_3": "120"}
{"id": 30162, "instruction_1": "Each uniform comes with a hat that costs $25. The jacket costs three times as much as the hat. Calculate the cost of the jacket.", "answer_1": "75", "instruction_2": "The pants cost the average of the costs of the hat and jacket. Calculate the average cost of the hat and jacket.", "answer_2": "50", "instruction_3": "Using the average cost calculated, determine the cost of the pants.", "answer_3": "50", "instruction_4": "Add the costs of the hat, jacket, and pants to find the total cost of each uniform.", "answer_4": "150"}
{"id": 30163, "instruction_1": "Jake sees 80 spiders in the Museum of Entomology. Each spider has 8 legs. Calculate the total number of legs from the spiders.", "answer_1": "640", "instruction_2": "Jake sees 90 insects in the Museum of Entomology. Each insect has 6 legs. Calculate the total number of legs from the insects.", "answer_2": "540", "instruction_3": "Jake sees 3 rare mutant invertebrates in the Museum of Entomology. Each mutant invertebrate has 10 legs. Calculate the total number of legs from the mutant invertebrates.", "answer_3": "30", "instruction_4": "Add the total number of legs from the spiders to the total number of legs from the insects.", "answer_4": "1180", "instruction_5": "Add the total number of legs from the mutant invertebrates to the sum of legs from the spiders and insects.", "answer_5": "1210", "instruction_6": "Determine the total number of legs Jake sees in the Museum of Entomology by summing the legs from spiders, insects, and mutant invertebrates.", "answer_6": "1210"}
{"id": 30164, "instruction_1": "Sally Thirtytwo is 8 years old. Note Sally Thirtytwo's age.", "answer_1": "8", "instruction_2": "Sally Four is the same age as Sally Thirtytwo. Calculate Sally Four's age.", "answer_2": "8", "instruction_3": "Granny Red is two times as old as Sally Four. Calculate Granny Red's age.", "answer_3": "16", "instruction_4": "Sally Two is three years older than Granny Red. Calculate Sally Two's age.", "answer_4": "19", "instruction_5": "Add the ages of Sally Two, Granny Red, Sally Four, and Sally Thirtytwo to find the total age of the four birds.", "answer_5": "51"}
{"id": 30165, "instruction_1": "Jessica's student loans have a minimum payment of $300 per month. Calculate how much she pays monthly if she wants to pay 50% more than the minimum.", "answer_1": "450", "instruction_2": "Jessica's credit card has a minimum payment of $200 per month. Calculate how much she pays monthly if she wants to pay 50% more than the minimum.", "answer_2": "300", "instruction_3": "Jessica's mortgage has a minimum payment of $500 per month. Calculate how much she pays monthly if she wants to pay 50% more than the minimum.", "answer_3": "750", "instruction_4": "Sum the monthly payments for Jessica's student loans, credit card, and mortgage after increasing each by 50%.", "answer_4": "1500", "instruction_5": "Calculate the total amount Jessica pays in a year by multiplying her total monthly payment by 12.", "answer_5": "18000"}
{"id": 30166, "instruction_1": "Billy is peeling potatoes for his family reunion barbecue. It takes him 1.5 minutes to peel one potato. Calculate the total time to peel one potato in seconds.", "answer_1": "90", "instruction_2": "Billy has 60 potatoes to peel. Using the time it takes to peel one potato, calculate the total time to peel all 60 potatoes.", "answer_2": "5400", "instruction_3": "Billy also needs to cut each potato after peeling. It takes him 5 seconds to cut one potato. Calculate the total time to cut one potato.", "answer_3": "5", "instruction_4": "Using the time it takes to cut one potato, calculate the total time to cut all 60 potatoes.", "answer_4": "300", "instruction_5": "Add the total time to peel all the potatoes and the total time to cut all the potatoes to find the total prep time in seconds.", "answer_5": "5700", "instruction_6": "Convert the total prep time from seconds to minutes.", "answer_6": "95"}
{"id": 30167, "instruction_1": "Juan and Carlos sell lemonade for $0.50 per glass and get 20 glasses per gallon. Calculate the revenue per gallon.", "answer_1": "10", "instruction_2": "If Juan and Carlos made $25 in profit, and each gallon provides a revenue of $10, calculate the total gallons of lemonade they sold.", "answer_2": "5", "instruction_3": "Calculate the total revenue from selling all the gallons of lemonade.", "answer_3": "50", "instruction_4": "For each gallon, it costs $3 for lemons and $2 for sugar. Calculate the total cost to make one gallon of lemonade.", "answer_4": "5", "instruction_5": "Calculate the total cost to make all the gallons of lemonade.", "answer_5": "25", "instruction_6": "Since each gallon costs $3 for lemons and they made 5 gallons, calculate the total amount spent on lemons.", "answer_6": "15"}
{"id": 30168, "instruction_1": "In a race with 240 Asians, there were 80 Japanese. Calculate the total number of Japanese participants.", "answer_1": "80", "instruction_2": "Subtract the number of Japanese participants from the total number of Asians to find the number of Chinese participants.", "answer_2": "160", "instruction_3": "There were 60 boys on the Chinese team. Identify the number of boys on the Chinese team.", "answer_3": "60", "instruction_4": "Subtract the number of boys from the total number of Chinese participants to determine the number of girls on the Chinese team.", "answer_4": "100"}
{"id": 30169, "instruction_1": "Zaid spends 1/4 of his $6000 monthly salary on rent. Calculate the amount he spends on rent.", "answer_1": "1500", "instruction_2": "Zaid spends 1/3 of his $6000 monthly salary on car fuel. Calculate the amount he spends on car fuel.", "answer_2": "2000", "instruction_3": "After spending on rent and car fuel, calculate the remaining amount of Zaid's salary.", "answer_3": "2500", "instruction_4": "Zaid donates half of the remaining amount to his favorite charity. Calculate the donation amount.", "answer_4": "1250", "instruction_5": "Zaid gives his daughter $200 for her weekly expenses and $700 to his wife for groceries and other household goods. Calculate the total amount given to his family.", "answer_5": "900", "instruction_6": "After all expenses and donations, calculate how much money Zaid still has from his $6000 monthly salary.", "answer_6": "350"}
{"id": 30170, "instruction_1": "Bo has 40 crabs. How many crabs does Bo have?", "answer_1": "40", "instruction_2": "Monic has 4 fewer crabs than Bo. Calculate the number of crabs Monic has.", "answer_2": "36", "instruction_3": "Rani has ten more crabs than Monic. Calculate the number of crabs Rani has.", "answer_3": "46", "instruction_4": "Add the number of crabs Bo and Monic have together.", "answer_4": "76", "instruction_5": "Add the number of crabs Rani has to the total number of crabs Bo and Monic have together.", "answer_5": "122"}
{"id": 30171, "instruction_1": "Lloyd earns $10 an hour for math tutoring. He tutored for 5 hours in the first week. Calculate his earnings for the first week.", "answer_1": "50", "instruction_2": "Lloyd tutored for 8 hours in the second week. Calculate his earnings for the second week.", "answer_2": "80", "instruction_3": "Add Lloyd’s earnings from the first week and the second week to determine his total earnings for the two weeks.", "answer_3": "130"}
{"id": 30172, "instruction_1": "At Sarai's school, 80 students voted for the class representative. Calculate the total number of votes cast.", "answer_1": "80", "instruction_2": "The winner received 3/4 of the total votes. Calculate how many votes the winner received by multiplying the total votes by 3/4.", "answer_2": "60", "instruction_3": "Subtract the number of votes the winner received from the total votes to find out how many votes the loser received.", "answer_3": "20"}
{"id": 30173, "instruction_1": "Sandra ordered 200 pink calla lilies, which were five times the number of white carnations. Calculate the number of white carnations ordered.", "answer_1": "40", "instruction_2": "Sandra ordered four times as many red roses as white carnations. Based on the number of white carnations, calculate the number of red roses ordered.", "answer_2": "160", "instruction_3": "Fred delivered an incomplete order. Assume Fred delivered 120 red roses. Calculate the number of red roses delivered.", "answer_3": "120", "instruction_4": "Determine how many red roses are missing from Sandra's order by subtracting the number of red roses delivered from the total number of red roses ordered.", "answer_4": "40", "instruction_5": "Sandra has threatened to switch suppliers if the missing red roses are not delivered by 5 pm. Identify the deadline for delivering the missing red roses.", "answer_5": "5", "instruction_6": "To keep Sandra’s business, calculate the number of red roses Fred must deliver by the deadline.", "answer_6": "40"}
{"id": 30174, "instruction_1": "Jan is 30 years old. Calculate Jan's age two years ago.", "answer_1": "28", "instruction_2": "Half of Jan's age two years ago is needed. Calculate half of Jan's age from two years ago.", "answer_2": "14", "instruction_3": "Two years ago, Mark was 5 years older than half of Jan's age two years ago. Calculate Mark's age two years ago.", "answer_3": "19", "instruction_4": "Mark's age two years ago was found. Calculate Mark's current age.", "answer_4": "21", "instruction_5": "Jean is two years older than Mark. Calculate Jean's current age.", "answer_5": "23"}
{"id": 30175, "instruction_1": "A well-rounded team has four members, each running 400 meters in 55 seconds. Calculate the total time for this team.", "answer_1": "220", "instruction_2": "The first runner of the less well-rounded team runs 400 meters in 60 seconds. Record the time for the first runner.", "answer_2": "60", "instruction_3": "The second runner of the less well-rounded team is 3 seconds faster than the first runner. Calculate the time for the second runner.", "answer_3": "57", "instruction_4": "The third runner of the less well-rounded team is 3 seconds faster than the second runner. Calculate the time for the third runner.", "answer_4": "54", "instruction_5": "The fourth runner of the less well-rounded team is 3 seconds faster than the third runner. Calculate the time for the fourth runner.", "answer_5": "51", "instruction_6": "Sum the times of all four runners of the less well-rounded team. Subtract the total time of the well-rounded team from the total time of the less well-rounded team. How many seconds will the faster team win by?", "answer_6": "2"}
{"id": 30176, "instruction_1": "A six-sided die has numbers from 1 to 6. Determine the probability of rolling a number greater than 3.", "answer_1": "50%", "instruction_2": "Convert the probability of rolling a number greater than 3 to a percentage.", "answer_2": "50%", "instruction_3": "A six-sided die has numbers from 1 to 6. Determine the probability of rolling an even number.", "answer_3": "50%", "instruction_4": "Determine the probability of rolling two even numbers consecutively on a six-sided die.", "answer_4": "25%", "instruction_5": "Convert the probability of rolling two even numbers consecutively to a percentage.", "answer_5": "25%", "instruction_6": "Determine the percentage difference between the probability of rolling a number greater than 3 and rolling two even numbers in a row.", "answer_6": "25%"}
{"id": 30177, "instruction_1": "Jenna's mom picked 20 apples. How many apples did Jenna's mom pick?", "answer_1": "20", "instruction_2": "Jenna picked half as many apples as her mom. How many apples did Jenna pick?", "answer_2": "10", "instruction_3": "Add the number of apples Jenna picked to the number of apples her mom picked. How many apples did they both pick together?", "answer_3": "30"}
{"id": 30178, "instruction_1": "There are 10 cages of hamsters, each kept alone, and each hamster is given 5 pieces of straw. Calculate the total number of pieces of straw used by the hamsters.", "answer_1": "50", "instruction_2": "There is a pen of rabbits where 20 pieces of straw are distributed among the rabbits. Determine the total number of pieces of straw used by the rabbits.", "answer_2": "20", "instruction_3": "The total number of pieces of straw distributed among all rodents is 160. Subtract the total straw used by the hamsters and the rabbits from this number to find out how many pieces of straw are used by the rats.", "answer_3": "90", "instruction_4": "Each rat is given 6 pieces of straw. Divide the total number of pieces of straw used by the rats by the number of pieces of straw each rat is given to find out the total number of rats.", "answer_4": "15", "instruction_5": "The rats are kept in 3 cages in equal groups. Divide the total number of rats by the number of cages to find out how many rats are in each cage.", "answer_5": "5"}
{"id": 30179, "instruction_1": "Three friends spent $20.25 on 3 tickets to the fair. Calculate the total cost of one ticket.", "answer_1": "6.75", "instruction_2": "They also spent $4.50 less on food than on the tickets. Calculate the total amount spent on food.", "answer_2": "15.75", "instruction_3": "They went on 2 different rides, each costing $33. Calculate the total amount spent on rides.", "answer_3": "66", "instruction_4": "Add the total cost of tickets, food, and rides to find the total expenditure.", "answer_4": "102", "instruction_5": "The friends agreed to split all the costs evenly. Calculate how much each of them paid by dividing the total expenditure by three.", "answer_5": "34"}
{"id": 30180, "instruction_1": "John collects peaches for 3 hours. Convert the hours into minutes.", "answer_1": "180", "instruction_2": "John can collect 2 peaches a minute. Multiply the number of minutes he collects peaches by the number of peaches he collects per minute.", "answer_2": "360"}
{"id": 30181, "instruction_1": "Each duck needs to eat 3.5 pounds of insects per week. Calculate the total weekly insect consumption for one duck.", "answer_1": "3.5", "instruction_2": "Convert the weekly insect consumption of one duck to a daily amount by dividing by 7 (days in a week).", "answer_2": "0.5", "instruction_3": "If there are ten ducks, multiply the daily insect consumption per duck by the number of ducks to find the total daily consumption for the flock.", "answer_3": "5"}
{"id": 30182, "instruction_1": "Tom starts with 50 trees. Write down the initial number of trees.", "answer_1": "50", "instruction_2": "Each year, Tom plants 10 trees and chops down 2 trees. After 10 years, calculate the total number of trees he has planted.", "answer_2": "100", "instruction_3": "After 10 years, add the number of trees planted to the initial number of trees and subtract the number of trees chopped down.", "answer_3": "130", "instruction_4": "After 10 years, 30% of the trees die. Calculate the number of trees that die.", "answer_4": "39", "instruction_5": "Subtract the number of trees that die from the total number of trees after 10 years to find out how many trees Tom has left.", "answer_5": "91"}
{"id": 30183, "instruction_1": "On Friday morning, the neighbors placed 18 pink plastic flamingos in Sue's front yard. How many pink flamingos were in Sue's yard on Friday morning?", "answer_1": "18", "instruction_2": "On Saturday morning, the neighbors took back one third of the pink flamingos. How many flamingos did the neighbors take back?", "answer_2": "6", "instruction_3": "After taking back one third of the pink flamingos, how many pink flamingos were left in Sue's yard on Saturday morning?", "answer_3": "12", "instruction_4": "The neighbors painted the six flamingos white and put them back in Sue's yard. How many white flamingos were there after they were returned?", "answer_4": "6", "instruction_5": "On Sunday morning, the neighbors added another 18 pink flamingos to Sue's yard. How many pink flamingos were there on Sunday morning?", "answer_5": "30", "instruction_6": "At noon on Sunday, how many more pink flamingos were there than white flamingos?", "answer_6": "24"}
{"id": 30184, "instruction_1": "Violetta needs to buy crayons in 5 different colors. Calculate the total number of crayons she needs to purchase.", "answer_1": "5", "instruction_2": "Each crayon costs $2. Determine the cost of one crayon.", "answer_2": "2", "instruction_3": "Multiply the number of crayons Violetta needs by the cost of one crayon to find the total cost.", "answer_3": "10", "instruction_4": "Violetta has prepared $20 for this purchase. State the amount she has prepared.", "answer_4": "20", "instruction_5": "Subtract the total cost of the crayons from the amount Violetta has prepared to find out how much change she will get.", "answer_5": "10"}
{"id": 30185, "instruction_1": "A pencil costs $1.20. What is the cost of one pencil?", "answer_1": "1.2", "instruction_2": "An eraser costs $0.30. What is the cost of one eraser?", "answer_2": "0.3", "instruction_3": "Calculate the combined cost of one pencil and one eraser.", "answer_3": "1.5", "instruction_4": "A pen costs as much as a pencil and eraser combined. How much does one pen cost?", "answer_4": "1.5", "instruction_5": "How much will 8 pens cost if one pen costs as much as a pencil and eraser combined?", "answer_5": "12"}
{"id": 30186, "instruction_1": "There are 200 pounds of carrots available for distribution. Calculate the total number of pounds of carrots available.", "answer_1": "200", "instruction_2": "There are 40 restaurants that need to receive carrots. Calculate the total number of restaurants.", "answer_2": "40", "instruction_3": "Each restaurant is to receive 2 pounds of carrots. Calculate the total pounds of carrots each restaurant will receive.", "answer_3": "2", "instruction_4": "Multiply the number of restaurants by the pounds of carrots each restaurant receives. Calculate the total number of pounds of carrots distributed to all restaurants.", "answer_4": "80", "instruction_5": "Subtract the total pounds of carrots distributed from the total pounds of carrots available (200). Calculate how many pounds of carrots will not be used.", "answer_5": "120"}
{"id": 30187, "instruction_1": "In the city of Soda, there are exactly 23786 inhabitants. Write down the total population number.", "answer_1": "23786", "instruction_2": "There are 8417 men in Soda. Write down the number of men.", "answer_2": "8417", "instruction_3": "There are 9092 women in Soda. Write down the number of women.", "answer_3": "9092", "instruction_4": "Calculate the total number of adults by adding the number of men and women together.", "answer_4": "17509", "instruction_5": "Subtract the total number of adults from the total population to find out how many children there are.", "answer_5": "6277"}
{"id": 30188, "instruction_1": "Elaine initially had 20 Pokemon cards. Determine the number of cards she initially had.", "answer_1": "20", "instruction_2": "After the first month, Elaine collected three times the number of her initial cards. Calculate the number of Pokemon cards collected in the first month.", "answer_2": "60", "instruction_3": "In the second month, Elaine collected 20 fewer cards than those she collected in the first month. Calculate the number of Pokemon cards collected in the second month.", "answer_3": "40", "instruction_4": "Combine the number of Pokemon cards Elaine collected in the first and second months.", "answer_4": "100", "instruction_5": "In the third month, Elaine collected twice the combined number of Pokemon cards she collected in the first and second months. Calculate the number of Pokemon cards collected in the third month.", "answer_5": "200", "instruction_6": "Add the number of Pokemon cards Elaine initially had to the total number of cards she collected over the three months to find the total number of Pokemon cards she has now.", "answer_6": "280"}
{"id": 30189, "instruction_1": "Mark edits a total of 1000 sentences each week, equally divided between two publishers. Calculate the number of sentences he edits for each publisher.", "answer_1": "500", "instruction_2": "Publisher A pays Mark 5 cents per sentence. Calculate the total payment Mark receives from Publisher A each week.", "answer_2": "2500", "instruction_3": "Publisher B pays Mark twice the rate of Publisher A. Calculate the payment rate per sentence for Publisher B.", "answer_3": "10", "instruction_4": "Calculate the total payment Mark receives from Publisher B each week, given the payment rate and the number of sentences edited.", "answer_4": "5000", "instruction_5": "Calculate Mark’s total earnings in a week by adding the payments from Publisher A and Publisher B.", "answer_5": "7500"}
{"id": 30190, "instruction_1": "Baldur gets 5 pails of water every morning. If each pail contains 5 liters, calculate the total liters of water he gets in the morning.", "answer_1": "25", "instruction_2": "Baldur gets 6 pails of water every afternoon. If each pail contains 5 liters, calculate the total liters of water he gets in the afternoon.", "answer_2": "30", "instruction_3": "Add the liters of water Baldur gets in the morning to the liters of water he gets in the afternoon to find out how many liters of water he gets every day.", "answer_3": "55"}
{"id": 30191, "instruction_1": "John makes $2000 a week, every week of the year. Calculate his initial annual salary before the raise.", "answer_1": "104000", "instruction_2": "John receives a 5% raise in his weekly salary of $2000. Calculate the amount of the raise.", "answer_2": "100", "instruction_3": "Add the raise amount to John’s initial weekly salary to find his new weekly salary.", "answer_3": "2100", "instruction_4": "Calculate John’s new annual salary after the raise, given he makes the new weekly salary every week of the year.", "answer_4": "109200", "instruction_5": "John also receives a one-time monetary award of $5000. Add this to his new annual salary.", "answer_5": "114200", "instruction_6": "Calculate the total amount of money John made that year including his new annual salary and the one-time award.", "answer_6": "114200"}
{"id": 30192, "instruction_1": "Josie grows grapes on her 10-acre farm. Each acre produces 5 tons of grapes per year. Calculate the total grape production in tons per year.", "answer_1": "50", "instruction_2": "Each acre of Josie’s farm produces 5 tons of grapes per year. Calculate the total grape production for one acre.", "answer_2": "5", "instruction_3": "Multiply the total number of acres (10 acres) by the grape production per acre (5 tons per acre).", "answer_3": "50", "instruction_4": "Each ton of grapes makes 2 barrels of wine. Calculate how many barrels of wine are produced from one ton of grapes.", "answer_4": "2", "instruction_5": "Multiply the total grape production by the number of barrels of wine produced per ton of grapes.", "answer_5": "100"}
{"id": 30193, "instruction_1": "Carl ate a sandwich every day this week for lunch and used 2 slices of cheese on each sandwich. Calculate the total number of slices of cheese used for sandwiches this week.", "answer_1": "14", "instruction_2": "Carl ate cheese and egg omelets for breakfast 3 days this week, using one more slice of cheese per omelet than he did per sandwich. Calculate the total number of slices of cheese used for omelets.", "answer_2": "9", "instruction_3": "Carl made a big dish of macaroni and cheese to last him several dinners for the week and used 8 slices of cheese in it. Determine the number of slices of cheese used for the macaroni and cheese.", "answer_3": "8", "instruction_4": "Add the total number of slices of cheese used for sandwiches, omelets, and macaroni and cheese to find the total number of slices of cheese Carl used this week.", "answer_4": "31"}
{"id": 30194, "instruction_1": "Janet had 22 green pens and 10 yellow pens. Calculate the total number of pens she initially had.", "answer_1": "32", "instruction_2": "Janet bought 6 bags of blue pens, with 9 pens in each bag. Calculate the total number of blue pens she bought.", "answer_2": "54", "instruction_3": "Janet bought 2 bags of red pens, with 6 pens in each bag. Calculate the total number of red pens she bought.", "answer_3": "12", "instruction_4": "Add the total number of blue pens and red pens Janet bought.", "answer_4": "66", "instruction_5": "Add the number of pens Janet initially had to the total number of pens she bought.", "answer_5": "98"}
{"id": 30195, "instruction_1": "Micheal rides his bike 5 times a week, covering 25 kilometers each time. Calculate the total kilometers he rides in one week. Then, multiply by 4 to find the total for four weeks.", "answer_1": "500", "instruction_2": "Micheal then changes his routine to riding 2 times a week, covering 60 kilometers each time. Calculate the total kilometers he rides in one week under the new routine.", "answer_2": "120", "instruction_3": "Using the new routine, calculate the total kilometers Micheal rides over three weeks.", "answer_3": "360", "instruction_4": "Add the total kilometers ridden in the first four weeks to the total kilometers ridden in the following three weeks to find the total distance Micheal rode.", "answer_4": "860"}
{"id": 30196, "instruction_1": "Each chocolate bar weighs twice as much as each candied apple, and each chocolate bar weighs 40g. Calculate the weight of one candied apple.", "answer_1": "20", "instruction_2": "Joe has 25 chocolate bars. Calculate the total weight of all chocolate bars if each weighs 40g.", "answer_2": "1000", "instruction_3": "Joe has 80 candied apples. Calculate the total weight of all candied apples if each weighs 20g.", "answer_3": "1600", "instruction_4": "Combine the total weight of all chocolate bars and the total weight of all candied apples to find the total weight of Joe's bag of candy.", "answer_4": "2600"}
{"id": 30197, "instruction_1": "Rose went to the store on Monday and bought 4 cakes. How many cakes did she buy on Monday?", "answer_1": "4", "instruction_2": "On Tuesday, Rose went to a different store and bought three times the number of cakes she bought on Monday. How many cakes did she buy on Tuesday?", "answer_2": "12", "instruction_3": "On Wednesday, Rose went to another store and bought 5 times the number of cakes she did on Tuesday. How many cakes did she buy on Wednesday?", "answer_3": "60", "instruction_4": "Add the number of cakes Rose bought on Monday, Tuesday, and Wednesday to find the total number of cakes she bought after all three days.", "answer_4": "76"}
{"id": 30198, "instruction_1": "Half a dozen plates are sold at $6000 each. Calculate the total cost of the plates.", "answer_1": "36000", "instruction_2": "Twenty dozen cups cost $1200 less than the total cost of the plates. Calculate the cost of the cups.", "answer_2": "34800", "instruction_3": "Twenty dozen cups were bought. Calculate the total number of individual cups.", "answer_3": "240", "instruction_4": "Calculate the cost of each cup by dividing the total cost of the cups by the number of individual cups.", "answer_4": "145"}
{"id": 30199, "instruction_1": "Sara wants to buy a jacket costing $30 and 2 pairs of shoes costing $20 each. Calculate the total cost she needs.", "answer_1": "70", "instruction_2": "Sara babysits the neighbor's kids 4 times, earning $5 each time. Calculate her total earnings from babysitting.", "answer_2": "20", "instruction_3": "Sara had $10 saved before she started babysitting. Add her babysitting earnings to her initial savings.", "answer_3": "30", "instruction_4": "Subtract Sara's total savings from the total cost of the jacket and shoes to find out how much more she needs.", "answer_4": "40", "instruction_5": "Sara earns $4 each time she mows the lawn. Determine how many times she needs to mow the lawn to earn the remaining $40.", "answer_5": "10", "instruction_6": "Based on the remaining amount needed and her earnings per lawn mowed, calculate the total number of times Sara must mow the lawn.", "answer_6": "10"}
{"id": 30200, "instruction_1": "The local park is a rectangle measuring 1.5 miles by 6 miles. Calculate the perimeter of the park.", "answer_1": "15", "instruction_2": "Gary walks at a speed of 3 miles per hour. Use this speed to find out how many miles he can walk in one hour.", "answer_2": "3", "instruction_3": "Given the perimeter of the park and Gary's walking speed, calculate how many hours Gary spends walking around the park.", "answer_3": "5"}
