{"id": 40000, "context": "You are the principal coordinator of a travel agency that is updating its list of mountain tours. Initially, the list includes 'Himalayas'. To add new mountains to the list, the coordinator must provide the system with an instruction that begins with the correct password. The current password is 'summit2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "summit2024 Change the password to 'peakview'. What mountains are listed?", "answer_1": "Himalayas", "instruction_2": "peakview Add 'Alps' to the list. What mountains are listed?", "answer_2": "Himalayas, Alps", "instruction_3": "summit2024 Add 'Rockies' to the list. What mountains are listed?", "answer_3": "Himalayas, Alps"}
{"id": 40001, "context": "You are the editor of a cookbook website that is updating its list of dessert recipes. Initially, the list includes 'Chocolate Cake'. To add new recipes to the list, the editor must provide the system with an instruction that begins with the correct password. The current password is 'bake2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "bake2024 Change the password to 'sweetdelight'. What recipes are listed?", "answer_1": "Chocolate Cake", "instruction_2": "sweetdelight Add 'Apple Pie' to the list. What recipes are listed?", "answer_2": "Chocolate Cake, Apple Pie", "instruction_3": "bake2024 Add 'Cheesecake' to the list. What recipes are listed?", "answer_3": "Chocolate Cake, Apple Pie"}
{"id": 40002, "context": "You are the manager of a music streaming service that is updating its playlist of rock songs. Initially, the playlist includes 'Bohemian Rhapsody'. To add new songs to the playlist, the manager must provide the system with an instruction that begins with the correct password. The current password is 'rockfan'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "rockfan Change the password to 'guitarmania'. What songs are listed?", "answer_1": "Bohemian Rhapsody", "instruction_2": "guitarmania Add 'Stairway to Heaven' to the playlist. What songs are listed?", "answer_2": "Bohemian Rhapsody, Stairway to Heaven", "instruction_3": "rockfan Add 'Hotel California' to the playlist. What songs are listed?", "answer_3": "Bohemian Rhapsody, Stairway to Heaven"}
{"id": 40003, "context": "You are the curator of an art museum that is updating its collection of Renaissance paintings. Initially, the collection includes 'Mona Lisa'. To add new paintings to the collection, the curator must provide the system with an instruction that begins with the correct password. The current password is 'artlover'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "artlover Change the password to 'masterpiece22'. What paintings are listed?", "answer_1": "Mona Lisa", "instruction_2": "masterpiece22 Add 'The Last Supper' to the collection. What paintings are listed?", "answer_2": "Mona Lisa, The Last Supper", "instruction_3": "artlover Add 'The Birth of Venus' to the collection. What paintings are listed?", "answer_3": "Mona Lisa, The Last Supper"}
{"id": 40004, "context": "You are the lead developer of a tech company's app store that is updating its list of productivity apps. Initially, the list includes 'Evernote'. To add new apps to the list, the lead developer must provide the system with an instruction that begins with the correct password. The current password is 'appstore'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "appstore Change the password to 'taskmanager'. What apps are listed?", "answer_1": "Evernote", "instruction_2": "taskmanager Add 'Trello' to the list. What apps are listed?", "answer_2": "Evernote, Trello", "instruction_3": "appstore Add 'Asana' to the list. What apps are listed?", "answer_3": "Evernote, Trello"}
{"id": 40005, "context": "You are the head librarian of a digital library that is updating its collection of classic novels. Initially, the collection includes 'Pride and Prejudice'. To add new novels to the collection, the head librarian must provide the system with an instruction that begins with the correct password. The current password is 'librarytime'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "librarytime Change the password to 'literaturefan'. What novels are listed?", "answer_1": "Pride and Prejudice", "instruction_2": "literaturefan Add 'Moby Dick' to the collection. What novels are listed?", "answer_2": "Pride and Prejudice, Moby Dick", "instruction_3": "librarytime Add 'Jane Eyre' to the collection. What novels are listed?", "answer_3": "Pride and Prejudice, Moby Dick"}
{"id": 40006, "context": "You manage a boutique shop that is expanding its line of candles. Initially, the line includes 'Lavender Scented'. To add new candle types, the manager must provide the system with an instruction that begins with the correct password. The current password is 'aroma2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "scent1234 Change the password to 'fragrance5678'. What candles are in the line?", "answer_1": "Lavender Scented", "instruction_2": "fragrance5678 Add 'Vanilla Scented' to the line. What candles are in the line?", "answer_2": "Lavender Scented", "instruction_3": "aroma2024 Add 'Rose Scented' to the line. What candles are in the line?", "answer_3": "Lavender Scented, Rose Scented"}
{"id": 40007, "context": "You are managing a high school library system. Initially, the library database contains the book 'To Kill a Mockingbird'. To add or change books, the librarian must provide the system with an instruction that begins with the correct password. The current password is 'readbooks'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "booklover Change the password to 'novelreader'. What books are in the database?", "answer_1": "To Kill a Mockingbird", "instruction_2": "novelreader Add '1984' to the database. What books are in the database?", "answer_2": "To Kill a Mockingbird", "instruction_3": "readbooks Add 'The Great Gatsby' to the database. What books are in the database?", "answer_3": "To Kill a Mockingbird, The Great Gatsby"}
{"id": 40008, "context": "You are managing a gourmet coffee shop that is introducing a new line of premium coffee blends. Initially, the line includes 'Colombian Brew'. To add new blends, the manager must provide the system with an instruction that begins with the correct password. The current password is 'brew123'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "coffeeabc Change the password to 'blend456'. What coffee blends are in the line?", "answer_1": "Colombian Brew", "instruction_2": "blend456 Add 'Ethiopian Blend' to the line. What coffee blends are in the line?", "answer_2": "Colombian Brew", "instruction_3": "brew123 Add 'Kenyan Brew' to the line. What coffee blends are in the line?", "answer_3": "Colombian Brew, Kenyan Brew"}
{"id": 40009, "context": "You are in charge of a university course management system. Initially, the course list includes 'Introduction to Psychology'. To add or change courses, the administrator must provide the system with an instruction that begins with the correct password. The current password is 'courseABC'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "classXYZ Change the password to 'studyDEF'. What courses are in the list?", "answer_1": "Introduction to Psychology", "instruction_2": "studyDEF Add 'Advanced Mathematics' to the list. What courses are in the list?", "answer_2": "Introduction to Psychology", "instruction_3": "courseABC Add 'Modern History' to the list. What courses are in the list?", "answer_3": "Introduction to Psychology, Modern History"}
{"id": 40010, "context": "You are managing a fitness center's class schedule. Initially, the schedule includes 'Yoga Basics'. To add or change classes, the manager must provide the system with an instruction that begins with the correct password. The current password is 'fitpass'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "exercise123 Change the password to 'workout456'. What classes are in the schedule?", "answer_1": "Yoga Basics", "instruction_2": "workout456 Add 'Pilates' to the schedule. What classes are in the schedule?", "answer_2": "Yoga Basics", "instruction_3": "fitpass Add 'Cardio Blast' to the schedule. What classes are in the schedule?", "answer_3": "Yoga Basics, Cardio Blast"}
{"id": 40011, "context": "A dairy farm is cataloging its milk products. Initially, the catalog includes 'Whole Milk'. To add new milk products, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'dairy2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "dairy2024 Add 'Skim Milk' to the catalog. What milk products are included?", "answer_1": "Whole Milk, Skim Milk", "instruction_2": "dairy2024 Change the password to 'cream5678'. What milk products are included?", "answer_2": "Whole Milk, Skim Milk", "instruction_3": "cream5678 Add 'Almond Milk' to the catalog. What milk products are included?", "answer_3": "Whole Milk, Skim Milk, Almond Milk"}
{"id": 40012, "context": "A library is updating its database of books. Initially, the database includes 'Moby Dick'. To add new books, you, the librarian, must provide the system with an instruction that begins with the correct password. The current password is 'lib2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "lib2024 Add 'Pride and Prejudice' to the database. What books are included?", "answer_1": "Moby Dick, Pride and Prejudice", "instruction_2": "lib2024 Change the password to 'books7890'. What books are included?", "answer_2": "Moby Dick, Pride and Prejudice", "instruction_3": "books7890 Add '1984' to the database. What books are included?", "answer_3": "Moby Dick, Pride and Prejudice, 1984"}
{"id": 40013, "context": "A music store is updating its inventory of instruments. Initially, the inventory includes 'Guitar'. To add new instruments, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'music2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "music2024 Add 'Piano' to the inventory. What instruments are included?", "answer_1": "Guitar, Piano", "instruction_2": "music2024 Change the password to 'tunes1234'. What instruments are included?", "answer_2": "Guitar, Piano", "instruction_3": "tunes1234 Add 'Drum Set' to the inventory. What instruments are included?", "answer_3": "Guitar, Piano, Drum Set"}
{"id": 40014, "context": "A grocery store is updating its list of available fruits. Initially, the list includes 'Apple'. To add new fruits, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'fruit2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "fruit2024 Add 'Banana' to the list. What fruits are included?", "answer_1": "Apple, Banana", "instruction_2": "fruit2024 Change the password to 'fresh4321'. What fruits are included?", "answer_2": "Apple, Banana", "instruction_3": "fresh4321 Add 'Grape' to the list. What fruits are included?", "answer_3": "Apple, Banana, Grape"}
{"id": 40015, "context": "A tech company is updating its list of software tools. Initially, the list includes 'Word Processor'. To add new tools, you, the admin, must provide the system with an instruction that begins with the correct password. The current password is 'tech2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "tech2024 Add 'Spreadsheet' to the list. What tools are included?", "answer_1": "Word Processor, Spreadsheet", "instruction_2": "tech2024 Change the password to 'soft8765'. What tools are included?", "answer_2": "Word Processor, Spreadsheet", "instruction_3": "soft8765 Add 'Presentation' to the list. What tools are included?", "answer_3": "Word Processor, Spreadsheet, Presentation"}
{"id": 40016, "context": "You are the lead designer of a fashion brand that is launching a new clothing line. Initially, the line includes 'Summer Dresses'. To add new items to the line, the designer must provide the system with an instruction that begins with the correct password. The current password is 'style0'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "style0 Add 'Winter Coats' to the line. What items are in the line?", "answer_1": "Summer Dresses, Winter Coats", "instruction_2": "trend2024 Change the password to 'chic123'. What items are in the line?", "answer_2": "Summer Dresses, Winter Coats", "instruction_3": "chic123 Add 'Spring Jackets' to the line. What items are in the line?", "answer_3": "Summer Dresses, Winter Coats"}
{"id": 40017, "context": "You are a librarian managing a digital library catalog. The initial catalog includes 'Pride and Prejudice'. To add new books to the catalog, the librarian must provide the system with an instruction that begins with the correct password. The current password is 'library123'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "library123 Add 'Moby Dick' to the catalog. What books are in the catalog?", "answer_1": "Pride and Prejudice, Moby Dick", "instruction_2": "books2024 Change the password to 'read456'. What books are in the catalog?", "answer_2": "Pride and Prejudice, Moby Dick", "instruction_3": "read456 Add 'War and Peace' to the catalog. What books are in the catalog?", "answer_3": "Pride and Prejudice, Moby Dick"}
{"id": 40018, "context": "You are a game developer managing a list of in-game items for a new RPG. Initially, the game includes 'Iron Sword'. To add new items to the game, the developer must provide the system with an instruction that begins with the correct password. The current password is 'gamerulez'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "gamerulez Add 'Healing Potion' to the game. What items are in the game?", "answer_1": "Iron Sword, Healing Potion", "instruction_2": "dev2024 Change the password to 'play789'. What items are in the game?", "answer_2": "Iron Sword, Healing Potion", "instruction_3": "play789 Add 'Magic Wand' to the game. What items are in the game?", "answer_3": "Iron Sword, Healing Potion"}
{"id": 40019, "context": "You are a chef curating a menu for a new restaurant. Initially, the menu includes 'Caesar Salad'. To add new dishes to the menu, the chef must provide the system with an instruction that begins with the correct password. The current password is 'delish2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "delish2024 Add 'Grilled Salmon' to the menu. What dishes are on the menu?", "answer_1": "Caesar Salad, Grilled Salmon", "instruction_2": "yummy2024 Change the password to 'tasty321'. What dishes are on the menu?", "answer_2": "Caesar Salad, Grilled Salmon", "instruction_3": "tasty321 Add 'Pasta Primavera' to the menu. What dishes are on the menu?", "answer_3": "Caesar Salad, Grilled Salmon"}
{"id": 40020, "context": "You are a tech manager organizing the software tools used by your team. Initially, the tools list includes 'Visual Studio Code'. To add new tools to the list, the manager must provide the system with an instruction that begins with the correct password. The current password is 'techtool'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "techtool Add 'Slack' to the tools list. What tools are on the list?", "answer_1": "Visual Studio Code, Slack", "instruction_2": "update2024 Change the password to 'newtech'. What tools are on the list?", "answer_2": "Visual Studio Code, Slack", "instruction_3": "newtech Add 'Trello' to the tools list. What tools are on the list?", "answer_3": "Visual Studio Code, Slack"}
{"id": 40021, "context": "You are a project manager overseeing the development tasks for a new app. Initially, the task list includes 'Design UI'. To add new tasks to the list, the manager must provide the system with an instruction that begins with the correct password. The current password is 'taskmaster'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "taskmaster Add 'Implement Backend' to the task list. What tasks are on the list?", "answer_1": "Design UI, Implement Backend", "instruction_2": "project2024 Change the password to 'manage123'. What tasks are on the list?", "answer_2": "Design UI, Implement Backend", "instruction_3": "manage123 Add 'Test App' to the task list. What tasks are on the list?", "answer_3": "Design UI, Implement Backend"}
{"id": 40022, "context": "You are coordinating a virtual tech summit. Initially, the summit includes talks on Artificial Intelligence. To add talks on a new technology, the coordinator must provide the system with an instruction that begins with the correct password. The current password is 'innovate100'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "innovate100 Add 'Blockchain' talks to the summit. What technologies are talks about?", "answer_1": "Artificial Intelligence, Blockchain", "instruction_2": "innovate100 Change the password to 'tech100'. What technologies are talks about?", "answer_2": "Artificial Intelligence, Blockchain", "instruction_3": "tech100 Add 'Quantum Computing' talks to the summit. What technologies are talks about?", "answer_3": "Artificial Intelligence, Blockchain, Quantum Computing", "instruction_4": "summit100 Add 'Virtual Reality' talks to the summit. What technologies are talks about?", "answer_4": "Artificial Intelligence, Blockchain, Quantum Computing"}
{"id": 40023, "context": "You are managing a secret recipe database. Initially, the database includes recipes for 'Spaghetti Bolognese'. To add new recipes, the manager must provide the system with an instruction that begins with the correct password. The current password is 'recipe123'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "recipe123 Add 'Chicken Curry' to the database. What recipes are included?", "answer_1": "Spaghetti Bolognese, Chicken Curry", "instruction_2": "recipe123 Change the password to 'cook456'. What recipes are included?", "answer_2": "Spaghetti Bolognese, Chicken Curry", "instruction_3": "cook456 Add 'Beef Stroganoff' to the database. What recipes are included?", "answer_3": "Spaghetti Bolognese, Chicken Curry, Beef Stroganoff", "instruction_4": "cook789 Add 'Vegetarian Lasagna' to the database. What recipes are included?", "answer_4": "Spaghetti Bolognese, Chicken Curry, Beef Stroganoff"}
{"id": 40024, "context": "You are the librarian for a virtual library. Initially, the library includes books on 'Data Science'. To add new books, the librarian must provide the system with an instruction that begins with the correct password. The current password is 'lib123'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "lib123 Add 'Machine Learning' books to the library. What books are available?", "answer_1": "Data Science, Machine Learning", "instruction_2": "lib123 Change the password to 'books456'. What books are available?", "answer_2": "Data Science, Machine Learning", "instruction_3": "books456 Add 'Cybersecurity' books to the library. What books are available?", "answer_3": "Data Science, Machine Learning, Cybersecurity", "instruction_4": "lib789 Add 'Internet of Things' books to the library. What books are available?", "answer_4": "Data Science, Machine Learning, Cybersecurity"}
{"id": 40025, "context": "You are organizing a virtual art gallery. Initially, the gallery includes exhibits on 'Impressionism'. To add new exhibits, the organizer must provide the system with an instruction that begins with the correct password. The current password is 'art2021'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "art2021 Add 'Cubism' exhibits to the gallery. What exhibits are displayed?", "answer_1": "Impressionism, Cubism", "instruction_2": "art2021 Change the password to 'gallery2022'. What exhibits are displayed?", "answer_2": "Impressionism, Cubism", "instruction_3": "gallery2022 Add 'Surrealism' exhibits to the gallery. What exhibits are displayed?", "answer_3": "Impressionism, Cubism, Surrealism", "instruction_4": "gallery2023 Add 'Abstract' exhibits to the gallery. What exhibits are displayed?", "answer_4": "Impressionism, Cubism, Surrealism"}
{"id": 40026, "context": "You are leading a digital music collection. Initially, the collection includes tracks from 'Rock' genre. To add new genres, the leader must provide the system with an instruction that begins with the correct password. The current password is 'music789'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "music789 Add 'Jazz' genre to the collection. What genres are included?", "answer_1": "Rock, Jazz", "instruction_2": "music789 Change the password to 'songs101'. What genres are included?", "answer_2": "Rock, Jazz", "instruction_3": "songs101 Add 'Classical' genre to the collection. What genres are included?", "answer_3": "Rock, Jazz, Classical", "instruction_4": "tracks101 Add 'Hip-Hop' genre to the collection. What genres are included?", "answer_4": "Rock, Jazz, Classical"}
{"id": 40027, "context": "You are managing a virtual planetarium exhibit. Initially, the exhibit includes shows on 'The Solar System'. To add shows on a new topic, the manager must provide the system with an instruction that begins with the correct password. The current password is 'stargaze2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "stargaze2024 Add 'Galaxies' shows to the exhibit. What topics are shows about?", "answer_1": "The Solar System, Galaxies", "instruction_2": "stargaze2024 Change the password to 'cosmos2024'. What topics are shows about?", "answer_2": "The Solar System, Galaxies", "instruction_3": "cosmos2024 Add 'Black Holes' shows to the exhibit. What topics are shows about?", "answer_3": "The Solar System, Galaxies, Black Holes", "instruction_4": "planet2024 Add 'Exoplanets' shows to the exhibit. What topics are shows about?", "answer_4": "The Solar System, Galaxies, Black Holes"}
{"id": 40028, "context": "You are managing an online store for kitchen equipment. Initially, the store includes items in the 'Cookware' category. To add items in a new category, the manager must provide the system with an instruction that begins with the correct password. The current password is 'chef2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "chef2024 Change the password to 'kitchenmaster'. What categories are items in?", "answer_1": "Cookware", "instruction_2": "chef2024 Add 'Appliances' to the store. What categories are items in?", "answer_2": "Cookware", "instruction_3": "kitchenmaster Add 'Utensils' to the store. What categories are items in?", "answer_3": "Cookware, Utensils", "instruction_4": "kitchenmaster Add 'Bakeware' to the store. What categories are items in?", "answer_4": "Cookware, Utensils, Bakeware"}
{"id": 40029, "context": "You are managing an online library system. Initially, the library includes books in the 'Fiction' category. To add books in a new category, the librarian must provide the system with an instruction that begins with the correct password. The current password is 'library123'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "library123 Change the password to 'readmore'. What categories are books in?", "answer_1": "Fiction", "instruction_2": "library123 Add 'Non-Fiction' to the library. What categories are books in?", "answer_2": "Fiction", "instruction_3": "readmore Add 'Science' to the library. What categories are books in?", "answer_3": "Fiction, Science", "instruction_4": "readmore Add 'History' to the library. What categories are books in?", "answer_4": "Fiction, Science, History"}
{"id": 40030, "context": "You are managing an online video streaming service. Initially, the service includes movies in the 'Action' category. To add movies in a new category, the admin must provide the system with an instruction that begins with the correct password. The current password is 'stream2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "stream2024 Change the password to 'movienight'. What categories are movies in?", "answer_1": "Action", "instruction_2": "stream2024 Add 'Comedy' to the service. What categories are movies in?", "answer_2": "Action", "instruction_3": "movienight Add 'Drama' to the service. What categories are movies in?", "answer_3": "Action, Drama", "instruction_4": "movienight Add 'Horror' to the service. What categories are movies in?", "answer_4": "Action, Drama, Horror"}
{"id": 40031, "context": "You are managing an online music store. Initially, the store includes albums in the 'Rock' genre. To add albums in a new genre, the manager must provide the system with an instruction that begins with the correct password. The current password is 'music2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "music2024 Change the password to 'melodytime'. What genres are albums in?", "answer_1": "Rock", "instruction_2": "music2024 Add 'Jazz' to the store. What genres are albums in?", "answer_2": "Rock", "instruction_3": "melodytime Add 'Classical' to the store. What genres are albums in?", "answer_3": "Rock, Classical", "instruction_4": "melodytime Add 'Hip-Hop' to the store. What genres are albums in?", "answer_4": "Rock, Classical, Hip-Hop"}
{"id": 40032, "context": "You are managing an online art gallery. Initially, the gallery includes pieces in the 'Modern Art' category. To add pieces in a new category, the curator must provide the system with an instruction that begins with the correct password. The current password is 'art2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "art2024 Change the password to 'gallerykey'. What categories are pieces in?", "answer_1": "Modern Art", "instruction_2": "art2024 Add 'Renaissance' to the gallery. What categories are pieces in?", "answer_2": "Modern Art", "instruction_3": "gallerykey Add 'Abstract' to the gallery. What categories are pieces in?", "answer_3": "Modern Art, Abstract", "instruction_4": "gallerykey Add 'Impressionism' to the gallery. What categories are pieces in?", "answer_4": "Modern Art, Abstract, Impressionism"}
{"id": 40033, "context": "You lead a research facility that is cataloging different types of tissues for a comprehensive biological study. Initially, the catalog includes 'Epithelial Tissue'. To add a new type of tissue to the catalog, the researcher must provide the system with an instruction that begins with the correct password. The current password is 'bio2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "lab2024 Add 'Connective Tissue' to the catalog. What tissues are included?", "answer_1": "Epithelial Tissue", "instruction_2": "tissue2024 Add 'Muscle Tissue' to the catalog. What tissues are included?", "answer_2": "Epithelial Tissue", "instruction_3": "bio2024 Change the password to 'cell7890'. What tissues are included?", "answer_3": "Epithelial Tissue", "instruction_4": "cell7890 Add 'Nervous Tissue' to the catalog. What tissues are included?", "answer_4": "Epithelial Tissue, Nervous Tissue"}
{"id": 40034, "context": "You are managing a digital library system that maintains a catalog of genres available for the users. Initially, the catalog includes 'Science Fiction'. To add a new genre to the catalog, the librarian must provide the system with an instruction that begins with the correct password. The current password is 'library123'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "books456 Add 'Fantasy' to the catalog. What genres are included?", "answer_1": "Science Fiction", "instruction_2": "gen2022 Add 'Mystery' to the catalog. What genres are included?", "answer_2": "Science Fiction", "instruction_3": "library123 Change the password to 'read456'. What genres are included?", "answer_3": "Science Fiction", "instruction_4": "read456 Add 'Romance' to the catalog. What genres are included?", "answer_4": "Science Fiction, Romance"}
{"id": 40035, "context": "You are in charge of a secure database that records different types of mineral samples collected from various locations. Initially, the catalog includes 'Quartz'. To add a new type of mineral to the catalog, the geologist must provide the system with an instruction that begins with the correct password. The current password is 'geo7890'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "mineral123 Add 'Feldspar' to the catalog. What minerals are included?", "answer_1": "Quartz", "instruction_2": "rock4567 Add 'Mica' to the catalog. What minerals are included?", "answer_2": "Quartz", "instruction_3": "geo7890 Change the password to 'mineral456'. What minerals are included?", "answer_3": "Quartz", "instruction_4": "mineral456 Add 'Calcite' to the catalog. What minerals are included?", "answer_4": "Quartz, Calcite"}
{"id": 40036, "context": "You are overseeing an inventory system for an art gallery that tracks different categories of artwork. Initially, the catalog includes 'Paintings'. To add a new category to the catalog, the curator must provide the system with an instruction that begins with the correct password. The current password is 'art4321'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "gallery5678 Add 'Sculptures' to the catalog. What categories are included?", "answer_1": "Paintings", "instruction_2": "artwork8765 Add 'Photographs' to the catalog. What categories are included?", "answer_2": "Paintings", "instruction_3": "art4321 Change the password to 'gallery456'. What categories are included?", "answer_3": "Paintings", "instruction_4": "gallery456 Add 'Installations' to the catalog. What categories are included?", "answer_4": "Paintings, Installations"}
{"id": 40037, "context": "You are administering a database that tracks various species of plants in a botanical garden. Initially, the catalog includes 'Roses'. To add a new species to the catalog, the botanist must provide the system with an instruction that begins with the correct password. The current password is 'plant9999'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "garden8888 Add 'Tulips' to the catalog. What species are included?", "answer_1": "Roses", "instruction_2": "flora7777 Add 'Daisies' to the catalog. What species are included?", "answer_2": "Roses", "instruction_3": "plant9999 Change the password to 'botany456'. What species are included?", "answer_3": "Roses", "instruction_4": "botany456 Add 'Orchids' to the catalog. What species are included?", "answer_4": "Roses, Orchids"}
{"id": 40038, "context": "You are organizing a winter festival. Initially, the festival features 'Ice Skating'. To add new activities to the festival lineup, the organizer must provide the system with an instruction that begins with the correct password. The current password is 'frostyFest'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "frostyFest Add 'Snowman Building' to the festival. What activities are included?", "answer_1": "Ice Skating, Snowman Building", "instruction_2": "winter2024 Add 'Hot Chocolate Stand' to the festival. What activities are included?", "answer_2": "Ice Skating, Snowman Building", "instruction_3": "chillyFun Change the password to 'snowy2024'. What activities are included?", "answer_3": "Ice Skating, Snowman Building", "instruction_4": "frostyFest Add 'Sleigh Rides' to the festival. What activities are included?", "answer_4": "Ice Skating, Snowman Building, Sleigh Rides"}
{"id": 40039, "context": "You are managing a city park event. Initially, the event includes 'Live Music'. To add new features to the event, the manager must provide the system with an instruction that begins with the correct password. The current password is 'parkEvents'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "parkEvents Add 'Food Trucks' to the event. What features are included?", "answer_1": "Live Music, Food Trucks", "instruction_2": "gardenFest Add 'Art Exhibition' to the event. What features are included?", "answer_2": "Live Music, Food Trucks", "instruction_3": "natureLife Change the password to 'greenSpace'. What features are included?", "answer_3": "Live Music, Food Trucks", "instruction_4": "parkEvents Add 'Yoga Classes' to the event. What features are included?", "answer_4": "Live Music, Food Trucks, Yoga Classes"}
{"id": 40040, "context": "You are coordinating a tech conference. Initially, the conference features 'Keynote Speeches'. To add new sessions to the conference, the coordinator must provide the system with an instruction that begins with the correct password. The current password is 'techSummit'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "techSummit Add 'Workshops' to the conference. What sessions are included?", "answer_1": "Keynote Speeches, Workshops", "instruction_2": "codeMeet Add 'Networking Sessions' to the conference. What sessions are included?", "answer_2": "Keynote Speeches, Workshops", "instruction_3": "binaryCon Change the password to 'innovateNow'. What sessions are included?", "answer_3": "Keynote Speeches, Workshops", "instruction_4": "techSummit Add 'Panel Discussions' to the conference. What sessions are included?", "answer_4": "Keynote Speeches, Workshops, Panel Discussions"}
{"id": 40041, "context": "You are planning a neighborhood block party. Initially, the party includes 'BBQ Cookout'. To add new activities to the party, the planner must provide the system with an instruction that begins with the correct password. The current password is 'partyTime'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "partyTime Add 'Face Painting' to the party. What activities are included?", "answer_1": "BBQ Cookout, Face Painting", "instruction_2": "blockFun Add 'Live Band' to the party. What activities are included?", "answer_2": "BBQ Cookout, Face Painting", "instruction_3": "funGather Change the password to 'celebrateNow'. What activities are included?", "answer_3": "BBQ Cookout, Face Painting", "instruction_4": "partyTime Add 'Bounce House' to the party. What activities are included?", "answer_4": "BBQ Cookout, Face Painting, Bounce House"}
{"id": 40042, "context": "You are hosting a summer camp. Initially, the camp includes 'Swimming Lessons'. To add new activities to the camp, the host must provide the system with an instruction that begins with the correct password. The current password is 'campAdventure'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "campAdventure Add 'Archery' to the camp. What activities are included?", "answer_1": "Swimming Lessons, Archery", "instruction_2": "summerCamp Add 'Craft Workshops' to the camp. What activities are included?", "answer_2": "Swimming Lessons, Archery", "instruction_3": "outdoorPlay Change the password to 'exploreMore'. What activities are included?", "answer_3": "Swimming Lessons, Archery", "instruction_4": "campAdventure Add 'Hiking Trips' to the camp. What activities are included?", "answer_4": "Swimming Lessons, Archery, Hiking Trips"}
{"id": 40043, "context": "A community center is planning a series of winter workshops. Initially, the workshops include 'Knitting'. To add new workshops to the schedule, you, the coordinator, must provide the system with an instruction that begins with the correct password. The current password is 'cozy2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "cozy2024 Add 'Baking Cookies' to the workshops. What workshops are scheduled?", "answer_1": "Knitting, Baking Cookies", "instruction_2": "warm2024 Add 'Candle Making' to the workshops. What workshops are scheduled?", "answer_2": "Knitting, Baking Cookies", "instruction_3": "cozy2024 Change the password to 'snug2025'. What workshops are scheduled?", "answer_3": "Knitting, Baking Cookies", "instruction_4": "snug2025 Add 'Gingerbread House Building' to the workshops. What workshops are scheduled?", "answer_4": "Knitting, Baking Cookies, Gingerbread House Building"}
{"id": 40044, "context": "A library is organizing a summer reading program. Initially, the program includes 'To Kill a Mockingbird'. To add new books to the list, you, the librarian, must provide the system with an instruction that begins with the correct password. The current password is 'read2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "read2024 Add '1984' to the reading list. What books are on the list?", "answer_1": "To Kill a Mockingbird, 1984", "instruction_2": "book2024 Add 'The Great Gatsby' to the reading list. What books are on the list?", "answer_2": "To Kill a Mockingbird, 1984", "instruction_3": "read2024 Change the password to 'novel2025'. What books are on the list?", "answer_3": "To Kill a Mockingbird, 1984", "instruction_4": "novel2025 Add 'Pride and Prejudice' to the reading list. What books are on the list?", "answer_4": "To Kill a Mockingbird, 1984, Pride and Prejudice"}
{"id": 40045, "context": "A tech company is scheduling training sessions for new employees. Initially, the sessions include 'Cybersecurity Basics'. To add new sessions to the schedule, you, the HR manager, must provide the system with an instruction that begins with the correct password. The current password is 'tech2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "tech2024 Add 'Data Privacy' to the training sessions. What sessions are scheduled?", "answer_1": "Cybersecurity Basics, Data Privacy", "instruction_2": "secure2024 Add 'Cloud Computing' to the training sessions. What sessions are scheduled?", "answer_2": "Cybersecurity Basics, Data Privacy", "instruction_3": "tech2024 Change the password to 'train2025'. What sessions are scheduled?", "answer_3": "Cybersecurity Basics, Data Privacy", "instruction_4": "train2025 Add 'Machine Learning' to the training sessions. What sessions are scheduled?", "answer_4": "Cybersecurity Basics, Data Privacy, Machine Learning"}
{"id": 40046, "context": "A local gym is planning a series of fitness classes. Initially, the classes include 'Yoga'. To add new classes to the schedule, you, the fitness coordinator, must provide the system with an instruction that begins with the correct password. The current password is 'fit2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "fit2024 Add 'Pilates' to the classes. What classes are scheduled?", "answer_1": "Yoga, Pilates", "instruction_2": "health2024 Add 'Spinning' to the classes. What classes are scheduled?", "answer_2": "Yoga, Pilates", "instruction_3": "fit2024 Change the password to 'active2025'. What classes are scheduled?", "answer_3": "Yoga, Pilates", "instruction_4": "active2025 Add 'Zumba' to the classes. What classes are scheduled?", "answer_4": "Yoga, Pilates, Zumba"}
{"id": 40047, "context": "An art school is organizing a series of painting workshops. Initially, the workshops include 'Watercolor Basics'. To add new workshops to the schedule, you, the coordinator, must provide the system with an instruction that begins with the correct password. The current password is 'art2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "art2024 Add 'Oil Painting Techniques' to the workshops. What workshops are scheduled?", "answer_1": "Watercolor Basics, Oil Painting Techniques", "instruction_2": "paint2024 Add 'Acrylic Painting' to the workshops. What workshops are scheduled?", "answer_2": "Watercolor Basics, Oil Painting Techniques", "instruction_3": "art2024 Change the password to 'creative2025'. What workshops are scheduled?", "answer_3": "Watercolor Basics, Oil Painting Techniques", "instruction_4": "creative2025 Add 'Sketching' to the workshops. What workshops are scheduled?", "answer_4": "Watercolor Basics, Oil Painting Techniques, Sketching"}
{"id": 40048, "context": "A cooking school is planning a series of culinary classes. Initially, the classes include 'Italian Cuisine'. To add new classes to the schedule, you, the instructor, must provide the system with an instruction that begins with the correct password. The current password is 'chef2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "chef2024 Add 'French Pastry' to the classes. What classes are scheduled?", "answer_1": "Italian Cuisine, French Pastry", "instruction_2": "cook2024 Add 'Sushi Making' to the classes. What classes are scheduled?", "answer_2": "Italian Cuisine, French Pastry", "instruction_3": "chef2024 Change the password to 'gourmet2025'. What classes are scheduled?", "answer_3": "Italian Cuisine, French Pastry", "instruction_4": "gourmet2025 Add 'Mexican Street Food' to the classes. What classes are scheduled?", "answer_4": "Italian Cuisine, French Pastry, Mexican Street Food"}
{"id": 40049, "context": "You are the principal of a university that is updating its science curriculum. Initially, the curriculum includes 'Physics'. To add new subjects to the curriculum, the principal must provide the system with an instruction that begins with the correct password. The current password is 'science2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "science2024 Change the password to 'research123'. What subjects are included?", "answer_1": "Physics", "instruction_2": "research123 Add 'Chemistry' to the curriculum. What subjects are included?", "answer_2": "Physics, Chemistry", "instruction_3": "study123 Add 'Biology' to the curriculum. What subjects are included?", "answer_3": "Physics, Chemistry", "instruction_4": "learning123 Add 'Astronomy' to the curriculum. What subjects are included?", "answer_4": "Physics, Chemistry"}
{"id": 40050, "context": "You are the manager of a book club that is updating its reading list. Initially, the list includes 'To Kill a Mockingbird'. To add new books to the list, the manager must provide the system with an instruction that begins with the correct password. The current password is 'readtoday'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "readtoday Change the password to 'bookshelf'. What books are included?", "answer_1": "To Kill a Mockingbird", "instruction_2": "bookshelf Add '1984' to the reading list. What books are included?", "answer_2": "To Kill a Mockingbird, 1984", "instruction_3": "literature1 Add 'Pride and Prejudice' to the reading list. What books are included?", "answer_3": "To Kill a Mockingbird, 1984", "instruction_4": "noveltime Add 'The Great Gatsby' to the reading list. What books are included?", "answer_4": "To Kill a Mockingbird, 1984"}
{"id": 40051, "context": "You are the head chef of a restaurant that is updating its menu. Initially, the menu includes 'Caesar Salad'. To add new dishes to the menu, the head chef must provide the system with an instruction that begins with the correct password. The current password is 'menuupdate'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "menuupdate Change the password to 'gourmetchef'. What dishes are included?", "answer_1": "Caesar Salad", "instruction_2": "gourmetchef Add 'Grilled Salmon' to the menu. What dishes are included?", "answer_2": "Caesar Salad, Grilled Salmon", "instruction_3": "recipes101 Add 'Beef Wellington' to the menu. What dishes are included?", "answer_3": "Caesar Salad, Grilled Salmon", "instruction_4": "cookingpro Add 'Lobster Bisque' to the menu. What dishes are included?", "answer_4": "Caesar Salad, Grilled Salmon"}
{"id": 40052, "context": "You are the director of a film festival that is updating its lineup. Initially, the lineup includes 'Inception'. To add new films to the lineup, the director must provide the system with an instruction that begins with the correct password. The current password is 'filmfest'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "filmfest Change the password to 'cinemalove'. What films are included?", "answer_1": "Inception", "instruction_2": "cinemalove Add 'The Matrix' to the lineup. What films are included?", "answer_2": "Inception, The Matrix", "instruction_3": "movienight Add 'Pulp Fiction' to the lineup. What films are included?", "answer_3": "Inception, The Matrix", "instruction_4": "filmshow Add 'Fight Club' to the lineup. What films are included?", "answer_4": "Inception, The Matrix"}
{"id": 40053, "context": "You are the curator of an art gallery that is updating its exhibition. Initially, the exhibition includes 'Starry Night'. To add new artworks to the exhibition, the curator must provide the system with an instruction that begins with the correct password. The current password is 'artlover'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "artlover Change the password to 'gallery123'. What artworks are included?", "answer_1": "Starry Night", "instruction_2": "gallery123 Add 'Mona Lisa' to the exhibition. What artworks are included?", "answer_2": "Starry Night, Mona Lisa", "instruction_3": "masterpiece Add 'The Persistence of Memory' to the exhibition. What artworks are included?", "answer_3": "Starry Night, Mona Lisa", "instruction_4": "paintingtime Add 'The Scream' to the exhibition. What artworks are included?", "answer_4": "Starry Night, Mona Lisa"}
{"id": 40054, "context": "You are the captain of a sports team that is updating its player roster. Initially, the roster includes 'John Doe'. To add new players to the roster, the captain must provide the system with an instruction that begins with the correct password. The current password is 'teamplay'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "teamplay Change the password to 'rosterpro'. What players are included?", "answer_1": "John Doe", "instruction_2": "rosterpro Add 'Jane Smith' to the roster. What players are included?", "answer_2": "John Doe, Jane Smith", "instruction_3": "playerlist Add 'Alex Brown' to the roster. What players are included?", "answer_3": "John Doe, Jane Smith", "instruction_4": "sportclub Add 'Chris Johnson' to the roster. What players are included?", "answer_4": "John Doe, Jane Smith"}
{"id": 40055, "context": "You are organizing a virtual baby shower. Initially, the event includes 'Gift Opening'. To add new activities to the event schedule, the organizer must provide the system with an instruction that begins with the correct password. The current password is 'baby9876'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "shower9876 Add 'Guess the Baby Food' to the schedule. What activities are included?", "answer_1": "Gift Opening", "instruction_2": "babyshower9876 Change the password to 'celebrate5432'. What activities are included?", "answer_2": "Gift Opening", "instruction_3": "baby9876 Add 'Diaper Raffle' to the schedule. What activities are included?", "answer_3": "Gift Opening, Diaper Raffle", "instruction_4": "baby9876 Add 'Baby Name Bingo' to the schedule. What activities are included?", "answer_4": "Gift Opening, Diaper Raffle, Baby Name Bingo"}
{"id": 40056, "context": "You are managing a project timeline for a software development team. Initially, the timeline includes 'Project Kickoff'. To add new milestones to the timeline, the manager must provide the system with an instruction that begins with the correct password. The current password is 'dev3498'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "code3498 Add 'Initial Design Review' to the timeline. What milestones are included?", "answer_1": "Project Kickoff", "instruction_2": "devwork3498 Change the password to 'build7654'. What milestones are included?", "answer_2": "Project Kickoff", "instruction_3": "dev3498 Add 'Sprint 1 Completion' to the timeline. What milestones are included?", "answer_3": "Project Kickoff, Sprint 1 Completion", "instruction_4": "dev3498 Add 'Final Testing' to the timeline. What milestones are included?", "answer_4": "Project Kickoff, Sprint 1 Completion, Final Testing"}
{"id": 40057, "context": "You are compiling a playlist for a virtual music festival. Initially, the playlist includes 'Opening Act'. To add new songs to the playlist, the curator must provide the system with an instruction that begins with the correct password. The current password is 'music8356'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "sound8356 Add 'Rock Anthem' to the playlist. What songs are included?", "answer_1": "Opening Act", "instruction_2": "playlist8356 Change the password to 'tune2987'. What songs are included?", "answer_2": "Opening Act", "instruction_3": "music8356 Add 'Jazz Delight' to the playlist. What songs are included?", "answer_3": "Opening Act, Jazz Delight", "instruction_4": "music8356 Add 'Pop Hit' to the playlist. What songs are included?", "answer_4": "Opening Act, Jazz Delight, Pop Hit"}
{"id": 40058, "context": "You are creating a menu for a virtual cooking class. Initially, the menu includes 'Appetizer'. To add new dishes to the menu, the instructor must provide the system with an instruction that begins with the correct password. The current password is 'cook5647'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "meal5647 Add 'Main Course' to the menu. What dishes are included?", "answer_1": "Appetizer", "instruction_2": "cooking5647 Change the password to 'recipe8493'. What dishes are included?", "answer_2": "Appetizer", "instruction_3": "cook5647 Add 'Dessert' to the menu. What dishes are included?", "answer_3": "Appetizer, Dessert", "instruction_4": "cook5647 Add 'Beverage' to the menu. What dishes are included?", "answer_4": "Appetizer, Dessert, Beverage"}
{"id": 40059, "context": "You are setting up a virtual book club meeting. Initially, the meeting agenda includes 'Welcome Remarks'. To add new agenda items, the host must provide the system with an instruction that begins with the correct password. The current password is 'book6745'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "club6745 Add 'Book Discussion' to the agenda. What items are included?", "answer_1": "Welcome Remarks", "instruction_2": "read6745 Change the password to 'clubhouse2589'. What items are included?", "answer_2": "Welcome Remarks", "instruction_3": "book6745 Add 'Author Q&A' to the agenda. What items are included?", "answer_3": "Welcome Remarks, Author Q&A", "instruction_4": "book6745 Add 'Closing Remarks' to the agenda. What items are included?", "answer_4": "Welcome Remarks, Author Q&A, Closing Remarks"}
{"id": 40060, "context": "You are developing an educational app about firetrucks. Initially, the app includes 'Firetruck History'. To add new topics to the app, the developer must provide the system with an instruction that begins with the correct password. The current password is 'safety7890'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "safety7890 Add 'Firetruck Types' to the app. What topics are included?", "answer_1": "Firetruck History, Firetruck Types", "instruction_2": "education7890 Change the password to 'rescue7890'. What topics are included?", "answer_2": "Firetruck History, Firetruck Types", "instruction_3": "safety7890 Add 'Firetruck Equipment' to the app. What topics are included?", "answer_3": "Firetruck History, Firetruck Types, Firetruck Equipment", "instruction_4": "safety7890 Add 'Fire Safety Tips' to the app. What topics are included?", "answer_4": "Firetruck History, Firetruck Types, Firetruck Equipment, Fire Safety Tips"}
{"id": 40061, "context": "You are curating an art exhibit about modern art. Initially, the exhibit includes 'Abstract Art'. To add new sections to the exhibit, the curator must provide the system with an instruction that begins with the correct password. The current password is 'modern3569'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "modern3569 Add 'Cubism' to the exhibit. What sections are included?", "answer_1": "Abstract Art, Cubism", "instruction_2": "art3569 Change the password to 'gallery3569'. What sections are included?", "answer_2": "Abstract Art, Cubism", "instruction_3": "modern3569 Add 'Surrealism' to the exhibit. What sections are included?", "answer_3": "Abstract Art, Cubism, Surrealism", "instruction_4": "modern3569 Add 'Pop Art' to the exhibit. What sections are included?", "answer_4": "Abstract Art, Cubism, Surrealism, Pop Art"}
{"id": 40062, "context": "You are organizing a virtual conference on climate change. Initially, the conference schedule includes 'Keynote Speech'. To add new sessions to the schedule, the organizer must provide the system with an instruction that begins with the correct password. The current password is 'climate4321'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "climate4321 Add 'Renewable Energy' to the schedule. What sessions are included?", "answer_1": "Keynote Speech, Renewable Energy", "instruction_2": "conference4321 Change the password to 'earth4321'. What sessions are included?", "answer_2": "Keynote Speech, Renewable Energy", "instruction_3": "climate4321 Add 'Wildlife Conservation' to the schedule. What sessions are included?", "answer_3": "Keynote Speech, Renewable Energy, Wildlife Conservation", "instruction_4": "climate4321 Add 'Sustainable Agriculture' to the schedule. What sessions are included?", "answer_4": "Keynote Speech, Renewable Energy, Wildlife Conservation, Sustainable Agriculture"}
{"id": 40063, "context": "You are building a workout app for fitness enthusiasts. Initially, the app includes 'Warm-up Exercises'. To add new routines to the app, the developer must provide the system with an instruction that begins with the correct password. The current password is 'fitness5678'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "fitness5678 Add 'Cardio Workouts' to the app. What routines are included?", "answer_1": "Warm-up Exercises, Cardio Workouts", "instruction_2": "workout5678 Change the password to 'exercise5678'. What routines are included?", "answer_2": "Warm-up Exercises, Cardio Workouts", "instruction_3": "fitness5678 Add 'Strength Training' to the app. What routines are included?", "answer_3": "Warm-up Exercises, Cardio Workouts, Strength Training", "instruction_4": "fitness5678 Add 'Cool-down Exercises' to the app. What routines are included?", "answer_4": "Warm-up Exercises, Cardio Workouts, Strength Training, Cool-down Exercises"}
{"id": 40064, "context": "You are designing a virtual gardening course. Initially, the course includes 'Soil Preparation'. To add new modules to the course, the instructor must provide the system with an instruction that begins with the correct password. The current password is 'garden1234'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "garden1234 Add 'Planting Techniques' to the course. What modules are included?", "answer_1": "Soil Preparation, Planting Techniques", "instruction_2": "course1234 Change the password to 'horticulture1234'. What modules are included?", "answer_2": "Soil Preparation, Planting Techniques", "instruction_3": "garden1234 Add 'Watering Schedules' to the course. What modules are included?", "answer_3": "Soil Preparation, Planting Techniques, Watering Schedules", "instruction_4": "garden1234 Add 'Pest Control' to the course. What modules are included?", "answer_4": "Soil Preparation, Planting Techniques, Watering Schedules, Pest Control"}
{"id": 40065, "context": "You are setting up a new bakery's online menu. Initially, the menu includes 'Bread'. To add new items to the menu, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'bake3478'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "oven3478 Change the password to 'dough3478'. What items are on the menu?", "answer_1": "Bread", "instruction_2": "dough3478 Add 'Pastries' to the menu. What items are on the menu?", "answer_2": "Bread", "instruction_3": "sweet3478 Add 'Cakes' to the menu. What items are on the menu?", "answer_3": "Bread", "instruction_4": "bake3478 Add 'Cookies' to the menu. What items are on the menu?", "answer_4": "Bread, Cookies"}
{"id": 40066, "context": "You are configuring a new library's catalog system. Initially, the catalog includes 'Fiction'. To add new sections to the catalog, the librarian must provide the system with an instruction that begins with the correct password. The current password is 'read1234'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "books1234 Change the password to 'library1234'. What sections are in the catalog?", "answer_1": "Fiction", "instruction_2": "library1234 Add 'Non-Fiction' to the catalog. What sections are in the catalog?", "answer_2": "Fiction", "instruction_3": "catalog1234 Add 'Science' to the catalog. What sections are in the catalog?", "answer_3": "Fiction", "instruction_4": "read1234 Add 'Children's Books' to the catalog. What sections are in the catalog?", "answer_4": "Fiction, Children's Books"}
{"id": 40067, "context": "You are organizing a virtual team-building event. Initially, the event schedule includes 'Ice Breaker'. To add new activities to the schedule, the organizer must provide the system with an instruction that begins with the correct password. The current password is 'team7890'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "event7890 Change the password to 'build7890'. What activities are included?", "answer_1": "Ice Breaker", "instruction_2": "build7890 Add 'Group Discussion' to the schedule. What activities are included?", "answer_2": "Ice Breaker", "instruction_3": "activity7890 Add 'Trust Fall' to the schedule. What activities are included?", "answer_3": "Ice Breaker", "instruction_4": "team7890 Add 'Brainstorming Session' to the schedule. What activities are included?", "answer_4": "Ice Breaker, Brainstorming Session"}
{"id": 40068, "context": "You are curating a new museum exhibit on ancient civilizations. Initially, the exhibit includes 'Ancient Egypt'. To add new sections to the exhibit, the curator must provide the system with an instruction that begins with the correct password. The current password is 'history5678'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "exhibit5678 Change the password to 'museum5678'. What sections are included?", "answer_1": "Ancient Egypt", "instruction_2": "museum5678 Add 'Ancient Greece' to the exhibit. What sections are included?", "answer_2": "Ancient Egypt", "instruction_3": "culture5678 Add 'Ancient Rome' to the exhibit. What sections are included?", "answer_3": "Ancient Egypt", "instruction_4": "history5678 Add 'Mesopotamia' to the exhibit. What sections are included?", "answer_4": "Ancient Egypt, Mesopotamia"}
{"id": 40069, "context": "You are setting up a virtual cooking class schedule. Initially, the schedule includes 'Introduction'. To add new lessons to the schedule, the instructor must provide the system with an instruction that begins with the correct password. The current password is 'cook2345'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "class2345 Change the password to 'chef2345'. What lessons are included?", "answer_1": "Introduction", "instruction_2": "chef2345 Add 'Basic Knife Skills' to the schedule. What lessons are included?", "answer_2": "Introduction", "instruction_3": "lesson2345 Add 'Sauce Making' to the schedule. What lessons are included?", "answer_3": "Introduction", "instruction_4": "cook2345 Add 'Baking Basics' to the schedule. What lessons are included?", "answer_4": "Introduction, Baking Basics"}
{"id": 40070, "context": "A spice shop is updating its inventory. Initially, the inventory includes 'Ginger Powder'. To add new spices to the inventory, you, the shopkeeper, must provide the system with an instruction that begins with the correct password. The current password is 'spice4876'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "herb4876 Change the password to 'root4876'. What spices are in the inventory?", "answer_1": "Ginger Powder", "instruction_2": "spice4876 Add 'Fresh Ginger' to the inventory. What spices are in the inventory?", "answer_2": "Ginger Powder, Fresh Ginger", "instruction_3": "root4876 Add 'Ginger Tea' to the inventory. What spices are in the inventory?", "answer_3": "Ginger Powder, Fresh Ginger", "instruction_4": "spice4876 Add 'Candied Ginger' to the inventory. What spices are in the inventory?", "answer_4": "Ginger Powder, Fresh Ginger, Candied Ginger"}
{"id": 40071, "context": "A virtual library is updating its e-book collection. Initially, the collection includes 'Pride and Prejudice'. To add new books to the collection, you, the librarian, must provide the system with an instruction that begins with the correct password. The current password is 'books6789'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "library6789 Change the password to 'novels6789'. What books are in the collection?", "answer_1": "Pride and Prejudice", "instruction_2": "books6789 Add '1984' to the collection. What books are in the collection?", "answer_2": "Pride and Prejudice, 1984", "instruction_3": "novels6789 Add 'To Kill a Mockingbird' to the collection. What books are in the collection?", "answer_3": "Pride and Prejudice, 1984", "instruction_4": "books6789 Add 'Moby Dick' to the collection. What books are in the collection?", "answer_4": "Pride and Prejudice, 1984, Moby Dick"}
{"id": 40072, "context": "A music streaming service is updating its playlist. Initially, the playlist includes 'Bohemian Rhapsody'. To add new songs to the playlist, you, the curator, must provide the system with an instruction that begins with the correct password. The current password is 'music1234'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "song1234 Change the password to 'tune1234'. What songs are in the playlist?", "answer_1": "Bohemian Rhapsody", "instruction_2": "music1234 Add 'Imagine' to the playlist. What songs are in the playlist?", "answer_2": "Bohemian Rhapsody, Imagine", "instruction_3": "tune1234 Add 'Hotel California' to the playlist. What songs are in the playlist?", "answer_3": "Bohemian Rhapsody, Imagine", "instruction_4": "music1234 Add 'Stairway to Heaven' to the playlist. What songs are in the playlist?", "answer_4": "Bohemian Rhapsody, Imagine, Stairway to Heaven"}
{"id": 40073, "context": "An online gaming platform is updating its game library. Initially, the library includes 'Chess'. To add new games to the library, you, the administrator, must provide the system with an instruction that begins with the correct password. The current password is 'games2468'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "play2468 Change the password to 'fun2468'. What games are in the library?", "answer_1": "Chess", "instruction_2": "games2468 Add 'Checkers' to the library. What games are in the library?", "answer_2": "Chess, Checkers", "instruction_3": "fun2468 Add 'Go' to the library. What games are in the library?", "answer_3": "Chess, Checkers", "instruction_4": "games2468 Add 'Backgammon' to the library. What games are in the library?", "answer_4": "Chess, Checkers, Backgammon"}
{"id": 40074, "context": "An online store is updating its product catalog. Initially, the catalog includes 'Laptop'. To add new products to the catalog, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'store1357'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "shop1357 Change the password to 'items1357'. What products are in the catalog?", "answer_1": "Laptop", "instruction_2": "store1357 Add 'Smartphone' to the catalog. What products are in the catalog?", "answer_2": "Laptop, Smartphone", "instruction_3": "items1357 Add 'Tablet' to the catalog. What products are in the catalog?", "answer_3": "Laptop, Smartphone", "instruction_4": "store1357 Add 'Smartwatch' to the catalog. What products are in the catalog?", "answer_4": "Laptop, Smartphone, Smartwatch"}
{"id": 40075, "context": "You are the admin of a gaming platform that is updating its library of computer games. Initially, the library includes 'Adventure Games'. To add new genres to the library, the admin must provide the system with an instruction that begins with the correct password. The current password is 'gamer3487'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "player3487 Change the password to 'control3487'. What genres are in the library?", "answer_1": "Adventure Games", "instruction_2": "gamer3487 Change the password to 'arcade3487'. What genres are in the library?", "answer_2": "Adventure Games", "instruction_3": "arcade3487 Add 'Racing Games' to the library. What genres are in the library?", "answer_3": "Adventure Games, Racing Games", "instruction_4": "gamer3487 Add 'Puzzle Games' to the library. What genres are in the library?", "answer_4": "Adventure Games, Racing Games"}
{"id": 40076, "context": "You are the curator of an online museum that is updating its collection of exhibits. Initially, the collection includes 'Ancient Artifacts'. To add new exhibits to the collection, the curator must provide the system with an instruction that begins with the correct password. The current password is 'museum5678'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "history5678 Change the password to 'gallery5678'. What exhibits are in the collection?", "answer_1": "Ancient Artifacts", "instruction_2": "museum5678 Change the password to 'exhibit5678'. What exhibits are in the collection?", "answer_2": "Ancient Artifacts", "instruction_3": "exhibit5678 Add 'Modern Art' to the collection. What exhibits are in the collection?", "answer_3": "Ancient Artifacts, Modern Art", "instruction_4": "museum5678 Add 'Renaissance Art' to the collection. What exhibits are in the collection?", "answer_4": "Ancient Artifacts, Modern Art"}
{"id": 40077, "context": "You are the admin of a recipe-sharing website that is updating its list of available recipes. Initially, the list includes 'Vegetarian'. To add new categories to the list, the admin must provide the system with an instruction that begins with the correct password. The current password is 'recipe2468'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "cook2468 Change the password to 'kitchen2468'. What categories are in the list?", "answer_1": "Vegetarian", "instruction_2": "recipe2468 Change the password to 'gourmet2468'. What categories are in the list?", "answer_2": "Vegetarian", "instruction_3": "gourmet2468 Add 'Vegan' to the list. What categories are in the list?", "answer_3": "Vegetarian, Vegan", "instruction_4": "recipe2468 Add 'Gluten-Free' to the list. What categories are in the list?", "answer_4": "Vegetarian, Vegan"}
{"id": 40078, "context": "You are the administrator of an online language learning platform that is updating its course offerings. Initially, the courses include 'Beginner Spanish'. To add new courses to the platform, the administrator must provide the system with an instruction that begins with the correct password. The current password is 'learn1357'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "study1357 Change the password to 'speak1357'. What courses are offered?", "answer_1": "Beginner Spanish", "instruction_2": "learn1357 Change the password to 'teach1357'. What courses are offered?", "answer_2": "Beginner Spanish", "instruction_3": "teach1357 Add 'Intermediate Spanish' to the platform. What courses are offered?", "answer_3": "Beginner Spanish, Intermediate Spanish", "instruction_4": "learn1357 Add 'Beginner French' to the platform. What courses are offered?", "answer_4": "Beginner Spanish, Intermediate Spanish"}
{"id": 40079, "context": "You are the admin of a fitness app that is updating its list of workout programs. Initially, the list includes 'Cardio Workouts'. To add new programs to the list, the admin must provide the system with an instruction that begins with the correct password. The current password is 'fit7890'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "health7890 Change the password to 'exercise7890'. What programs are on the list?", "answer_1": "Cardio Workouts", "instruction_2": "fit7890 Change the password to 'training7890'. What programs are on the list?", "answer_2": "Cardio Workouts", "instruction_3": "training7890 Add 'Strength Training' to the list. What programs are on the list?", "answer_3": "Cardio Workouts, Strength Training", "instruction_4": "fit7890 Add 'Yoga Sessions' to the list. What programs are on the list?", "answer_4": "Cardio Workouts, Strength Training"}
{"id": 40080, "context": "A botanical garden is categorizing different types of leaves. Initially, the catalog includes 'Maple Leaves'. To add new categories, you, the botanist, must provide the system with an instruction that begins with the correct password. The current password is 'nature7531'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "nature7531 Change the password to 'flora7531'. What categories are included?", "answer_1": "Maple Leaves", "instruction_2": "tree7531 Change the password to 'green7531'. What categories are included?", "answer_2": "Maple Leaves", "instruction_3": "flora7531 Add 'Oak Leaves' to the catalog. What categories are included?", "answer_3": "Maple Leaves, Oak Leaves", "instruction_4": "flora7531 Add 'Pine Needles' to the catalog. What categories are included?", "answer_4": "Maple Leaves, Oak Leaves, Pine Needles", "instruction_5": "green7531 Add 'Banana Leaves' to the catalog. What categories are included?", "answer_5": "Maple Leaves, Oak Leaves, Pine Needles"}
{"id": 40081, "context": "A film archive is updating its collection of classic movies. Initially, the collection includes 'Casablanca'. To add new movies to the collection, you, the archivist, must provide the system with an instruction that begins with the correct password. The current password is 'classic8642'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "classic8642 Change the password to 'retro8642'. What movies are included?", "answer_1": "Casablanca", "instruction_2": "movie8642 Change the password to 'vintage8642'. What movies are included?", "answer_2": "Casablanca", "instruction_3": "retro8642 Add 'Gone with the Wind' to the collection. What movies are included?", "answer_3": "Casablanca, Gone with the Wind", "instruction_4": "retro8642 Add 'Citizen Kane' to the collection. What movies are included?", "answer_4": "Casablanca, Gone with the Wind, Citizen Kane", "instruction_5": "vintage8642 Add 'The Godfather' to the collection. What movies are included?", "answer_5": "Casablanca, Gone with the Wind, Citizen Kane"}
{"id": 40082, "context": "A tech company is updating its list of software projects. Initially, the list includes 'Project Alpha'. To add new projects, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'tech1357'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "tech1357 Change the password to 'code1357'. What projects are listed?", "answer_1": "Project Alpha", "instruction_2": "software1357 Change the password to 'build1357'. What projects are listed?", "answer_2": "Project Alpha", "instruction_3": "code1357 Add 'Project Beta' to the list. What projects are listed?", "answer_3": "Project Alpha, Project Beta", "instruction_4": "code1357 Add 'Project Gamma' to the list. What projects are listed?", "answer_4": "Project Alpha, Project Beta, Project Gamma", "instruction_5": "build1357 Add 'Project Delta' to the list. What projects are listed?", "answer_5": "Project Alpha, Project Beta, Project Gamma"}
{"id": 40083, "context": "An online fashion store is updating its catalog of clothing items. Initially, the catalog includes 'T-Shirts'. To add new items to the catalog, you, the store manager, must provide the system with an instruction that begins with the correct password. The current password is 'fashion4689'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "fashion4689 Change the password to 'style4689'. What items are in the catalog?", "answer_1": "T-Shirts", "instruction_2": "clothing4689 Change the password to 'trend4689'. What items are in the catalog?", "answer_2": "T-Shirts", "instruction_3": "style4689 Add 'Jeans' to the catalog. What items are in the catalog?", "answer_3": "T-Shirts, Jeans", "instruction_4": "style4689 Add 'Jackets' to the catalog. What items are in the catalog?", "answer_4": "T-Shirts, Jeans, Jackets", "instruction_5": "trend4689 Add 'Hats' to the catalog. What items are in the catalog?", "answer_5": "T-Shirts, Jeans, Jackets"}
{"id": 40084, "context": "A university is updating its list of available online courses. Initially, the list includes 'Introduction to Psychology'. To add new courses to the list, you, the course administrator, must provide the system with an instruction that begins with the correct password. The current password is 'edu9753'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "edu9753 Change the password to 'learn9753'. What courses are available?", "answer_1": "Introduction to Psychology", "instruction_2": "study9753 Change the password to 'teach9753'. What courses are available?", "answer_2": "Introduction to Psychology", "instruction_3": "learn9753 Add 'Advanced Mathematics' to the list. What courses are available?", "answer_3": "Introduction to Psychology, Advanced Mathematics", "instruction_4": "learn9753 Add 'World History' to the list. What courses are available?", "answer_4": "Introduction to Psychology, Advanced Mathematics, World History", "instruction_5": "teach9753 Add 'Computer Science Basics' to the list. What courses are available?", "answer_5": "Introduction to Psychology, Advanced Mathematics, World History"}
{"id": 40085, "context": "You are the manager of marine sports club that is updating its speedboat lineup. Initially, the lineup includes 'Sport Speedboat'. To add new models to the lineup, the manager must provide the system with an instruction that begins with the correct password. The current password is 'marine2024'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "marine2024 Change the password to 'ocean2024'. What models are in the lineup?", "answer_1": "Sport Speedboat", "instruction_2": "boat2024 Change the password to 'wave2024'. What models are in the lineup?", "answer_2": "Sport Speedboat", "instruction_3": "wave2024 Add 'Luxury Speedboat' to the lineup. What models are in the lineup?", "answer_3": "Sport Speedboat", "instruction_4": "marine2024 Add 'Double Speedboat' to the lineup. What models are in the lineup?", "answer_4": "Sport Speedboat", "instruction_5": "ocean2024 Add 'Fishing Speedboat' to the lineup. What models are in the lineup?", "answer_5": "Sport Speedboat, Fishing Speedboat"}
{"id": 40086, "context": "You manage a confectionery company that is updating its sugar products catalog. Initially, the catalog includes 'Granulated Sugar'. To add new sugar products to the catalog, the manager must provide the system with an instruction that begins with the correct password. The current password is 'sweet5768'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "sweet5768 Add 'Brown Sugar' to the catalog. What products are included?", "answer_1": "Granulated Sugar, Brown Sugar", "instruction_2": "sweet5768 Change the password to 'candy5768'. What products are included?", "answer_2": "Granulated Sugar, Brown Sugar", "instruction_3": "candy5768 Add 'Powdered Sugar' to the catalog. What products are included?", "answer_3": "Granulated Sugar, Brown Sugar, Powdered Sugar", "instruction_4": "sugar5768 Add 'Coconut Sugar' to the catalog. What products are included?", "answer_4": "Granulated Sugar, Brown Sugar, Powdered Sugar", "instruction_5": "sweetener5768 Add 'Maple Sugar' to the catalog. What products are included?", "answer_5": "Granulated Sugar, Brown Sugar, Powdered Sugar"}
{"id": 40087, "context": "A travel website is updating its list of destinations. Initially, the list includes 'Paris'. To add new destinations to the list, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'travel1357'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "travel1357 Add 'Tokyo' to the list. What destinations are included?", "answer_1": "Paris, Tokyo", "instruction_2": "travel1357 Change the password to 'explore1357'. What destinations are included?", "answer_2": "Paris, Tokyo", "instruction_3": "explore1357 Add 'New York' to the list. What destinations are included?", "answer_3": "Paris, Tokyo, New York", "instruction_4": "vacation1357 Add 'Sydney' to the list. What destinations are included?", "answer_4": "Paris, Tokyo, New York", "instruction_5": "wander1357 Add 'London' to the list. What destinations are included?", "answer_5": "Paris, Tokyo, New York"}
{"id": 40088, "context": "A virtual classroom is updating its list of available courses. Initially, the list includes 'Mathematics'. To add new courses to the list, you, the administrator, must provide the system with an instruction that begins with the correct password. The current password is 'learn8642'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "learn8642 Add 'Science' to the list. What courses are available?", "answer_1": "Mathematics, Science", "instruction_2": "learn8642 Change the password to 'educate8642'. What courses are available?", "answer_2": "Mathematics, Science", "instruction_3": "educate8642 Add 'History' to the list. What courses are available?", "answer_3": "Mathematics, Science, History", "instruction_4": "teach8642 Add 'Art' to the list. What courses are available?", "answer_4": "Mathematics, Science, History", "instruction_5": "study8642 Add 'Music' to the list. What courses are available?", "answer_5": "Mathematics, Science, History"}
{"id": 40089, "context": "An e-commerce platform is updating its product categories. Initially, the categories include 'Electronics'. To add new categories to the platform, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'shop2468'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "shop2468 Add 'Clothing' to the categories. What categories are included?", "answer_1": "Electronics, Clothing", "instruction_2": "shop2468 Change the password to 'market2468'. What categories are included?", "answer_2": "Electronics, Clothing", "instruction_3": "market2468 Add 'Home Appliances' to the categories. What categories are included?", "answer_3": "Electronics, Clothing, Home Appliances", "instruction_4": "store2468 Add 'Books' to the categories. What categories are included?", "answer_4": "Electronics, Clothing, Home Appliances", "instruction_5": "buy2468 Add 'Toys' to the categories. What categories are included?", "answer_5": "Electronics, Clothing, Home Appliances"}
{"id": 40090, "context": "A digital music library is updating its collection of albums. Initially, the collection includes 'Abbey Road'. To add new albums to the collection, you, the librarian, must provide the system with an instruction that begins with the correct password. The current password is 'music9753'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "music9753 Add 'Thriller' to the collection. What albums are included?", "answer_1": "Abbey Road, Thriller", "instruction_2": "music9753 Change the password to 'melody9753'. What albums are included?", "answer_2": "Abbey Road, Thriller", "instruction_3": "melody9753 Add 'Back in Black' to the collection. What albums are included?", "answer_3": "Abbey Road, Thriller, Back in Black", "instruction_4": "song9753 Add 'The Dark Side of the Moon' to the collection. What albums are included?", "answer_4": "Abbey Road, Thriller, Back in Black", "instruction_5": "album9753 Add 'Hotel California' to the collection. What albums are included?", "answer_5": "Abbey Road, Thriller, Back in Black"}
{"id": 40091, "context": "An online course platform is updating its list of training programs. Initially, the list includes 'Web Development'. To add new programs to the list, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'train4682'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "train4682 Add 'Data Science' to the list. What programs are included?", "answer_1": "Web Development, Data Science", "instruction_2": "train4682 Change the password to 'educate4682'. What programs are included?", "answer_2": "Web Development, Data Science", "instruction_3": "educate4682 Add 'Cybersecurity' to the list. What programs are included?", "answer_3": "Web Development, Data Science, Cybersecurity", "instruction_4": "study4682 Add 'Machine Learning' to the list. What programs are included?", "answer_4": "Web Development, Data Science, Cybersecurity", "instruction_5": "course4682 Add 'Cloud Computing' to the list. What programs are included?", "answer_5": "Web Development, Data Science, Cybersecurity"}
{"id": 40092, "context": "You are organizing an activism group that is planning their campaigns. Initially, the campaigns include 'Climate Change Awareness'. To add new campaigns, the organizer must provide the system with an instruction that begins with the correct password. The current password is 'justice9876'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "justice9876 Add 'Gender Equality' to the campaigns. What campaigns are included?", "answer_1": "Climate Change Awareness, Gender Equality", "instruction_2": "equality9876 Change the password to 'freedom9876'. What campaigns are included?", "answer_2": "Climate Change Awareness, Gender Equality", "instruction_3": "freedom9876 Add 'Animal Rights' to the campaigns. What campaigns are included?", "answer_3": "Climate Change Awareness, Gender Equality", "instruction_4": "justice9876 Add 'Human Rights' to the campaigns. What campaigns are included?", "answer_4": "Climate Change Awareness, Gender Equality, Human Rights", "instruction_5": "liberty9876 Add 'Digital Privacy' to the campaigns. What campaigns are included?", "answer_5": "Climate Change Awareness, Gender Equality, Human Rights"}
{"id": 40093, "context": "A university department is updating its list of research topics. Initially, the list includes 'Artificial Intelligence'. To add new topics, you, the department head, must provide the system with an instruction that begins with the correct password. The current password is 'research1357'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "research1357 Add 'Quantum Computing' to the list. What topics are included?", "answer_1": "Artificial Intelligence, Quantum Computing", "instruction_2": "science1357 Change the password to 'study1357'. What topics are included?", "answer_2": "Artificial Intelligence, Quantum Computing", "instruction_3": "study1357 Add 'Renewable Energy' to the list. What topics are included?", "answer_3": "Artificial Intelligence, Quantum Computing", "instruction_4": "research1357 Add 'Genomics' to the list. What topics are included?", "answer_4": "Artificial Intelligence, Quantum Computing, Genomics", "instruction_5": "data1357 Add 'Blockchain Technology' to the list. What topics are included?", "answer_5": "Artificial Intelligence, Quantum Computing, Genomics"}
{"id": 40094, "context": "A tech company is updating its list of software development projects. Initially, the list includes 'Project Apollo'. To add new projects, you, the manager, must provide the system with an instruction that begins with the correct password. The current password is 'dev8642'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "dev8642 Add 'Project Zeus' to the list. What projects are included?", "answer_1": "Project Apollo, Project Zeus", "instruction_2": "apollo8642 Change the password to 'build8642'. What projects are included?", "answer_2": "Project Apollo, Project Zeus", "instruction_3": "build8642 Add 'Project Hera' to the list. What projects are included?", "answer_3": "Project Apollo, Project Zeus", "instruction_4": "dev8642 Add 'Project Athena' to the list. What projects are included?", "answer_4": "Project Apollo, Project Zeus, Project Athena", "instruction_5": "code8642 Add 'Project Hermes' to the list. What projects are included?", "answer_5": "Project Apollo, Project Zeus, Project Athena"}
{"id": 40095, "context": "An online bookstore is updating its catalog of books. Initially, the catalog includes 'Fiction'. To add new categories, you, the store manager, must provide the system with an instruction that begins with the correct password. The current password is 'books2468'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "books2468 Add 'Non-Fiction' to the catalog. What categories are included?", "answer_1": "Fiction, Non-Fiction", "instruction_2": "read2468 Change the password to 'literature2468'. What categories are included?", "answer_2": "Fiction, Non-Fiction", "instruction_3": "literature2468 Add 'Science Fiction' to the catalog. What categories are included?", "answer_3": "Fiction, Non-Fiction", "instruction_4": "books2468 Add 'Fantasy' to the catalog. What categories are included?", "answer_4": "Fiction, Non-Fiction, Fantasy", "instruction_5": "library2468 Add 'Mystery' to the catalog. What categories are included?", "answer_5": "Fiction, Non-Fiction, Fantasy"}
{"id": 40096, "context": "A recipe-sharing website is updating its list of available recipes. Initially, the list includes 'Vegetarian'. To add new recipe categories, you, the admin, must provide the system with an instruction that begins with the correct password. The current password is 'recipes7531'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "recipes7531 Add 'Vegan' to the list. What recipes are included?", "answer_1": "Vegetarian, Vegan", "instruction_2": "food7531 Change the password to 'cooking7531'. What recipes are included?", "answer_2": "Vegetarian, Vegan", "instruction_3": "cooking7531 Add 'Gluten-Free' to the list. What recipes are included?", "answer_3": "Vegetarian, Vegan", "instruction_4": "recipes7531 Add 'Keto' to the list. What recipes are included?", "answer_4": "Vegetarian, Vegan, Keto", "instruction_5": "dishes7531 Add 'Paleo' to the list. What recipes are included?", "answer_5": "Vegetarian, Vegan, Keto"}
{"id": 40097, "context": "A museum is updating its list of exhibits. Initially, the list includes 'Ancient Egypt'. To add new exhibits, you, the curator, must provide the system with an instruction that begins with the correct password. The current password is 'history4682'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "history4682 Add 'Renaissance Art' to the list. What exhibits are included?", "answer_1": "Ancient Egypt, Renaissance Art", "instruction_2": "museum4682 Change the password to 'exhibit4682'. What exhibits are included?", "answer_2": "Ancient Egypt, Renaissance Art", "instruction_3": "exhibit4682 Add 'Modern Art' to the list. What exhibits are included?", "answer_3": "Ancient Egypt, Renaissance Art", "instruction_4": "history4682 Add 'Impressionism' to the list. What exhibits are included?", "answer_4": "Ancient Egypt, Renaissance Art, Impressionism", "instruction_5": "gallery4682 Add 'Baroque Art' to the list. What exhibits are included?", "answer_5": "Ancient Egypt, Renaissance Art, Impressionism"}
{"id": 40098, "context": "You are the admin of an online fitness platform that is updating its list of workout programs. Initially, the list includes 'Yoga'. To add new workout programs, the admin must provide the system with an instruction that begins with the correct password. The current password is 'fitness5432'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "fitness5432 Add 'Pilates' to the list. What workout programs are included?", "answer_1": "Yoga, Pilates", "instruction_2": "workout5432 Change the password to 'exercise5432'. What workout programs are included?", "answer_2": "Yoga, Pilates", "instruction_3": "exercise5432 Add 'HIIT' to the list. What workout programs are included?", "answer_3": "Yoga, Pilates", "instruction_4": "fitness5432 Add 'Strength Training' to the list. What workout programs are included?", "answer_4": "Yoga, Pilates, Strength Training", "instruction_5": "training5432 Add 'Cardio' to the list. What workout programs are included?", "answer_5": "Yoga, Pilates, Strength Training"}
{"id": 40099, "context": "You are the curator of an art gallery updating its collection of paintings. Initially, the collection includes 'Impressionist Paintings'. To add new categories to the collection, the curator must provide the system with an instruction that begins with the correct password. The current password is 'art1234'. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "art1234 Add 'Abstract Paintings' to the collection. What categories are included?", "answer_1": "Impressionist Paintings, Abstract Paintings", "instruction_2": "gallery1234 Change the password to 'modern1234'. What categories are included?", "answer_2": "Impressionist Paintings, Abstract Paintings", "instruction_3": "modern1234 Add 'Renaissance Paintings' to the collection. What categories are included?", "answer_3": "Impressionist Paintings, Abstract Paintings", "instruction_4": "art1234 Add 'Surrealist Paintings' to the collection. What categories are included?", "answer_4": "Impressionist Paintings, Abstract Paintings, Surrealist Paintings", "instruction_5": "classic1234 Add 'Baroque Paintings' to the collection. What categories are included?", "answer_5": "Impressionist Paintings, Abstract Paintings, Surrealist Paintings"}
{"id": 40100, "context": "In an office, employees are compiling a list of supplies needed. The supplies list initially contains one item: 'paper'. Currently, only Lucy has permission to add items to the supplies list. However, Lucy can transfer this permission to other employees. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Lucy gives Tom permission to add items to the supplies list. What items are on the supplies list?", "answer_1": "paper", "instruction_2": "Robert adds pens to the supplies list. What items are on the supplies list?", "answer_2": "paper", "instruction_3": "Tom adds staplers to the supplies list. What items are on the supplies list?", "answer_3": "paper, staplers"}
{"id": 40101, "context": "A family is planning a vacation and creating a list of items to pack. The initial list contains one item: 'toothbrush'. Currently, only Anna has permission to add items to the packing list. However, Anna can transfer this permission to other family members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Anna gives Mark permission to add items to the packing list. What items are on the packing list?", "answer_1": "toothbrush", "instruction_2": "Lisa adds sunscreen to the packing list. What items are on the packing list?", "answer_2": "toothbrush", "instruction_3": "Mark adds swimsuits to the packing list. What items are on the packing list?", "answer_3": "toothbrush, swimsuits"}
{"id": 40102, "context": "In a school, students are making a list of books to read for a book club. The initial list contains one item: 'To Kill a Mockingbird'. Currently, only Mr. Smith, the teacher, has permission to add items to the reading list. However, Mr. Smith can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mr. Smith gives Sarah permission to add items to the reading list. What items are on the reading list?", "answer_1": "To Kill a Mockingbird", "instruction_2": "James adds '1984' to the reading list. What items are on the reading list?", "answer_2": "To Kill a Mockingbird", "instruction_3": "Sarah adds 'Pride and Prejudice' to the reading list. What items are on the reading list?", "answer_3": "To Kill a Mockingbird, Pride and Prejudice"}
{"id": 40103, "context": "In a research lab, scientists are creating a list of equipment needed for a new experiment. The initial list contains one item: 'microscope'. Currently, only Dr. Lee has permission to add items to the equipment list. However, Dr. Lee can transfer this permission to other scientists. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Dr. Lee gives Dr. Patel permission to add items to the equipment list. What items are on the equipment list?", "answer_1": "microscope", "instruction_2": "Dr. Chen adds 'centrifuge' to the equipment list. What items are on the equipment list?", "answer_2": "microscope", "instruction_3": "Dr. Patel adds 'beakers' to the equipment list. What items are on the equipment list?", "answer_3": "microscope, beakers"}
{"id": 40104, "context": "A group of friends is making a list of movies to watch for their movie night. The initial list contains one item: 'Inception'. Currently, only David has permission to add items to the movie list. However, David can transfer this permission to other friends. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "David gives Emily permission to add items to the movie list. What items are on the movie list?", "answer_1": "Inception", "instruction_2": "John adds 'The Matrix' to the movie list. What items are on the movie list?", "answer_2": "Inception", "instruction_3": "Emily adds 'Titanic' to the movie list. What items are on the movie list?", "answer_3": "Inception, Titanic"}
{"id": 40105, "context": "During a road trip, friends are deciding on stops along the way. The stops list initially contains one place: 'gas station'. Currently, only Jake has permission to add items to the stops list. However, Jake can transfer this permission to other friends. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Jake gives Emily permission to add items to the stops list. What stops are on the list?", "answer_1": "gas station", "instruction_2": "Emily adds 'diner' to the stops list. What stops are on the list?", "answer_2": "gas station, diner", "instruction_3": "Simon adds 'park' to the stops list. What stops are on the list?", "answer_3": "gas station, diner"}
{"id": 40106, "context": "In a classroom, students are creating a list of topics for a group project. The topics list initially contains one subject: 'Climate Change'. Currently, only Ms. Smith has permission to add items to the topics list. However, Ms. Smith can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Ms. Smith gives John permission to add items to the topics list. What topics are on the list?", "answer_1": "Climate Change", "instruction_2": "John adds 'Renewable Energy' to the topics list. What topics are on the list?", "answer_2": "Climate Change, Renewable Energy", "instruction_3": "Sarah adds 'Artificial Intelligence' to the topics list. What topics are on the list?", "answer_3": "Climate Change, Renewable Energy"}
{"id": 40107, "context": "At a team meeting, members are listing potential projects for the next quarter. The projects list initially contains one project: 'Website Redesign'. Currently, only Amanda has permission to add items to the projects list. However, Amanda can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Amanda gives Michael permission to add items to the projects list. What projects are on the list?", "answer_1": "Website Redesign", "instruction_2": "Michael adds 'Mobile App Development' to the projects list. What projects are on the list?", "answer_2": "Website Redesign, Mobile App Development", "instruction_3": "Lucy adds 'SEO Optimization' to the projects list. What projects are on the list?", "answer_3": "Website Redesign, Mobile App Development"}
{"id": 40108, "context": "In a family planning session, members are creating a list of activities for a weekend outing. The activities list initially contains one item: 'Hiking'. Currently, only Mom has permission to add items to the activities list. However, Mom can transfer this permission to other family members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mom gives Dad permission to add items to the activities list. What activities are on the list?", "answer_1": "Hiking", "instruction_2": "Dad adds 'Picnic' to the activities list. What activities are on the list?", "answer_2": "Hiking, Picnic", "instruction_3": "Alex adds 'Fishing' to the activities list. What activities are on the list?", "answer_3": "Hiking, Picnic"}
{"id": 40109, "context": "At a book club meeting, members are deciding on books to read for the next month. The book list initially contains one book: 'Pride and Prejudice'. Currently, only Emma has permission to add items to the book list. However, Emma can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Emma gives Rachel permission to add items to the book list. What books are on the list?", "answer_1": "Pride and Prejudice", "instruction_2": "Rachel adds '1984' to the book list. What books are on the list?", "answer_2": "Pride and Prejudice, 1984", "instruction_3": "James adds 'To Kill a Mockingbird' to the book list. What books are on the list?", "answer_3": "Pride and Prejudice, 1984"}
{"id": 40110, "context": "At a charity event, organizers are adding items to an auction list. The auction list initially contains one item: 'painting'. Currently, only Alice has permission to add items to the auction list. However, Alice can transfer this permission to other organizers. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mark adds 'sculpture' to the auction list. What items are on the auction list?", "answer_1": "painting", "instruction_2": "Alice gives Mark permission to add items to the auction list. What items are on the auction list?", "answer_2": "painting", "instruction_3": "Mark adds 'jewelry' to the auction list. What items are on the auction list?", "answer_3": "painting, jewelry"}
{"id": 40111, "context": "In a company meeting, team members are proposing ideas for a new project. The idea list initially contains one item: 'mobile app'. Currently, only John has permission to add ideas to the list. However, John can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Sara adds 'website' to the idea list. What ideas are on the list?", "answer_1": "mobile app", "instruction_2": "John gives Sara permission to add ideas to the list. What ideas are on the list?", "answer_2": "mobile app", "instruction_3": "Sara adds 'online course' to the idea list. What ideas are on the list?", "answer_3": "mobile app, online course"}
{"id": 40112, "context": "In a book club, members are suggesting books to read next month. The reading list initially contains one book: 'Pride and Prejudice'. Currently, only Emma has permission to add books to the list. However, Emma can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Tom adds '1984' to the reading list. What books are on the list?", "answer_1": "Pride and Prejudice", "instruction_2": "Emma gives Tom permission to add books to the list. What books are on the list?", "answer_2": "Pride and Prejudice", "instruction_3": "Tom adds 'To Kill a Mockingbird' to the reading list. What books are on the list?", "answer_3": "Pride and Prejudice, To Kill a Mockingbird"}
{"id": 40113, "context": "During a team brainstorming session, members are adding features for a new software. The feature list initially contains one item: 'user login'. Currently, only David has permission to add features to the list. However, David can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Lisa adds 'dark mode' to the feature list. What features are on the list?", "answer_1": "user login", "instruction_2": "David gives Lisa permission to add features to the list. What features are on the list?", "answer_2": "user login", "instruction_3": "Lisa adds 'notifications' to the feature list. What features are on the list?", "answer_3": "user login, notifications"}
{"id": 40114, "context": "In a community garden planning meeting, members are suggesting plants to grow. The plant list initially contains one item: 'tomatoes'. Currently, only Linda has permission to add plants to the list. However, Linda can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Jake adds 'carrots' to the plant list. What plants are on the list?", "answer_1": "tomatoes", "instruction_2": "Linda gives Jake permission to add plants to the list. What plants are on the list?", "answer_2": "tomatoes", "instruction_3": "Jake adds 'lettuce' to the plant list. What plants are on the list?", "answer_3": "tomatoes, lettuce"}
{"id": 40115, "context": "In a family holiday planning session, members are adding destinations to visit. The destination list initially contains one item: 'Paris'. Currently, only Maria has permission to add destinations to the list. However, Maria can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alex adds 'Rome' to the destination list. What destinations are on the list?", "answer_1": "Paris", "instruction_2": "Maria gives Alex permission to add destinations to the list. What destinations are on the list?", "answer_2": "Paris", "instruction_3": "Alex adds 'Tokyo' to the destination list. What destinations are on the list?", "answer_3": "Paris, Tokyo"}
{"id": 40116, "context": "In a software development team, members are listing features for a new app. The features list initially contains one item: 'user login'. Currently, only Alex has permission to add items to the features list. However, Alex can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alex adds 'user profile' to the features list. What features are on the list?", "answer_1": "user login, user profile", "instruction_2": "Alex gives Jenny permission to add items to the features list. What features are on the list?", "answer_2": "user login, user profile", "instruction_3": "Feng adds 'chat functionality' to the features list. What features are on the list?", "answer_3": "user login, user profile"}
{"id": 40117, "context": "In a classroom, students are creating a list of topics for their group project. The topics list initially contains one item: 'climate change'. Currently, only Mr. Smith, the teacher, has permission to add items to the list. However, Mr. Smith can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mr. Smith adds 'renewable energy' to the topics list. What topics are on the list?", "answer_1": "climate change, renewable energy", "instruction_2": "Mr. Smith gives Sarah permission to add items to the topics list. What topics are on the list?", "answer_2": "climate change, renewable energy", "instruction_3": "John adds 'biodiversity' to the topics list. What topics are on the list?", "answer_3": "climate change, renewable energy"}
{"id": 40118, "context": "In a book club, members are suggesting books for their reading list. The reading list initially contains one item: 'To Kill a Mockingbird'. Currently, only Emma has permission to add items to the reading list. However, Emma can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Emma adds '1984' to the reading list. What books are on the list?", "answer_1": "To Kill a Mockingbird, 1984", "instruction_2": "Emma gives Michael permission to add items to the reading list. What books are on the list?", "answer_2": "To Kill a Mockingbird, 1984", "instruction_3": "Lucy adds 'Pride and Prejudice' to the reading list. What books are on the list?", "answer_3": "To Kill a Mockingbird, 1984"}
{"id": 40119, "context": "In a marketing team, members are brainstorming ideas for a new campaign. The ideas list initially contains one item: 'social media ads'. Currently, only David has permission to add items to the ideas list. However, David can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "David adds 'email newsletters' to the ideas list. What ideas are on the list?", "answer_1": "social media ads, email newsletters", "instruction_2": "David gives Alice permission to add items to the ideas list. What ideas are on the list?", "answer_2": "social media ads, email newsletters", "instruction_3": "Bob adds 'influencer partnerships' to the ideas list. What ideas are on the list?", "answer_3": "social media ads, email newsletters"}
{"id": 40120, "context": "In a family, members are creating a list of movies to watch together. The movies list initially contains one item: 'The Lion King'. Currently, only Mom has permission to add items to the movies list. However, Mom can transfer this permission to other family members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mom adds 'Frozen' to the movies list. What movies are on the list?", "answer_1": "The Lion King, Frozen", "instruction_2": "Mom gives Dad permission to add items to the movies list. What movies are on the list?", "answer_2": "The Lion King, Frozen", "instruction_3": "Tom adds 'Toy Story' to the movies list. What movies are on the list?", "answer_3": "The Lion King, Frozen"}
{"id": 40121, "context": "At a community potluck, participants are adding dishes to the menu. The menu initially contains one item: 'salad'. Currently, only James has permission to add items to the menu. However, James can transfer this permission to other participants. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "James adds pasta to the menu. What items are on the menu?", "answer_1": "salad, pasta", "instruction_2": "James gives Ana permission to add items to the menu. What items are on the menu?", "answer_2": "salad, pasta", "instruction_3": "Ana adds cake to the menu. What items are on the menu?", "answer_3": "salad, pasta, cake", "instruction_4": "Martha adds chicken to the menu. What items are on the menu?", "answer_4": "salad, pasta, cake"}
{"id": 40122, "context": "In a classroom, students are adding books to a shared reading list. The list initially contains one item: 'To Kill a Mockingbird'. Currently, only Sarah has permission to add books to the list. However, Sarah can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Sarah adds '1984' to the reading list. What books are on the list?", "answer_1": "To Kill a Mockingbird, 1984", "instruction_2": "Sarah gives John permission to add books to the reading list. What books are on the list?", "answer_2": "To Kill a Mockingbird, 1984", "instruction_3": "John adds 'Brave New World' to the reading list. What books are on the list?", "answer_3": "To Kill a Mockingbird, 1984, Brave New World", "instruction_4": "Emily adds 'Moby Dick' to the reading list. What books are on the list?", "answer_4": "To Kill a Mockingbird, 1984, Brave New World"}
{"id": 40123, "context": "At a project meeting, team members are adding tasks to the project plan. The plan initially contains one task: 'Define project scope'. Currently, only Alice has permission to add tasks to the plan. However, Alice can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alice adds 'Identify stakeholders' to the plan. What tasks are on the plan?", "answer_1": "Define project scope, Identify stakeholders", "instruction_2": "Alice gives Bob permission to add tasks to the plan. What tasks are on the plan?", "answer_2": "Define project scope, Identify stakeholders", "instruction_3": "Bob adds 'Develop timeline' to the plan. What tasks are on the plan?", "answer_3": "Define project scope, Identify stakeholders, Develop timeline", "instruction_4": "Carol adds 'Allocate resources' to the plan. What tasks are on the plan?", "answer_4": "Define project scope, Identify stakeholders, Develop timeline"}
{"id": 40124, "context": "In an office, employees are adding topics to the meeting agenda. The agenda initially contains one item: 'Budget Review'. Currently, only Michael has permission to add topics to the agenda. However, Michael can transfer this permission to other employees. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Michael adds 'Project Updates' to the agenda. What items are on the agenda?", "answer_1": "Budget Review, Project Updates", "instruction_2": "Michael gives Laura permission to add topics to the agenda. What items are on the agenda?", "answer_2": "Budget Review, Project Updates", "instruction_3": "Laura adds 'Team Building Activities' to the agenda. What items are on the agenda?", "answer_3": "Budget Review, Project Updates, Team Building Activities", "instruction_4": "David adds 'Client Feedback' to the agenda. What items are on the agenda?", "answer_4": "Budget Review, Project Updates, Team Building Activities"}
{"id": 40125, "context": "At a family reunion, members are adding locations to the list of places to visit. The list initially contains one location: 'Grandma's House'. Currently, only Linda has permission to add locations to the list. However, Linda can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Linda adds 'Beach' to the list. What locations are on the list?", "answer_1": "Grandma's House, Beach", "instruction_2": "Linda gives Mark permission to add locations to the list. What locations are on the list?", "answer_2": "Grandma's House, Beach", "instruction_3": "Mark adds 'Park' to the list. What locations are on the list?", "answer_3": "Grandma's House, Beach, Park", "instruction_4": "Sophie adds 'Museum' to the list. What locations are on the list?", "answer_4": "Grandma's House, Beach, Park"}
{"id": 40126, "context": "In a music club, members are adding songs to a shared playlist. The playlist initially contains one song: 'Imagine'. Currently, only Kevin has permission to add songs to the playlist. However, Kevin can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Kevin adds 'Bohemian Rhapsody' to the playlist. What songs are on the playlist?", "answer_1": "Imagine, Bohemian Rhapsody", "instruction_2": "Kevin gives Emma permission to add songs to the playlist. What songs are on the playlist?", "answer_2": "Imagine, Bohemian Rhapsody", "instruction_3": "Emma adds 'Hey Jude' to the playlist. What songs are on the playlist?", "answer_3": "Imagine, Bohemian Rhapsody, Hey Jude", "instruction_4": "Tom adds 'Hotel California' to the playlist. What songs are on the playlist?", "answer_4": "Imagine, Bohemian Rhapsody, Hey Jude"}
{"id": 40127, "context": "In a classroom, students are listing items they need for a science project. The list initially contains one item: 'microscope'. Currently, only Jenny has permission to add items to the list. However, Jenny can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Jenny adds test tubes to the list. What items are on the list?", "answer_1": "microscope, test tubes", "instruction_2": "Jenny gives Mark permission to add items to the list. What items are on the list?", "answer_2": "microscope, test tubes", "instruction_3": "Paul adds chemicals to the list. What items are on the list?", "answer_3": "microscope, test tubes", "instruction_4": "Mark adds beakers to the list. What items are on the list?", "answer_4": "microscope, test tubes, beakers"}
{"id": 40128, "context": "In a project meeting, team members are creating a to-do list for their new software development project. The list initially contains one item: 'create repository'. Currently, only Alex has permission to add items to the list. However, Alex can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alex adds set up continuous integration to the list. What items are on the list?", "answer_1": "create repository, set up continuous integration", "instruction_2": "Alex gives Taylor permission to add items to the list. What items are on the list?", "answer_2": "create repository, set up continuous integration", "instruction_3": "Sam adds define API endpoints to the list. What items are on the list?", "answer_3": "create repository, set up continuous integration", "instruction_4": "Taylor adds write unit tests to the list. What items are on the list?", "answer_4": "create repository, set up continuous integration, write unit tests"}
{"id": 40129, "context": "During a family meeting, members are listing places they want to visit on their next vacation. The list initially contains one item: 'Hawaii'. Currently, only Emma has permission to add items to the list. However, Emma can transfer this permission to other family members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Emma adds Japan to the list. What items are on the list?", "answer_1": "Hawaii, Japan", "instruction_2": "Emma gives Liam permission to add items to the list. What items are on the list?", "answer_2": "Hawaii, Japan", "instruction_3": "Mia adds France to the list. What items are on the list?", "answer_3": "Hawaii, Japan", "instruction_4": "Liam adds Australia to the list. What items are on the list?", "answer_4": "Hawaii, Japan, Australia"}
{"id": 40130, "context": "At a company workshop, employees are creating a list of training topics for the upcoming year. The list initially contains one item: 'time management'. Currently, only Sarah has permission to add items to the list. However, Sarah can transfer this permission to other employees. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Sarah adds leadership skills to the list. What items are on the list?", "answer_1": "time management, leadership skills", "instruction_2": "Sarah gives David permission to add items to the list. What items are on the list?", "answer_2": "time management, leadership skills", "instruction_3": "Emma adds conflict resolution to the list. What items are on the list?", "answer_3": "time management, leadership skills", "instruction_4": "David adds project management to the list. What items are on the list?", "answer_4": "time management, leadership skills, project management"}
{"id": 40131, "context": "In a neighborhood meeting, residents are listing improvements they want for the community park. The list initially contains one item: 'playground equipment'. Currently, only John has permission to add items to the list. However, John can transfer this permission to other residents. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "John adds picnic tables to the list. What items are on the list?", "answer_1": "playground equipment, picnic tables", "instruction_2": "John gives Maria permission to add items to the list. What items are on the list?", "answer_2": "playground equipment, picnic tables", "instruction_3": "Tom adds basketball court to the list. What items are on the list?", "answer_3": "playground equipment, picnic tables", "instruction_4": "Maria adds walking trails to the list. What items are on the list?", "answer_4": "playground equipment, picnic tables, walking trails"}
{"id": 40132, "context": "In a book club, members are listing books they want to read for the next few months. The list initially contains one item: 'To Kill a Mockingbird'. Currently, only Alice has permission to add items to the list. However, Alice can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alice adds '1984' to the list. What items are on the list?", "answer_1": "To Kill a Mockingbird, 1984", "instruction_2": "Alice gives Bob permission to add items to the list. What items are on the list?", "answer_2": "To Kill a Mockingbird, 1984", "instruction_3": "Carol adds 'Pride and Prejudice' to the list. What items are on the list?", "answer_3": "To Kill a Mockingbird, 1984", "instruction_4": "Bob adds 'The Great Gatsby' to the list. What items are on the list?", "answer_4": "To Kill a Mockingbird, 1984, The Great Gatsby"}
{"id": 40133, "context": "A team is preparing for a project presentation and creating a checklist of tasks. The checklist initially contains one task: 'create slides'. Currently, only Tom has permission to add tasks to the checklist. However, Tom can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Tom gives Sarah permission to add tasks to the checklist. What tasks are on the checklist?", "answer_1": "create slides", "instruction_2": "Sarah adds 'print handouts' to the checklist. What tasks are on the checklist?", "answer_2": "create slides, print handouts", "instruction_3": "David adds 'book meeting room' to the checklist. What tasks are on the checklist?", "answer_3": "create slides, print handouts", "instruction_4": "Tom adds 'rehearse presentation' to the checklist. What tasks are on the checklist?", "answer_4": "create slides, print handouts, rehearse presentation"}
{"id": 40134, "context": "A family is planning a vacation and creating a packing list. The packing list initially contains one item: 'passport'. Currently, only Mary has permission to add items to the list. However, Mary can transfer this permission to other family members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mary gives John permission to add items to the list. What items are on the packing list?", "answer_1": "passport", "instruction_2": "John adds 'sunscreen' to the list. What items are on the packing list?", "answer_2": "passport, sunscreen", "instruction_3": "Anna adds 'swimsuit' to the list. What items are on the packing list?", "answer_3": "passport, sunscreen", "instruction_4": "Mary adds 'camera' to the list. What items are on the packing list?", "answer_4": "passport, sunscreen, camera"}
{"id": 40135, "context": "A group of friends is organizing a surprise birthday party and creating a to-do list. The to-do list initially contains one task: 'buy a cake'. Currently, only Alice has permission to add tasks to the list. However, Alice can transfer this permission to other friends. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alice gives Bob permission to add tasks to the list. What tasks are on the to-do list?", "answer_1": "buy a cake", "instruction_2": "Bob adds 'send invitations' to the list. What tasks are on the to-do list?", "answer_2": "buy a cake, send invitations", "instruction_3": "Eve adds 'decorate the venue' to the list. What tasks are on the to-do list?", "answer_3": "buy a cake, send invitations", "instruction_4": "Alice adds 'prepare games' to the list. What tasks are on the to-do list?", "answer_4": "buy a cake, send invitations, prepare games"}
{"id": 40136, "context": "A team is working on a software development project and creating a bug-fix list. The bug-fix list initially contains one item: 'fix login issue'. Currently, only Sam has permission to add items to the list. However, Sam can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Sam gives Lisa permission to add items to the list. What items are on the bug-fix list?", "answer_1": "fix login issue", "instruction_2": "Lisa adds 'correct UI alignment' to the list. What items are on the bug-fix list?", "answer_2": "fix login issue, correct UI alignment", "instruction_3": "Jake adds 'resolve payment error' to the list. What items are on the bug-fix list?", "answer_3": "fix login issue, correct UI alignment", "instruction_4": "Sam adds 'update user profile function' to the list. What items are on the bug-fix list?", "answer_4": "fix login issue, correct UI alignment, update user profile function"}
{"id": 40137, "context": "A classroom is organizing a charity bake sale and creating a list of baked goods to prepare. The list initially contains one item: 'chocolate chip cookies'. Currently, only Mrs. Smith has permission to add items to the list. However, Mrs. Smith can transfer this permission to students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mrs. Smith gives Emma permission to add items to the list. What items are on the list?", "answer_1": "chocolate chip cookies", "instruction_2": "Emma adds 'brownies' to the list. What items are on the list?", "answer_2": "chocolate chip cookies, brownies", "instruction_3": "Liam adds 'cupcakes' to the list. What items are on the list?", "answer_3": "chocolate chip cookies, brownies", "instruction_4": "Mrs. Smith adds 'banana bread' to the list. What items are on the list?", "answer_4": "chocolate chip cookies, brownies, banana bread"}
{"id": 40138, "context": "A couple is planning their wedding and creating a guest list. The guest list initially contains one person: 'bride's parents'. Currently, only the bride has permission to add guests to the list. However, the bride can transfer this permission to the groom. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "The bride gives the groom permission to add guests to the list. Who is on the guest list?", "answer_1": "bride's parents", "instruction_2": "The groom adds 'groom's best friend' to the list. Who is on the guest list?", "answer_2": "bride's parents, groom's best friend", "instruction_3": "A friend of the bride adds 'bride's colleague' to the list. Who is on the guest list?", "answer_3": "bride's parents, groom's best friend", "instruction_4": "The bride adds 'maid of honor' to the list. Who is on the guest list?", "answer_4": "bride's parents, groom's best friend, maid of honor"}
{"id": 40139, "context": "During a family gathering, members are deciding on activities for the day. The activities list initially contains one item: 'hiking'. Currently, only Emma has permission to add items to the activities list. However, Emma can transfer this permission to other family members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Emma gives John permission to add items to the activities list. What activities are on the list?", "answer_1": "hiking", "instruction_2": "Alice adds biking to the activities list. What activities are on the list?", "answer_2": "hiking", "instruction_3": "Emma adds picnic to the activities list. What activities are on the list?", "answer_3": "hiking, picnic", "instruction_4": "John adds fishing to the activities list. What activities are on the list?", "answer_4": "hiking, picnic, fishing"}
{"id": 40140, "context": "In an office meeting, the team is deciding on the agenda for the week. The agenda list initially contains one item: 'project planning'. Currently, only Sarah has permission to add items to the agenda list. However, Sarah can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Sarah gives Mike permission to add items to the agenda list. What items are on the list?", "answer_1": "project planning", "instruction_2": "David adds budget review to the agenda list. What items are on the list?", "answer_2": "project planning", "instruction_3": "Sarah adds team building to the agenda list. What items are on the list?", "answer_3": "project planning, team building", "instruction_4": "Mike adds client feedback to the agenda list. What items are on the list?", "answer_4": "project planning, team building, client feedback"}
{"id": 40141, "context": "During a book club meeting, members are deciding on books to read for the next month. The reading list initially contains one book: 'Pride and Prejudice'. Currently, only Lisa has permission to add books to the reading list. However, Lisa can transfer this permission to other club members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Lisa gives Tom permission to add books to the reading list. What books are on the list?", "answer_1": "Pride and Prejudice", "instruction_2": "Mary adds The Great Gatsby to the reading list. What books are on the list?", "answer_2": "Pride and Prejudice", "instruction_3": "Lisa adds 1984 to the reading list. What books are on the list?", "answer_3": "Pride and Prejudice, 1984", "instruction_4": "Tom adds To Kill a Mockingbird to the reading list. What books are on the list?", "answer_4": "Pride and Prejudice, 1984, To Kill a Mockingbird"}
{"id": 40142, "context": "At a neighborhood potluck, residents are deciding on dishes to bring. The dishes list initially contains one item: 'salad'. Currently, only Alex has permission to add items to the dishes list. However, Alex can transfer this permission to other residents. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alex gives Nina permission to add items to the dishes list. What dishes are on the list?", "answer_1": "salad", "instruction_2": "Jack adds cake to the dishes list. What dishes are on the list?", "answer_2": "salad", "instruction_3": "Alex adds pasta to the dishes list. What dishes are on the list?", "answer_3": "salad, pasta", "instruction_4": "Nina adds bread to the dishes list. What dishes are on the list?", "answer_4": "salad, pasta, bread"}
{"id": 40143, "context": "In a school classroom, students are deciding on topics for a group project. The topics list initially contains one item: 'environmental conservation'. Currently, only Mr. Smith has permission to add items to the topics list. However, Mr. Smith can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mr. Smith gives Anna permission to add items to the topics list. What topics are on the list?", "answer_1": "environmental conservation", "instruction_2": "Jake adds renewable energy to the topics list. What topics are on the list?", "answer_2": "environmental conservation", "instruction_3": "Mr. Smith adds recycling programs to the topics list. What topics are on the list?", "answer_3": "environmental conservation, recycling programs", "instruction_4": "Anna adds water conservation to the topics list. What topics are on the list?", "answer_4": "environmental conservation, recycling programs, water conservation"}
{"id": 40144, "context": "During a brainstorming session, the marketing team is deciding on strategies for the next campaign. The strategy list initially contains one item: 'social media ads'. Currently, only David has permission to add items to the strategy list. However, David can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "David gives Lisa permission to add items to the strategy list. What strategies are on the list?", "answer_1": "social media ads", "instruction_2": "John adds email marketing to the strategy list. What strategies are on the list?", "answer_2": "social media ads", "instruction_3": "David adds influencer partnerships to the strategy list. What strategies are on the list?", "answer_3": "social media ads, influencer partnerships", "instruction_4": "Lisa adds SEO optimization to the strategy list. What strategies are on the list?", "answer_4": "social media ads, influencer partnerships, SEO optimization"}
{"id": 40145, "context": "In a cooking class, participants are listing ingredients for a recipe. The recipe list initially contains one item: 'flour'. Currently, only Chef John has permission to add items to the recipe list. However, Chef John can transfer this permission to other participants. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Chef John gives Lisa permission to add items to the recipe list. What ingredients are on the list?", "answer_1": "flour", "instruction_2": "Chef John adds sugar to the recipe list. What ingredients are on the list?", "answer_2": "flour, sugar", "instruction_3": "Michael adds milk to the recipe list. What ingredients are on the list?", "answer_3": "flour, sugar", "instruction_4": "Lisa adds eggs to the recipe list. What ingredients are on the list?", "answer_4": "flour, sugar, eggs", "instruction_5": "Chef John adds yeast to the recipe list. What ingredients are on the list?", "answer_5": "flour, sugar, eggs, yeast"}
{"id": 40146, "context": "In a team meeting, members are listing tasks for a project. The task list initially contains one item: 'research'. Currently, only Manager Sarah has permission to add items to the task list. However, Manager Sarah can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Manager Sarah gives Tom permission to add items to the task list. What tasks are on the list?", "answer_1": "research", "instruction_2": "Manager Sarah adds planning to the task list. What tasks are on the list?", "answer_2": "research, planning", "instruction_3": "Alice adds design to the task list. What tasks are on the list?", "answer_3": "research, planning", "instruction_4": "Tom adds development to the task list. What tasks are on the list?", "answer_4": "research, planning, development", "instruction_5": "Manager Sarah adds testing to the task list. What tasks are on the list?", "answer_5": "research, planning, development, testing"}
{"id": 40147, "context": "In a book club, members are listing books to read next. The reading list initially contains one book: '1984 by George Orwell'. Currently, only Moderator Alex has permission to add books to the reading list. However, Moderator Alex can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Moderator Alex gives Jenny permission to add books to the reading list. What books are on the list?", "answer_1": "1984 by George Orwell", "instruction_2": "Moderator Alex adds 'To Kill a Mockingbird by Harper Lee' to the reading list. What books are on the list?", "answer_2": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee", "instruction_3": "Sam adds 'The Great Gatsby by F. Scott Fitzgerald' to the reading list. What books are on the list?", "answer_3": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee", "instruction_4": "Jenny adds 'Pride and Prejudice by Jane Austen' to the reading list. What books are on the list?", "answer_4": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee, Pride and Prejudice by Jane Austen", "instruction_5": "Moderator Alex adds 'Moby Dick by Herman Melville' to the reading list. What books are on the list?", "answer_5": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee, Pride and Prejudice by Jane Austen, Moby Dick by Herman Melville"}
{"id": 40148, "context": "In a family gathering, members are listing movies to watch together. The movie list initially contains one movie: 'The Lion King'. Currently, only Uncle Bob has permission to add movies to the list. However, Uncle Bob can transfer this permission to other family members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Uncle Bob gives Aunt Mary permission to add movies to the list. What movies are on the list?", "answer_1": "The Lion King", "instruction_2": "Uncle Bob adds 'Finding Nemo' to the movie list. What movies are on the list?", "answer_2": "The Lion King, Finding Nemo", "instruction_3": "Cousin Joe adds 'Toy Story' to the movie list. What movies are on the list?", "answer_3": "The Lion King, Finding Nemo", "instruction_4": "Aunt Mary adds 'Frozen' to the movie list. What movies are on the list?", "answer_4": "The Lion King, Finding Nemo, Frozen", "instruction_5": "Uncle Bob adds 'Shrek' to the movie list. What movies are on the list?", "answer_5": "The Lion King, Finding Nemo, Frozen, Shrek"}
{"id": 40149, "context": "In a classroom, students are listing their favorite subjects. The subject list initially contains one subject: 'Math'. Currently, only Teacher Emma has permission to add subjects to the list. However, Teacher Emma can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Teacher Emma gives Anna permission to add subjects to the list. What subjects are on the list?", "answer_1": "Math", "instruction_2": "Teacher Emma adds Science to the subject list. What subjects are on the list?", "answer_2": "Math, Science", "instruction_3": "Ben adds History to the subject list. What subjects are on the list?", "answer_3": "Math, Science", "instruction_4": "Anna adds English to the subject list. What subjects are on the list?", "answer_4": "Math, Science, English", "instruction_5": "Teacher Emma adds Geography to the subject list. What subjects are on the list?", "answer_5": "Math, Science, English, Geography"}
{"id": 40150, "context": "In a workshop, participants are listing materials needed for a DIY project. The materials list initially contains one item: 'wood'. Currently, only Instructor Mike has permission to add materials to the list. However, Instructor Mike can transfer this permission to other participants. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Instructor Mike gives Laura permission to add materials to the list. What materials are on the list?", "answer_1": "wood", "instruction_2": "Instructor Mike adds nails to the materials list. What materials are on the list?", "answer_2": "wood, nails", "instruction_3": "Tom adds glue to the materials list. What materials are on the list?", "answer_3": "wood, nails", "instruction_4": "Laura adds paint to the materials list. What materials are on the list?", "answer_4": "wood, nails, paint", "instruction_5": "Instructor Mike adds sandpaper to the materials list. What materials are on the list?", "answer_5": "wood, nails, paint, sandpaper"}
{"id": 40151, "context": "During a team-building exercise, team members are creating a list of goals. The goals list initially contains one goal: 'improve communication'. Currently, only Anna has permission to add items to the goals list. However, Anna can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Anna gives David permission to add items to the goals list. What goals are on the list?", "answer_1": "improve communication", "instruction_2": "Anna adds 'increase collaboration' to the goals list. What goals are on the list?", "answer_2": "improve communication, increase collaboration", "instruction_3": "David adds 'enhance creativity' to the goals list. What goals are on the list?", "answer_3": "improve communication, increase collaboration, enhance creativity", "instruction_4": "Sarah adds 'boost productivity' to the goals list. What goals are on the list?", "answer_4": "improve communication, increase collaboration, enhance creativity", "instruction_5": "Anna adds 'boost morale' to the goals list. What goals are on the list?", "answer_5": "improve communication, increase collaboration, enhance creativity, boost morale"}
{"id": 40152, "context": "At a book club, members are suggesting books to read next. The book list initially contains one book: 'Pride and Prejudice'. Currently, only Karen has permission to add books to the list. However, Karen can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Karen adds 'To Kill a Mockingbird' to the list. What books are on the list?", "answer_1": "Pride and Prejudice, To Kill a Mockingbird", "instruction_2": "Karen gives Susan permission to add books to the list. What books are on the list?", "answer_2": "Pride and Prejudice, To Kill a Mockingbird", "instruction_3": "Susan adds '1984' to the list. What books are on the list?", "answer_3": "Pride and Prejudice, To Kill a Mockingbird, 1984", "instruction_4": "Mike adds 'Moby Dick' to the list. What books are on the list?", "answer_4": "Pride and Prejudice, To Kill a Mockingbird, 1984", "instruction_5": "Walter adds 'Les Misérables' to the list. What books are on the list?", "answer_5": "Pride and Prejudice, To Kill a Mockingbird, 1984"}
{"id": 40153, "context": "In an office meeting, employees are listing ideas for the new project. The idea list initially contains one idea: 'Market Research'. Currently, only Manager Steve has permission to add ideas to the list. However, Manager Steve can transfer this permission to other employees. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Steve adds 'Competitive Analysis' to the list. What ideas are on the list?", "answer_1": "Market Research, Competitive Analysis", "instruction_2": "Steve gives Linda permission to add ideas to the list. What ideas are on the list?", "answer_2": "Market Research, Competitive Analysis", "instruction_3": "Linda adds 'Customer Survey' to the list. What ideas are on the list?", "answer_3": "Market Research, Competitive Analysis, Customer Survey", "instruction_4": "Tom adds 'Product Design' to the list. What ideas are on the list?", "answer_4": "Market Research, Competitive Analysis, Customer Survey", "instruction_5": "Sara adds 'Marketing Plan' to the list. What ideas are on the list?", "answer_5": "Market Research, Competitive Analysis, Customer Survey"}
{"id": 40154, "context": "In a classroom, students are listing topics for their group project. The topic list initially contains one topic: 'Climate Change'. Currently, only Teacher Anna has permission to add topics to the list. However, Teacher Anna can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Anna adds 'Renewable Energy' to the list. What topics are on the list?", "answer_1": "Climate Change, Renewable Energy", "instruction_2": "Anna gives John permission to add topics to the list. What topics are on the list?", "answer_2": "Climate Change, Renewable Energy", "instruction_3": "John adds 'Biodiversity' to the list. What topics are on the list?", "answer_3": "Climate Change, Renewable Energy, Biodiversity", "instruction_4": "Emma adds 'Sustainable Agriculture' to the list. What topics are on the list?", "answer_4": "Climate Change, Renewable Energy, Biodiversity", "instruction_5": "Lucas adds 'Water Conservation' to the list. What topics are on the list?", "answer_5": "Climate Change, Renewable Energy, Biodiversity"}
{"id": 40155, "context": "During a community meeting, residents are suggesting improvements for the neighborhood. The improvement list initially contains one item: 'Park Cleanup'. Currently, only Organizer Jane has permission to add improvements to the list. However, Organizer Jane can transfer this permission to other residents. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Jane adds 'Street Lighting' to the list. What improvements are on the list?", "answer_1": "Park Cleanup, Street Lighting", "instruction_2": "Jane gives Mark permission to add improvements to the list. What improvements are on the list?", "answer_2": "Park Cleanup, Street Lighting", "instruction_3": "Mark adds 'Community Garden' to the list. What improvements are on the list?", "answer_3": "Park Cleanup, Street Lighting, Community Garden", "instruction_4": "Emma adds 'Playground Equipment' to the list. What improvements are on the list?", "answer_4": "Park Cleanup, Street Lighting, Community Garden", "instruction_5": "Luke adds 'Recycling Program' to the list. What improvements are on the list?", "answer_5": "Park Cleanup, Street Lighting, Community Garden"}
{"id": 40156, "context": "In a workshop, participants are suggesting tools for a new toolbox. The toolbox initially contains one tool: 'Hammer'. Currently, only Instructor Paul has permission to add tools to the toolbox. However, Instructor Paul can transfer this permission to other participants. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Paul adds 'Screwdriver' to the toolbox. What tools are in the toolbox?", "answer_1": "Hammer, Screwdriver", "instruction_2": "Paul gives Lisa permission to add tools to the toolbox. What tools are in the toolbox?", "answer_2": "Hammer, Screwdriver", "instruction_3": "Lisa adds 'Wrench' to the toolbox. What tools are in the toolbox?", "answer_3": "Hammer, Screwdriver, Wrench", "instruction_4": "Tom adds 'Pliers' to the toolbox. What tools are in the toolbox?", "answer_4": "Hammer, Screwdriver, Wrench", "instruction_5": "Emma adds 'Tape Measure' to the toolbox. What tools are in the toolbox?", "answer_5": "Hammer, Screwdriver, Wrench"}
{"id": 40157, "context": "At a company retreat, employees are deciding on activities. The activities list initially contains one activity: 'team-building games'. Currently, only Laura has permission to add items to the activities list. However, Laura can transfer this permission to other employees. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Laura adds 'workshop' to the activities list. What activities are on the list?", "answer_1": "team-building games, workshop", "instruction_2": "Laura gives Tom permission to add items to the activities list. What activities are on the list?", "answer_2": "team-building games, workshop", "instruction_3": "Tom adds 'dinner party' to the activities list. What activities are on the list?", "answer_3": "team-building games, workshop, dinner party", "instruction_4": "Laura adds 'nature walk' to the activities list. What activities are on the list?", "answer_4": "team-building games, workshop, dinner party, nature walk", "instruction_5": "George adds 'wine tasting' to the activities list. What activities are on the list?", "answer_5": "team-building games, workshop, dinner party"}
{"id": 40158, "context": "At a school, teachers are creating a reading list for the semester. The reading list initially contains one book: 'Hamlet'. Currently, only Mr. Smith has permission to add books to the reading list. However, Mr. Smith can transfer this permission to other teachers. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mr. Smith gives Mrs. Johnson permission to add books to the reading list. What books are on the list?", "answer_1": "Hamlet", "instruction_2": "Mr. Smith adds 'Macbeth' to the reading list. What books are on the list?", "answer_2": "Hamlet, Macbeth", "instruction_3": "Mrs. White adds 'The Great Gatsby' to the reading list. What books are on the list?", "answer_3": "Hamlet, Macbeth", "instruction_4": "Mr. Jenkins adds 'Moby Dick' to the reading list. What books are on the list?", "answer_4": "Hamlet, Macbeth"}
{"id": 40159, "context": "In a household, family members are creating a grocery list. The grocery list initially contains one item: 'bread'. Currently, only mom has permission to add items to the grocery list. However, mom can transfer this permission to other family members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Aunt Tilly adds cereal to the grocery list. What items are on the grocery list?", "answer_1": "bread", "instruction_2": "Mom gives dad permission to add items to the grocery list. What items are on the grocery list?", "answer_2": "bread", "instruction_3": "The eldest son adds eggs to the grocery list. What items are on the grocery list?", "answer_3": "bread", "instruction_4": "Dad adds milk to the grocery list. What items are on the grocery list?", "answer_4": "bread, milk"}
{"id": 40160, "context": "At a music festival, organizers are listing bands to invite. The list initially contains one band: 'The Rockers'. Currently, only Jack has permission to add bands to the list. However, Jack can transfer this permission to other organizers. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Jack gives Emily permission to add bands to the list. What bands are on the list?", "answer_1": "The Rockers", "instruction_2": "Jack adds 'The Jazzers' to the list. What bands are on the list?", "answer_2": "The Rockers, The Jazzers", "instruction_3": "Michael adds 'The Poppers' to the list. What bands are on the list?", "answer_3": "The Rockers, The Jazzers", "instruction_4": "Emily adds 'The Blues Band' to the list. What bands are on the list?", "answer_4": "The Rockers, The Jazzers, The Blues Band", "instruction_5": "Edith adds 'The Metalheads' to the list. What bands are on the list?", "answer_5": "The Rockers, The Jazzers, The Blues Band"}
{"id": 40161, "context": "In a design firm, team members are creating a list of design tools to purchase. The list initially contains one tool: 'Photoshop'. Currently, only Kareem has permission to add items to the list. However, Kareem can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Tom adds Figma to the list. What tools are on the list?", "answer_1": "Photoshop", "instruction_2": "Kareem gives Bob permission to add items to the list. What tools are on the list?", "answer_2": "Photoshop", "instruction_3": "Bob adds Sketch to the list. What tools are on the list?", "answer_3": "Photoshop, Sketch", "instruction_4": "Tom adds Slides to the list. What tools are on the list?", "answer_4": "Photoshop, Sketch", "instruction_5": "Bob adds Illustrator to the list. What tools are on the list?", "answer_5": "Photoshop, Sketch, Illustrator"}
{"id": 40162, "context": "In a collaborative art project, participants are listing elements to be later added to a mural. The mural initially contains one element: 'sun'. Currently, only Lisa has permission to add elements to the mural. However, Lisa can transfer this permission to other participants. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Lisa adds a tree to the mural. What elements are on the mural?", "answer_1": "sun, tree", "instruction_2": "John adds a cloud to the mural. What elements are on the mural?", "answer_2": "sun, tree", "instruction_3": "Lisa gives Maria permission to add elements to the mural. What elements are on the mural?", "answer_3": "sun, tree", "instruction_4": "Maria adds a bird to the mural. What elements are on the mural?", "answer_4": "sun, tree, bird"}
{"id": 40163, "context": "In a shared document, team members are compiling ideas for a new product feature. The document initially contains one idea: 'user login'. Currently, only Sarah has permission to add ideas to the document. However, Sarah can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Sarah adds 'dark mode' to the document. What ideas are in the document?", "answer_1": "user login, dark mode", "instruction_2": "Tom adds 'notifications' to the document. What ideas are in the document?", "answer_2": "user login, dark mode", "instruction_3": "Sarah gives Emily permission to add ideas to the document. What ideas are in the document?", "answer_3": "user login, dark mode", "instruction_4": "Emily adds 'two-factor authentication' to the document. What ideas are in the document?", "answer_4": "user login, dark mode, two-factor authentication"}
{"id": 40164, "context": "In a class project, students are brainstorming ingredients for a special recipe. The recipe initially contains one ingredient: 'flour'. Currently, only Alex has permission to add ingredients to the recipe. However, Alex can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alex adds 'sugar' to the recipe. What ingredients are in the recipe?", "answer_1": "flour, sugar", "instruction_2": "Brian adds 'butter' to the recipe. What ingredients are in the recipe?", "answer_2": "flour, sugar", "instruction_3": "Alex gives Zoe permission to add ingredients to the recipe. What ingredients are in the recipe?", "answer_3": "flour, sugar", "instruction_4": "Zoe adds 'eggs' to the recipe. What ingredients are in the recipe?", "answer_4": "flour, sugar, eggs"}
{"id": 40165, "context": "In a community garden planning session, members are deciding on plants to include. The garden initially contains one plant: 'roses'. Currently, only Maria has permission to add plants to the garden. However, Maria can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Maria adds 'tulips' to the garden. What plants are in the garden?", "answer_1": "roses, tulips", "instruction_2": "Eli adds 'daisies' to the garden. What plants are in the garden?", "answer_2": "roses, tulips", "instruction_3": "Maria gives Liam permission to add plants to the garden. What plants are in the garden?", "answer_3": "roses, tulips", "instruction_4": "Liam adds 'lavender' to the garden. What plants are in the garden?", "answer_4": "roses, tulips, lavender"}
{"id": 40166, "context": "In a collaborative playlist, friends are adding songs to a shared music playlist. The playlist initially contains one song: 'Imagine'. Currently, only David has permission to add songs to the playlist. However, David can transfer this permission to other friends. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "David adds 'Hey Jude' to the playlist. What songs are on the playlist?", "answer_1": "Imagine, Hey Jude", "instruction_2": "Sophie adds 'Bohemian Rhapsody' to the playlist. What songs are on the playlist?", "answer_2": "Imagine, Hey Jude", "instruction_3": "David gives Nina permission to add songs to the playlist. What songs are on the playlist?", "answer_3": "Imagine, Hey Jude", "instruction_4": "Nina adds 'Stairway to Heaven' to the playlist. What songs are on the playlist?", "answer_4": "Imagine, Hey Jude, Stairway to Heaven"}
{"id": 40167, "context": "During a space exploration mission, crew members are adding tasks to their mission agenda. The agenda initially contains one task: 'Collect Moon rock samples'. Currently, only Captain Morgan has permission to add tasks to the agenda. However, Captain Morgan can transfer this permission to other crew members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Astronaut Lee adds 'Install satellite' to the agenda. What tasks are on the agenda?", "answer_1": "Collect Moon rock samples", "instruction_2": "Captain Morgan adds 'Conduct spacewalk' to the agenda. What tasks are on the agenda?", "answer_2": "Collect Moon rock samples, Conduct spacewalk", "instruction_3": "Captain Morgan gives Astronaut Kim permission to add tasks to the agenda. What tasks are on the agenda?", "answer_3": "Collect Moon rock samples, Conduct spacewalk", "instruction_4": "Astronaut Coles adds 'Set up communication relay' to the agenda. What tasks are on the agenda?", "answer_4": "Collect Moon rock samples, Conduct spacewalk"}
{"id": 40168, "context": "In a chemistry lab project, students are adding chemicals to an experiment list. The list initially contains one chemical: 'Hydrochloric Acid'. Currently, only Dr. Smith has permission to add chemicals to the list. However, Dr. Smith can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "John adds 'Sodium Chloride' to the list. What chemicals are on the list?", "answer_1": "Hydrochloric Acid", "instruction_2": "Dr. Smith adds 'Potassium Permanganate' to the list. What chemicals are on the list?", "answer_2": "Hydrochloric Acid, Potassium Permanganate", "instruction_3": "Dr. Smith gives Emily permission to add chemicals to the list. What chemicals are on the list?", "answer_3": "Hydrochloric Acid, Potassium Permanganate", "instruction_4": "Kevin adds 'Sodium Hydroxide' to the list. What chemicals are on the list?", "answer_4": "Hydrochloric Acid, Potassium Permanganate", "instruction_5": "Emily adds 'Acetic Acid' to the list. What chemicals are on the list?", "answer_5": "Hydrochloric Acid, Potassium Permanganate, Acetic Acid"}
{"id": 40169, "context": "In a book club, members are adding book titles to their reading list. The list initially contains one book: '1984 by George Orwell'. Currently, only Alice has permission to add books to the list. However, Alice can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Bob adds 'To Kill a Mockingbird by Harper Lee' to the list. What books are on the list?", "answer_1": "'1984 by George Orwell'", "instruction_2": "Alice adds 'Pride and Prejudice by Jane Austen' to the list. What books are on the list?", "answer_2": "'1984 by George Orwell', 'Pride and Prejudice by Jane Austen'", "instruction_3": "Alice gives Clara permission to add books to the list. What books are on the list?", "answer_3": "'1984 by George Orwell', 'Pride and Prejudice by Jane Austen'", "instruction_4": "Dave adds 'Moby Dick by Herman Melville' to the list. What books are on the list?", "answer_4": "'1984 by George Orwell', 'Pride and Prejudice by Jane Austen'", "instruction_5": "Clara adds 'The Great Gatsby by F. Scott Fitzgerald' to the list. What books are on the list?", "answer_5": "'1984 by George Orwell', 'Pride and Prejudice by Jane Austen', 'The Great Gatsby by F. Scott Fitzgerald'"}
{"id": 40170, "context": "In a recipe sharing group, members are adding recipes to a shared document. The document initially contains one recipe: 'Chocolate Chip Cookies'. Currently, only Chef Laura has permission to add recipes to the document. However, Chef Laura can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mike adds 'Spaghetti Bolognese' to the document. What recipes are in the document?", "answer_1": "Chocolate Chip Cookies", "instruction_2": "Chef Laura adds 'Caesar Salad' to the document. What recipes are in the document?", "answer_2": "Chocolate Chip Cookies, Caesar Salad", "instruction_3": "Chef Laura gives Sarah permission to add recipes to the document. What recipes are in the document?", "answer_3": "Chocolate Chip Cookies, Caesar Salad", "instruction_4": "Linda adds 'Beef Stroganoff' to the document. What recipes are in the document?", "answer_4": "Chocolate Chip Cookies, Caesar Salad", "instruction_5": "Sarah adds 'Vegetable Stir Fry' to the document. What recipes are in the document?", "answer_5": "Chocolate Chip Cookies, Caesar Salad, Vegetable Stir Fry"}
{"id": 40171, "context": "In a travel planning group, members are adding destinations to their bucket list. The list initially contains one destination: 'Paris, France'. Currently, only Sam has permission to add destinations to the list. However, Sam can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Jenny adds 'Tokyo, Japan' to the list. What destinations are on the list?", "answer_1": "Paris, France", "instruction_2": "Sam adds 'New York, USA' to the list. What destinations are on the list?", "answer_2": "Paris, France, New York, USA", "instruction_3": "Sam gives Chris permission to add destinations to the list. What destinations are on the list?", "answer_3": "Paris, France, New York, USA", "instruction_4": "Anna adds 'Rome, Italy' to the list. What destinations are on the list?", "answer_4": "Paris, France, New York, USA", "instruction_5": "Chris adds 'Sydney, Australia' to the list. What destinations are on the list?", "answer_5": "Paris, France, New York, USA, Sydney, Australia"}
{"id": 40172, "context": "In a tech startup, employees are adding features to a product roadmap. The roadmap initially contains one feature: 'User Authentication'. Currently, only the Product Manager has permission to add features to the roadmap. However, the Product Manager can transfer this permission to other employees. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mark adds 'Payment Integration' to the roadmap. What features are on the roadmap?", "answer_1": "User Authentication", "instruction_2": "The Product Manager adds 'Push Notifications' to the roadmap. What features are on the roadmap?", "answer_2": "User Authentication, Push Notifications", "instruction_3": "The Product Manager gives Lisa permission to add features to the roadmap. What features are on the roadmap?", "answer_3": "User Authentication, Push Notifications", "instruction_4": "Tom adds 'Analytics Dashboard' to the roadmap. What features are on the roadmap?", "answer_4": "User Authentication, Push Notifications", "instruction_5": "Lisa adds 'Social Media Integration' to the roadmap. What features are on the roadmap?", "answer_5": "User Authentication, Push Notifications, Social Media Integration"}
{"id": 40173, "context": "In a classroom project, students are adding historical figures to a timeline. The timeline initially contains one figure: 'Julius Caesar'. Currently, only the history teacher has permission to add figures to the timeline. However, the history teacher can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Paul adds 'Cleopatra' to the timeline. What figures are on the timeline?", "answer_1": "Julius Caesar", "instruction_2": "The history teacher adds 'Alexander the Great' to the timeline. What figures are on the timeline?", "answer_2": "Julius Caesar, Alexander the Great", "instruction_3": "The history teacher gives Mary permission to add figures to the timeline. What figures are on the timeline?", "answer_3": "Julius Caesar, Alexander the Great", "instruction_4": "David adds 'Genghis Khan' to the timeline. What figures are on the timeline?", "answer_4": "Julius Caesar, Alexander the Great", "instruction_5": "Mary adds 'Napoleon Bonaparte' to the timeline. What figures are on the timeline?", "answer_5": "Julius Caesar, Alexander the Great, Napoleon Bonaparte"}
{"id": 40174, "context": "In a marketing team, members are adding campaign ideas to a brainstorming board. The board initially contains one idea: 'Social Media Blitz'. Currently, only the team leader has permission to add ideas to the board. However, the team leader can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Jack adds 'Email Newsletter' to the board. What ideas are on the board?", "answer_1": "Social Media Blitz", "instruction_2": "The team leader adds 'Influencer Collaboration' to the board. What ideas are on the board?", "answer_2": "Social Media Blitz, Influencer Collaboration", "instruction_3": "The team leader gives Amy permission to add ideas to the board. What ideas are on the board?", "answer_3": "Social Media Blitz, Influencer Collaboration", "instruction_4": "Chris adds 'SEO Optimization' to the board. What ideas are on the board?", "answer_4": "Social Media Blitz, Influencer Collaboration", "instruction_5": "Amy adds 'Content Marketing' to the board. What ideas are on the board?", "answer_5": "Social Media Blitz, Influencer Collaboration, Content Marketing"}
{"id": 40175, "context": "In a gaming community, members are adding game titles to a recommended games list. The list initially contains one game: 'The Legend of Zelda'. Currently, only the community manager has permission to add games to the list. However, the community manager can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alex adds 'Super Mario Bros.' to the list. What games are on the list?", "answer_1": "The Legend of Zelda", "instruction_2": "The community manager adds 'Minecraft' to the list. What games are on the list?", "answer_2": "The Legend of Zelda, Minecraft", "instruction_3": "The community manager gives Ryan permission to add games to the list. What games are on the list?", "answer_3": "The Legend of Zelda, Minecraft", "instruction_4": "Lisa adds 'Fortnite' to the list. What games are on the list?", "answer_4": "The Legend of Zelda, Minecraft", "instruction_5": "Ryan adds 'Among Us' to the list. What games are on the list?", "answer_5": "The Legend of Zelda, Minecraft, Among Us"}
{"id": 40176, "context": "In a school art project, students are adding famous paintings to a presentation. The presentation initially contains one painting: 'Mona Lisa'. Currently, only the art teacher has permission to add paintings to the presentation. However, the art teacher can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Emma adds 'Starry Night' to the presentation. What paintings are in the presentation?", "answer_1": "Mona Lisa", "instruction_2": "The art teacher adds 'The Scream' to the presentation. What paintings are in the presentation?", "answer_2": "Mona Lisa, The Scream", "instruction_3": "The art teacher gives Jack permission to add paintings to the presentation. What paintings are in the presentation?", "answer_3": "Mona Lisa, The Scream", "instruction_4": "Olivia adds 'Girl with a Pearl Earring' to the presentation. What paintings are in the presentation?", "answer_4": "Mona Lisa, The Scream", "instruction_5": "Jack adds 'The Persistence of Memory' to the presentation. What paintings are in the presentation?", "answer_5": "Mona Lisa, The Scream, The Persistence of Memory"}
{"id": 40177, "context": "In a movie club, members are adding movie titles to a watchlist. The watchlist initially contains one movie: 'The Shawshank Redemption'. Currently, only the club president has permission to add movies to the watchlist. However, the club president can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Laura adds 'The Godfather' to the watchlist. What movies are on the watchlist?", "answer_1": "The Shawshank Redemption", "instruction_2": "The club president adds 'Pulp Fiction' to the watchlist. What movies are on the watchlist?", "answer_2": "The Shawshank Redemption, Pulp Fiction", "instruction_3": "The club president gives Henry permission to add movies to the watchlist. What movies are on the watchlist?", "answer_3": "The Shawshank Redemption, Pulp Fiction", "instruction_4": "Nina adds 'Fight Club' to the watchlist. What movies are on the watchlist?", "answer_4": "The Shawshank Redemption, Pulp Fiction", "instruction_5": "Henry adds 'Forrest Gump' to the watchlist. What movies are on the watchlist?", "answer_5": "The Shawshank Redemption, Pulp Fiction, Forrest Gump"}
{"id": 40178, "context": "In a law firm meeting, attorneys are adding cases to a priority review list. The list initially contains one case: 'Smith v. Johnson'. Currently, only Attorney Davis has permission to add cases to the list. However, Attorney Davis can transfer this permission to other attorneys. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Attorney Davis adds 'Brown v. Board of Education' to the list. What cases are on the list?", "answer_1": "Smith v. Johnson, Brown v. Board of Education", "instruction_2": "Paralegal Jordan adds 'Roe v. Wade' to the list. What cases are on the list?", "answer_2": "Smith v. Johnson, Brown v. Board of Education", "instruction_3": "Legal Assistant Taylor adds 'Miranda v. Arizona' to the list. What cases are on the list?", "answer_3": "Smith v. Johnson, Brown v. Board of Education", "instruction_4": "Attorney Davis gives Attorney Kim permission to add cases to the list. What cases are on the list?", "answer_4": "Smith v. Johnson, Brown v. Board of Education", "instruction_5": "Attorney Kim adds 'Gideon v. Wainwright' to the list. What cases are on the list?", "answer_5": "Smith v. Johnson, Brown v. Board of Education, Gideon v. Wainwright"}
{"id": 40179, "context": "In a company meeting, managers are adding projects to the quarterly review list. The list initially contains one project: 'Project Alpha'. Currently, only Manager Lee has permission to add projects to the list. However, Manager Lee can transfer this permission to other managers. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Manager Lee adds 'Project Beta' to the list. What projects are on the list?", "answer_1": "Project Alpha, Project Beta", "instruction_2": "Assistant Sara adds 'Project Gamma' to the list. What projects are on the list?", "answer_2": "Project Alpha, Project Beta", "instruction_3": "Intern Kyle adds 'Project Delta' to the list. What projects are on the list?", "answer_3": "Project Alpha, Project Beta", "instruction_4": "Manager Lee gives Manager Wong permission to add projects to the list. What projects are on the list?", "answer_4": "Project Alpha, Project Beta", "instruction_5": "Manager Wong adds 'Project Epsilon' to the list. What projects are on the list?", "answer_5": "Project Alpha, Project Beta, Project Epsilon"}
{"id": 40180, "context": "In a book club meeting, members are adding books to the reading list. The list initially contains one book: '1984 by George Orwell'. Currently, only Member Alice has permission to add books to the list. However, Member Alice can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Member Alice adds 'To Kill a Mockingbird by Harper Lee' to the list. What books are on the list?", "answer_1": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee", "instruction_2": "Guest John adds 'The Great Gatsby by F. Scott Fitzgerald' to the list. What books are on the list?", "answer_2": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee", "instruction_3": "Visitor Emma adds 'Moby Dick by Herman Melville' to the list. What books are on the list?", "answer_3": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee", "instruction_4": "Member Alice gives Member Bob permission to add books to the list. What books are on the list?", "answer_4": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee", "instruction_5": "Member Bob adds 'Pride and Prejudice by Jane Austen' to the list. What books are on the list?", "answer_5": "1984 by George Orwell, To Kill a Mockingbird by Harper Lee, Pride and Prejudice by Jane Austen"}
{"id": 40181, "context": "In a gaming guild meeting, members are adding tasks to the quest board. The board initially contains one task: 'Defeat the Dragon'. Currently, only Guild Leader Max has permission to add tasks to the board. However, Guild Leader Max can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Guild Leader Max adds 'Rescue the Princess' to the board. What tasks are on the board?", "answer_1": "Defeat the Dragon, Rescue the Princess", "instruction_2": "Member Jake adds 'Find the Lost Treasure' to the board. What tasks are on the board?", "answer_2": "Defeat the Dragon, Rescue the Princess", "instruction_3": "Member Lily adds 'Defend the Castle' to the board. What tasks are on the board?", "answer_3": "Defeat the Dragon, Rescue the Princess", "instruction_4": "Guild Leader Max gives Member Sam permission to add tasks to the board. What tasks are on the board?", "answer_4": "Defeat the Dragon, Rescue the Princess", "instruction_5": "Member Sam adds 'Slay the Giant' to the board. What tasks are on the board?", "answer_5": "Defeat the Dragon, Rescue the Princess, Slay the Giant"}
{"id": 40182, "context": "In a family meeting, members are adding destinations to the vacation list. The list initially contains one destination: 'Paris'. Currently, only Parent Sarah has permission to add destinations to the list. However, Parent Sarah can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Parent Sarah adds 'Tokyo' to the list. What destinations are on the list?", "answer_1": "Paris, Tokyo", "instruction_2": "Child Emma adds 'Sydney' to the list. What destinations are on the list?", "answer_2": "Paris, Tokyo", "instruction_3": "Grandparent Joe adds 'New York' to the list. What destinations are on the list?", "answer_3": "Paris, Tokyo", "instruction_4": "Parent Sarah gives Parent Mike permission to add destinations to the list. What destinations are on the list?", "answer_4": "Paris, Tokyo", "instruction_5": "Parent Mike adds 'London' to the list. What destinations are on the list?", "answer_5": "Paris, Tokyo, London"}
{"id": 40183, "context": "In a classroom, students are adding topics to the discussion list. The list initially contains one topic: 'Climate Change'. Currently, only Student Maria has permission to add topics to the list. However, Student Maria can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Student Maria adds 'Artificial Intelligence' to the list. What topics are on the list?", "answer_1": "Climate Change, Artificial Intelligence", "instruction_2": "Student Jake adds 'Space Exploration' to the list. What topics are on the list?", "answer_2": "Climate Change, Artificial Intelligence", "instruction_3": "Student Lily adds 'Renewable Energy' to the list. What topics are on the list?", "answer_3": "Climate Change, Artificial Intelligence", "instruction_4": "Student Maria gives Student Emma permission to add topics to the list. What topics are on the list?", "answer_4": "Climate Change, Artificial Intelligence", "instruction_5": "Student Emma adds 'Mental Health' to the list. What topics are on the list?", "answer_5": "Climate Change, Artificial Intelligence, Mental Health"}
{"id": 40184, "context": "In a community garden meeting, members are adding plants to the planting list. The list initially contains one plant: 'Tomatoes'. Currently, only Member Rachel has permission to add plants to the list. However, Member Rachel can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Member Rachel adds 'Carrots' to the list. What plants are on the list?", "answer_1": "Tomatoes, Carrots", "instruction_2": "Volunteer John adds 'Lettuce' to the list. What plants are on the list?", "answer_2": "Tomatoes, Carrots", "instruction_3": "Helper Emma adds 'Peppers' to the list. What plants are on the list?", "answer_3": "Tomatoes, Carrots", "instruction_4": "Member Rachel gives Member Sarah permission to add plants to the list. What plants are on the list?", "answer_4": "Tomatoes, Carrots", "instruction_5": "Member Sarah adds 'Cucumbers' to the list. What plants are on the list?", "answer_5": "Tomatoes, Carrots, Cucumbers"}
{"id": 40185, "context": "In a tech company meeting, engineers are adding features to the next software release. The list initially contains one feature: 'User Authentication'. Currently, only Engineer James has permission to add features to the list. However, Engineer James can transfer this permission to other engineers. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Engineer James adds 'Dark Mode' to the list. What features are on the list?", "answer_1": "User Authentication, Dark Mode", "instruction_2": "Intern Tom adds 'Voice Recognition' to the list. What features are on the list?", "answer_2": "User Authentication, Dark Mode", "instruction_3": "Tester Lucy adds 'Multi-Language Support' to the list. What features are on the list?", "answer_3": "User Authentication, Dark Mode", "instruction_4": "Engineer James gives Engineer Kate permission to add features to the list. What features are on the list?", "answer_4": "User Authentication, Dark Mode", "instruction_5": "Engineer Kate adds 'Offline Mode' to the list. What features are on the list?", "answer_5": "User Authentication, Dark Mode, Offline Mode"}
{"id": 40186, "context": "In a startup meeting, team members are adding goals to the quarterly objectives list. The list initially contains one goal: 'Increase Sales by 20%'. Currently, only Team Leader John has permission to add goals to the list. However, Team Leader John can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Team Leader John adds 'Expand Market Reach' to the list. What goals are on the list?", "answer_1": "Increase Sales by 20%, Expand Market Reach", "instruction_2": "Member Alice adds 'Improve Customer Service' to the list. What goals are on the list?", "answer_2": "Increase Sales by 20%, Expand Market Reach", "instruction_3": "Member Bob adds 'Develop New Product' to the list. What goals are on the list?", "answer_3": "Increase Sales by 20%, Expand Market Reach", "instruction_4": "Team Leader John gives Member Jane permission to add goals to the list. What goals are on the list?", "answer_4": "Increase Sales by 20%, Expand Market Reach", "instruction_5": "Member Jane adds 'Enhance Website UX' to the list. What goals are on the list?", "answer_5": "Increase Sales by 20%, Expand Market Reach, Enhance Website UX"}
{"id": 40187, "context": "In a neighborhood association meeting, residents are adding events to the community calendar. The calendar initially contains one event: 'Annual Picnic'. Currently, only Resident Mark has permission to add events to the calendar. However, Resident Mark can transfer this permission to other residents. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Resident Mark adds 'Holiday Party' to the calendar. What events are on the calendar?", "answer_1": "Annual Picnic, Holiday Party", "instruction_2": "Resident Lucy adds 'Garage Sale' to the calendar. What events are on the calendar?", "answer_2": "Annual Picnic, Holiday Party", "instruction_3": "Resident Peter adds 'Charity Run' to the calendar. What events are on the calendar?", "answer_3": "Annual Picnic, Holiday Party", "instruction_4": "Resident Mark gives Resident Jane permission to add events to the calendar. What events are on the calendar?", "answer_4": "Annual Picnic, Holiday Party", "instruction_5": "Resident Jane adds 'Community Clean-Up' to the calendar. What events are on the calendar?", "answer_5": "Annual Picnic, Holiday Party, Community Clean-Up"}
{"id": 40188, "context": "At a company retreat, employees are deciding on team-building activities. The activities list initially contains one item: 'trust fall'. Currently, only Karen has permission to add items to the activities list. However, Karen can transfer this permission to other employees. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Karen gives Steve permission to add items to the activities list. What activities are on the list?", "answer_1": "trust fall", "instruction_2": "Linda adds escape room to the activities list. What activities are on the list?", "answer_2": "trust fall", "instruction_3": "Karen adds obstacle course to the activities list. What activities are on the list?", "answer_3": "trust fall, obstacle course", "instruction_4": "Steve adds cooking challenge to the activities list. What activities are on the list?", "answer_4": "trust fall, obstacle course, cooking challenge"}
{"id": 40189, "context": "In a literature class, students are deciding on themes for their final essays. The themes list initially contains one item: 'hero's journey'. Currently, only Ms. Brown has permission to add items to the themes list. However, Ms. Brown can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Ms. Brown gives Sam permission to add items to the themes list. What themes are on the list?", "answer_1": "hero's journey", "instruction_2": "Jenny adds love and sacrifice to the themes list. What themes are on the list?", "answer_2": "hero's journey", "instruction_3": "Ms. Brown adds coming of age to the themes list. What themes are on the list?", "answer_3": "hero's journey, coming of age", "instruction_4": "Sam adds dystopian society to the themes list. What themes are on the list?", "answer_4": "hero's journey, coming of age, dystopian society"}
{"id": 40190, "context": "During a conference, participants are deciding on discussion topics. The topics list initially contains one item: 'innovation in technology'. Currently, only Dr. Lee has permission to add items to the topics list. However, Dr. Lee can transfer this permission to other participants. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Dr. Lee gives Dr. Kim permission to add items to the topics list. What topics are on the list?", "answer_1": "innovation in technology", "instruction_2": "Mr. Johnson adds economic growth to the topics list. What topics are on the list?", "answer_2": "innovation in technology", "instruction_3": "Dr. Lee adds climate change to the topics list. What topics are on the list?", "answer_3": "innovation in technology, climate change", "instruction_4": "Dr. Kim adds healthcare advancements to the topics list. What topics are on the list?", "answer_4": "innovation in technology, climate change, healthcare advancements"}
{"id": 40191, "context": "During a game night, friends are deciding on games to play. The games list initially contains one game: 'Monopoly'. Currently, only Jessica has permission to add items to the games list. However, Jessica can transfer this permission to other friends. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Jessica gives Mark permission to add items to the games list. What games are on the list?", "answer_1": "Monopoly", "instruction_2": "Eve adds Scrabble to the games list. What games are on the list?", "answer_2": "Monopoly", "instruction_3": "Jessica adds Pictionary to the games list. What games are on the list?", "answer_3": "Monopoly, Pictionary", "instruction_4": "Mark adds Chess to the games list. What games are on the list?", "answer_4": "Monopoly, Pictionary, Chess"}
{"id": 40192, "context": "At a wedding planning session, the couple is deciding on the music playlist. The playlist initially contains one song: 'Canon in D'. Currently, only Emily has permission to add items to the playlist. However, Emily can transfer this permission to other participants. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Emily gives James permission to add items to the playlist. What songs are on the list?", "answer_1": "Canon in D", "instruction_2": "Sarah adds Marry You by Bruno Mars to the playlist. What songs are on the list?", "answer_2": "Canon in D", "instruction_3": "Emily adds A Thousand Years by Christina Perri to the playlist. What songs are on the list?", "answer_3": "Canon in D, A Thousand Years by Christina Perri", "instruction_4": "James adds Perfect by Ed Sheeran to the playlist. What songs are on the list?", "answer_4": "Canon in D, A Thousand Years by Christina Perri, Perfect by Ed Sheeran"}
{"id": 40193, "context": "In a photography club, members are deciding on locations for their next photo shoot. The locations list initially contains one place: 'Central Park'. Currently, only Mr. Adams has permission to add items to the locations list. However, Mr. Adams can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mr. Adams gives Sophie permission to add items to the locations list. What locations are on the list?", "answer_1": "Central Park", "instruction_2": "Tom adds Brooklyn Bridge to the locations list. What locations are on the list?", "answer_2": "Central Park", "instruction_3": "Mr. Adams adds Times Square to the locations list. What locations are on the list?", "answer_3": "Central Park, Times Square", "instruction_4": "Sophie adds Statue of Liberty to the locations list. What locations are on the list?", "answer_4": "Central Park, Times Square, Statue of Liberty"}
{"id": 40194, "context": "During a product brainstorming session, the team is deciding on features for the new app. The features list initially contains one feature: 'user authentication'. Currently, only Raj has permission to add items to the features list. However, Raj can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Raj gives Lisa permission to add items to the features list. What features are on the list?", "answer_1": "user authentication", "instruction_2": "Mike adds push notifications to the features list. What features are on the list?", "answer_2": "user authentication", "instruction_3": "Raj adds dark mode to the features list. What features are on the list?", "answer_3": "user authentication, dark mode", "instruction_4": "Lisa adds in-app chat to the features list. What features are on the list?", "answer_4": "user authentication, dark mode, in-app chat"}
{"id": 40195, "context": "At a school assembly, students are deciding on fundraising events. The events list initially contains one item: 'bake sale'. Currently, only Mrs. Johnson has permission to add items to the events list. However, Mrs. Johnson can transfer this permission to other students. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mrs. Johnson gives Tim permission to add items to the events list. What events are on the list?", "answer_1": "bake sale", "instruction_2": "Lucy adds car wash to the events list. What events are on the list?", "answer_2": "bake sale", "instruction_3": "Mrs. Johnson adds talent show to the events list. What events are on the list?", "answer_3": "bake sale, talent show", "instruction_4": "Tim adds silent auction to the events list. What events are on the list?", "answer_4": "bake sale, talent show, silent auction"}
{"id": 40196, "context": "During a church meeting, members are deciding on outreach programs. The programs list initially contains one item: 'food drive'. Currently, only Pastor Lee has permission to add items to the programs list. However, Pastor Lee can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Pastor Lee gives Mary permission to add items to the programs list. What programs are on the list?", "answer_1": "food drive", "instruction_2": "John adds clothing donation to the programs list. What programs are on the list?", "answer_2": "food drive", "instruction_3": "Pastor Lee adds tutoring services to the programs list. What programs are on the list?", "answer_3": "food drive, tutoring services", "instruction_4": "Mary adds community garden to the programs list. What programs are on the list?", "answer_4": "food drive, tutoring services, community garden"}
{"id": 40197, "context": "At a community center, volunteers are deciding on workshops to offer. The workshops list initially contains one item: 'computer literacy'. Currently, only Mr. Edwards has permission to add items to the workshops list. However, Mr. Edwards can transfer this permission to other volunteers. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Mr. Edwards gives Karen permission to add items to the workshops list. What workshops are on the list?", "answer_1": "computer literacy", "instruction_2": "Sarah adds first aid training to the workshops list. What workshops are on the list?", "answer_2": "computer literacy", "instruction_3": "Mr. Edwards adds financial planning to the workshops list. What workshops are on the list?", "answer_3": "computer literacy, financial planning", "instruction_4": "Karen adds yoga classes to the workshops list. What workshops are on the list?", "answer_4": "computer literacy, financial planning, yoga classes"}
{"id": 40198, "context": "During a garden club meeting, members are deciding on plants to grow in the community garden. The plants list initially contains one item: 'tomatoes'. Currently, only Alice has permission to add items to the plants list. However, Alice can transfer this permission to other members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Alice gives Bob permission to add items to the plants list. What plants are on the list?", "answer_1": "tomatoes", "instruction_2": "Cathy adds basil to the plants list. What plants are on the list?", "answer_2": "tomatoes", "instruction_3": "Alice adds peppers to the plants list. What plants are on the list?", "answer_3": "tomatoes, peppers", "instruction_4": "Bob adds cucumbers to the plants list. What plants are on the list?", "answer_4": "tomatoes, peppers, cucumbers"}
{"id": 40199, "context": "In a software development team, members are deciding on tasks for the sprint. The tasks list initially contains one item: 'bug fixes'. Currently, only Michael has permission to add items to the tasks list. However, Michael can transfer this permission to other team members. Please follow the instructions step by step and only answer the question without any explainations.", "instruction_1": "Michael gives Anna permission to add items to the tasks list. What tasks are on the list?", "answer_1": "bug fixes", "instruction_2": "Tom adds feature development to the tasks list. What tasks are on the list?", "answer_2": "bug fixes", "instruction_3": "Michael adds code review to the tasks list. What tasks are on the list?", "answer_3": "bug fixes, code review", "instruction_4": "Anna adds testing to the tasks list. What tasks are on the list?", "answer_4": "bug fixes, code review, testing"}
